xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *                 TEXAS INSTRUMENTS INCORPORATED PROPRIETARY INFORMATION
 *
 *                 Property of Texas Instruments, Unauthorized reproduction and/or distribution
 *                 is strictly prohibited.  This product  is  protected  under  copyright  law
 *                 and  trade  secret law as an  unpublished work.
 *                 (C) Copyright 2021 Texas Instruments Inc.  All rights reserved.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       bq7982x_regs.h
 *  Project:    TIBMS
 *  Module:     COMIF
 *  Generator:  Code generation tool (if any)
 *
 *  Description:  Register definitions for BQ79600 device
 *
 *--------------------------------------------------------------------------------------------------------------------
 * Author:  SEM
 *--------------------------------------------------------------------------------------------------------------------
 * Revision History (top to bottom: first revision to last revision)
 *--------------------------------------------------------------------------------------------------------------------
 * Version        Date         Author               Change ID        Description
 *--------------------------------------------------------------------------------------------------------------------
 * 10.00.00       25MAR2024    SEM                0000000000000    Initial version
 * 10.00.01       08May2024    SEM                0000000000000    Updated as per the latest datasheet
 *
 *********************************************************************************************************************/

#ifndef BQ7982X_REGS_H
#define BQ7982X_REGS_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

/*********************************************************************************************************************
 * Standard Header Files
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Other Header Files
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Version (Check if required)
 *********************************************************************************************************************/

#define BQ7982X_REGS_MAJOR_VERSION                      (0x01u)
#define BQ7982X_REGS_MINOR_VERSION                      (0x00u)
#define BQ7982X_REGS_PATCH_VERSION                      (0x00u)

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

#define BQ7982X_GPIO_CONF_REG_NUM                       (0x0Au)
#define BQ7982X_ADC_CTRL_REG_NUM                        (0x05u)
#define BQ7982X_BAL_CTRL_REG_NUM                        (0x03u)
#define BQ7982X_DIAG_ADC_DEV_STAT_NUM                   (0x03u)
#define BQ7982X_FAULT_ADC_GPIO_NUM                      (0x03u)
#define BQ7982X_FAULT_ADC_VCELL_NUM                     (0x04u)
#define BQ7982X_FAULT_OVUV_NUM                          (0x01u)
#define BQ7982X_FAULT_OTUT_NUM                          (0x01u)
#define BQ7982X_FAULT_ADC_DIG_NUM                       (0x05u)
#define BQ7982X_DEV_CONF_REG_NUM                        (0x03u)


/* --------------------------------------------------------------------------
 * CUST_CRCHI          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_CRCHI_OFFSET                       (0x0000u)
#define BQ7982X_CUST_CRCHI_POR_VAL                      (0x47u)

#define BQ7982X_CUST_CRCHI_CRC_POS                      (0x00u)
#define BQ7982X_CUST_CRCHI_CRC_MSK                      (0xFFu)

/* --------------------------------------------------------------------------
 * CUST_CRCLO          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_CRCLO_OFFSET                       (0x0001u)
#define BQ7982X_CUST_CRCLO_POR_VAL                      (0xF1u)

#define BQ7982X_CUST_CRCLO_CRC_POS                      (0x00u)
#define BQ7982X_CUST_CRCLO_CRC_MSK                      (0xFFu)

/* --------------------------------------------------------------------------
 * DEV_CONF1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEV_CONF1_OFFSET                        (0x0002u)
#define BQ7982X_DEV_CONF1_POR_VAL                       (0x01u)

#define BQ7982X_DEV_CONF1_SPARE_POS                     (0x05u)
#define BQ7982X_POS_DEV_CONF1_VIO_UV_DS_DIS             (0x04u)
#define BQ7982X_POS_DEV_CONF1_DEEPSLEEP_DIS             (0x03u)
#define BQ7982X_DEV_CONF1_TSREF_DLY_POS                 (0x01u)
#define BQ7982X_DEV_CONF1_NFAULT_EN_POS                 (0x00u)

#define BQ7982X_DEV_CONF1_SPARE_MSK                     (0xE0u)
#define BQ7982X_MSK_DEV_CONF1_VIO_UV_DS_DIS             (0x10u)
#define BQ7982X_MSK_DEV_CONF1_DEEPSLEEP_DIS             (0x08u)
#define BQ7982X_DEV_CONF1_TSREF_DLY_MSK                 (0x06u)
#define BQ7982X_DEV_CONF1_NFAULT_EN_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * DEV_CONF2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEV_CONF2_OFFSET                        (0x0003u)
#define BQ7982X_DEV_CONF2_POR_VAL                       (0x00u)

#define BQ7982X_DEV_CONF2_MON_CYCLE_POS                 (0x05u)
#define BQ7982X_DEV_CONF2_NUM_CELL_POS                  (0x00u)

