xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_DEV_CONF2_MON_CYCLE_MSK                 (0xE0u)
#define BQ7982X_DEV_CONF2_NUM_CELL_MSK                  (0x1Fu)

/* --------------------------------------------------------------------------
 * DEV_CONF3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEV_CONF3_OFFSET                        (0x0004u)
#define BQ7982X_DEV_CONF3_POR_VAL                       (0x05u)

#define BQ7982X_POS_DEV_CONF3_CRYSTAL_EN                (0x07u)
#define BQ7982X_DEV_CONF3_PTC_EN_POS                    (0x06u)
#define BQ7982X_DEV_CONF3_I_CB_LKG_POS                  (0x05u)
#define BQ7982X_POS_DEV_CONF3_CBADC_OFFSET              (0x03u)
#define BQ7982X_DEV_CONF3_TWARN_THR_POS                  (0x02u)
#define BQ7982X_POS_DEV_CONF3_CBTWARN_DIS               (0x01u)
#define BQ7982X_DEV_CONF3_NO_ADJ_CB_POS                 (0x00u)

#define BQ7982X_MSK_DEV_CONF3_CRYSTAL_EN                (0x80u)
#define BQ7982X_DEV_CONF3_PTC_EN_MSK                    (0x40u)
#define BQ7982X_DEV_CONF3_I_CB_LKG_MSK                  (0x20u)
#define BQ7982X_MSK_DEV_CONF3_CBADC_OFFSET              (0x18u)
#define BQ7982X_DEV_CONF3_TWARN_THR_MSK                 (0x04u)
#define BQ7982X_MSK_DEV_CONF3_CBTWARN_DIS               (0x02u)
#define BQ7982X_DEV_CONF3_NO_ADJ_CB_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * COMM_CONF1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COMM_CONF1_OFFSET                       (0x0007u)
#define BQ7982X_COMM_CONF1_POR_VAL                      (0x00u)

#define BQ7982X_POS_COMM_CONF1_MD_HB_TO_TIMER           (0x07u)
#define BQ7982X_POS_COMM_CONF1_HB_TO_TIMER              (0x06u)
#define BQ7982X_COMM_CONF1_HB_TIMER_POS                 (0x05u)
#define BQ7982X_POS_COMM_CONF1_FRAME_LINK               (0x04u)
#define BQ7982X_COMM_CONF1_GROUP_POS                    (0x02u)
#define BQ7982X_COMM_CONF1_FRAME_EN_POS                 (0x01u)
#define BQ7982X_POS_COMM_CONF1_CRC_LENGTH               (0x00u)

#define BQ7982X_MSK_COMM_CONF1_MD_HB_TO_TIMER          (0x80u)
#define BQ7982X_MSK_COMM_CONF1_HB_TO_TIMER             (0x40u)
#define BQ7982X_COMM_CONF1_HB_TIMER_MSK                (0x20u)
#define BQ7982X_MSK_COMM_CONF1_FRAME_LINK              (0x10u)
#define BQ7982X_COMM_CONF1_GROUP_MSK                   (0x0Cu)
#define BQ7982X_COMM_CONF1_FRAME_EN_MSK                (0x02u)
#define BQ7982X_MSK_COMM_CONF1_CRC_LENGTH              (0x01u)

/* --------------------------------------------------------------------------
 * COMM_CONF2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COMM_CONF2_OFFSET                       (0x0008u)
#define BQ7982X_COMM_CONF2_POR_VAL                      (0x00u)

#define BQ7982X_POS_COMM_CONF2_MD_RING_MODE             (0x07u)
#define BQ7982X_POS_COMM_CONF2_MD_HB_CONF1              (0x06u)
#define BQ7982X_POS_COMM_CONF2_MD_HB_CONF0              (0x05u)
#define BQ7982X_COMM_CONF2_MD_HB_EN_POS                 (0x04u)
#define BQ7982X_POS_COMM_CONF2_RING_MODE                (0x03u)
#define BQ7982X_COMM_CONF2_HB_CONF1_POS                 (0x02u)
#define BQ7982X_COMM_CONF2_HB_CONF0_POS                 (0x01u)
#define BQ7982X_COMM_CONF2_HB_EN_POS                   (0x00u)

#define BQ7982X_MSK_COMM_CONF2_MD_RING_MODE            (0x80u)
#define BQ7982X_MSK_COMM_CONF2_MD_HB_CONF1            (0x40u)
#define BQ7982X_MSK_COMM_CONF2_MD_HB_CONF0            (0x20u)
#define BQ7982X_COMM_CONF2_MD_HB_EN_MSK               (0x10u)
#define BQ7982X_MSK_COMM_CONF2_RING_MODE              (0x08u)
#define BQ7982X_COMM_CONF2_HB_CONF1_MSK               (0x04u)
#define BQ7982X_COMM_CONF2_HB_CONF0_MSK               (0x02u)
#define BQ7982X_COMM_CONF2_HB_EN_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * COMM_CONF3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COMM_CONF3_OFFSET                       (0x0009u)
#define BQ7982X_COMM_CONF3_POR_VAL                      (0x00u)

#define BQ7982X_COMM_CONF3_SPARE6_POS                   (0x07u)
#define BQ7982X_COMM_CONF3_SPARE5_POS                   (0x06u)
#define BQ7982X_COMM_CONF3_SPARE4_POS                   (0x05u)
#define BQ7982X_COMM_CONF3_SPARE3_POS                   (0x04u)
#define BQ7982X_COMM_CONF3_SPARE2_POS                   (0x03u)
#define BQ7982X_COMM_CONF3_SPARE1_POS                   (0x02u)
#define BQ7982X_COMM_CONF3_SPARE0_POS                   (0x01u)
#define BQ7982X_POS_COMM_CONF3_IDDQ_COMM_EN             (0x00u)

#define BQ7982X_COMM_CONF3_SPARE6_MSK                   (0x80u)
#define BQ7982X_COMM_CONF3_SPARE5_MSK                   (0x40u)
#define BQ7982X_COMM_CONF3_SPARE4_MSK                   (0x20u)
#define BQ7982X_COMM_CONF3_SPARE3_MSK                   (0x10u)
#define BQ7982X_COMM_CONF3_SPARE2_MSK                   (0x08u)
#define BQ7982X_COMM_CONF3_SPARE1_MSK                   (0x04u)
#define BQ7982X_COMM_CONF3_SPARE0_MSK                   (0x02u)
#define BQ7982X_MSK_COMM_CONF3_IDDQ_COMM_EN             (0x01u)


/* --------------------------------------------------------------------------
 * BBVC_POSN1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BBVC_POSN1_OFFSET                       (0x000Cu)
#define BQ7982X_BBVC_POSN1_POR_VAL                      (0x00u)

#define BQ7982X_BBVC_POSN1_CELL8_POS                    (0x07u)
#define BQ7982X_BBVC_POSN1_CELL7_POS                    (0x06u)
#define BQ7982X_BBVC_POSN1_CELL6_POS                    (0x05u)
#define BQ7982X_BBVC_POSN1_CELL5_POS                    (0x04u)
#define BQ7982X_BBVC_POSN1_CELL4_POS                    (0x03u)
#define BQ7982X_BBVC_POSN1_CELL3_POS                    (0x02u)
#define BQ7982X_BBVC_POSN1_CELL2_POS                    (0x01u)
#define BQ7982X_BBVC_POSN1_CELL1_POS                    (0x00u)

#define BQ7982X_BBVC_POSN1_CELL8_MSK                    (0x80u)
#define BQ7982X_BBVC_POSN1_CELL7_MSK                    (0x40u)
#define BQ7982X_BBVC_POSN1_CELL6_MSK                    (0x20u)
#define BQ7982X_BBVC_POSN1_CELL5_MSK                    (0x10u)
#define BQ7982X_BBVC_POSN1_CELL4_MSK                    (0x08u)
#define BQ7982X_BBVC_POSN1_CELL3_MSK                    (0x04u)
#define BQ7982X_BBVC_POSN1_CELL2_MSK                    (0x02u)
#define BQ7982X_BBVC_POSN1_CELL1_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * BBVC_POSN2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BBVC_POSN2_OFFSET                       (0x000Du)
#define BQ7982X_BBVC_POSN2_POR_VAL                      (0x00u)

