xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_BBVC_POSN2_CELL16_POS                   (0x07u)
#define BQ7982X_BBVC_POSN2_CELL15_POS                   (0x06u)
#define BQ7982X_BBVC_POSN2_CELL14_POS                   (0x05u)
#define BQ7982X_BBVC_POSN2_CELL13_POS                   (0x04u)
#define BQ7982X_BBVC_POSN2_CELL12_POS                   (0x03u)
#define BQ7982X_BBVC_POSN2_CELL11_POS                   (0x02u)
#define BQ7982X_BBVC_POSN2_CELL10_POS                   (0x01u)
#define BQ7982X_BBVC_POSN2_CELL9_POS                    (0x00u)

#define BQ7982X_BBVC_POSN2_CELL16_MSK                   (0x80u)
#define BQ7982X_BBVC_POSN2_CELL15_MSK                   (0x40u)
#define BQ7982X_BBVC_POSN2_CELL14_MSK                   (0x20u)
#define BQ7982X_BBVC_POSN2_CELL13_MSK                   (0x10u)
#define BQ7982X_BBVC_POSN2_CELL12_MSK                   (0x08u)
#define BQ7982X_BBVC_POSN2_CELL11_MSK                   (0x04u)
#define BQ7982X_BBVC_POSN2_CELL10_MSK                   (0x02u)
#define BQ7982X_BBVC_POSN2_CELL9_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * BBVC_POSN3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BBVC_POSN3_OFFSET                       (0x000Eu)
#define BQ7982X_BBVC_POSN3_POR_VAL                      (0x00u)

#define BQ7982X_BBVC_POSN3_CELL24_POS                   (0x07u)
#define BQ7982X_BBVC_POSN3_CELL23_POS                   (0x06u)
#define BQ7982X_BBVC_POSN3_CELL22_POS                   (0x05u)
#define BQ7982X_BBVC_POSN3_CELL21_POS                   (0x04u)
#define BQ7982X_BBVC_POSN3_CELL20_POS                   (0x03u)
#define BQ7982X_BBVC_POSN3_CELL19_POS                   (0x02u)
#define BQ7982X_BBVC_POSN3_CELL18_POS                   (0x01u)
#define BQ7982X_BBVC_POSN3_CELL17_POS                   (0x00u)

#define BQ7982X_BBVC_POSN3_CELL24_MSK                   (0x80u)
#define BQ7982X_BBVC_POSN3_CELL23_MSK                   (0x40u)
#define BQ7982X_BBVC_POSN3_CELL22_MSK                   (0x20u)
#define BQ7982X_BBVC_POSN3_CELL21_MSK                   (0x10u)
#define BQ7982X_BBVC_POSN3_CELL20_MSK                   (0x08u)
#define BQ7982X_BBVC_POSN3_CELL19_MSK                   (0x04u)
#define BQ7982X_BBVC_POSN3_CELL18_MSK                   (0x02u)
#define BQ7982X_BBVC_POSN3_CELL17_MSK                   (0x01u)
/* --------------------------------------------------------------------------
 * BBVC_POSN4          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BBVC_POSN4_OFFSET                       (0x000Fu)
#define BQ7982X_BBVC_POSN4_POR_VAL                      (0x00u)

#define BQ7982X_BBVC_POSN4_SPARE5_POS                   (0x07u)
#define BQ7982X_BBVC_POSN4_SPARE4_POS                   (0x06u)
#define BQ7982X_BBVC_POSN4_SPARE3_POS                   (0x05u)
#define BQ7982X_BBVC_POSN4_SPARE2_POS                   (0x04u)
#define BQ7982X_BBVC_POSN4_SPARE1_POS                   (0x03u)
#define BQ7982X_BBVC_POSN4_SPARE0_POS                   (0x02u)
#define BQ7982X_BBVC_POSN4_CELL26_POS                   (0x01u)
#define BQ7982X_BBVC_POSN4_CELL25_POS                   (0x00u)

#define BQ7982X_BBVC_POSN4_SPARE5_MSK                   (0x80u)
#define BQ7982X_BBVC_POSN4_SPARE4_MSK                   (0x40u)
#define BQ7982X_BBVC_POSN4_SPARE3_MSK                   (0x20u)
#define BQ7982X_BBVC_POSN4_SPARE2_MSK                   (0x10u)
#define BQ7982X_BBVC_POSN4_SPARE1_MSK                   (0x08u)
#define BQ7982X_BBVC_POSN4_SPARE0_MSK                   (0x04u)
#define BQ7982X_BBVC_POSN4_CELL26_MSK                   (0x02u)
#define BQ7982X_BBVC_POSN4_CELL25_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * OV_THRESH1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OV_THRESH1_OFFSET                       (0x0010u)
#define BQ7982X_OV_THRESH1_POR_VAL                      (0x00u)

#define BQ7982X_OV_THRESH1_OV_THR7_POS                  (0x07u)
#define BQ7982X_OV_THRESH1_OV_THR6_POS                  (0x06u)
#define BQ7982X_OV_THRESH1_OV_THR5_POS                  (0x05u)
#define BQ7982X_OV_THRESH1_OV_THR4_POS                  (0x04u)
#define BQ7982X_OV_THRESH1_OV_THR3_POS                  (0x03u)
#define BQ7982X_OV_THRESH1_OV_THR2_POS                  (0x02u)
#define BQ7982X_OV_THRESH1_OV_THR1_POS                  (0x01u)
#define BQ7982X_OV_THRESH1_OV_THR0_POS                  (0x00u)

#define BQ7982X_OV_THRESH1_OV_THR7_MSK                  (0x80u)
#define BQ7982X_OV_THRESH1_OV_THR6_MSK                  (0x40u)
#define BQ7982X_OV_THRESH1_OV_THR5_MSK                  (0x20u)
#define BQ7982X_OV_THRESH1_OV_THR4_MSK                  (0x10u)
#define BQ7982X_OV_THRESH1_OV_THR3_MSK                  (0x08u)
#define BQ7982X_OV_THRESH1_OV_THR2_MSK                  (0x04u)
#define BQ7982X_OV_THRESH1_OV_THR1_MSK                  (0x02u)
#define BQ7982X_OV_THRESH1_OV_THR0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * UV_THRESH1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_UV_THRESH1_OFFSET                       (0x0011u)
#define BQ7982X_UV_THRESH1_POR_VAL                      (0x00u)

#define BQ7982X_UV_THRESH1_SPARE1_POS                   (0x07u)
#define BQ7982X_UV_THRESH1_SPARE0_POS                   (0x06u)
#define BQ7982X_UV_THRESH1_UV_THR5_POS                  (0x05u)
#define BQ7982X_UV_THRESH1_UV_THR4_POS                  (0x04u)
#define BQ7982X_UV_THRESH1_UV_THR3_POS                  (0x03u)
#define BQ7982X_UV_THRESH1_UV_THR2_POS                  (0x02u)
#define BQ7982X_UV_THRESH1_UV_THR1_POS                  (0x01u)
#define BQ7982X_UV_THRESH1_UV_THR0_POS                  (0x00u)

#define BQ7982X_UV_THRESH1_SPARE1_MSK                   (0x80u)
#define BQ7982X_UV_THRESH1_SPARE0_MSK                   (0x40u)
#define BQ7982X_UV_THRESH1_UV_THR5_MSK                  (0x20u)
#define BQ7982X_UV_THRESH1_UV_THR4_MSK                  (0x10u)
#define BQ7982X_UV_THRESH1_UV_THR3_MSK                  (0x08u)
#define BQ7982X_UV_THRESH1_UV_THR2_MSK                  (0x04u)
#define BQ7982X_UV_THRESH1_UV_THR1_MSK                  (0x02u)
#define BQ7982X_UV_THRESH1_UV_THR0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OV_THRESH2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OV_THRESH2_OFFSET                       (0x0012u)
#define BQ7982X_OV_THRESH2_POR_VAL                      (0x00u)

#define BQ7982X_OV_THRESH2_OV_THR7_POS                  (0x07u)
#define BQ7982X_OV_THRESH2_OV_THR6_POS                  (0x06u)
#define BQ7982X_OV_THRESH2_OV_THR5_POS                  (0x05u)
#define BQ7982X_OV_THRESH2_OV_THR4_POS                  (0x04u)
#define BQ7982X_OV_THRESH2_OV_THR3_POS                  (0x03u)
#define BQ7982X_OV_THRESH2_OV_THR2_POS                  (0x02u)
#define BQ7982X_OV_THRESH2_OV_THR1_POS                  (0x01u)
#define BQ7982X_OV_THRESH2_OV_THR0_POS                  (0x00u)

