xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_OV_THRESH2_OV_THR7_MSK                  (0x80u)
#define BQ7982X_OV_THRESH2_OV_THR6_MSK                  (0x40u)
#define BQ7982X_OV_THRESH2_OV_THR5_MSK                  (0x20u)
#define BQ7982X_OV_THRESH2_OV_THR4_MSK                  (0x10u)
#define BQ7982X_OV_THRESH2_OV_THR3_MSK                  (0x08u)
#define BQ7982X_OV_THRESH2_OV_THR2_MSK                  (0x04u)
#define BQ7982X_OV_THRESH2_OV_THR1_MSK                  (0x02u)
#define BQ7982X_OV_THRESH2_OV_THR0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * UV_THRESH2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_UV_THRESH2_OFFSET                       (0x0013u)
#define BQ7982X_UV_THRESH2_POR_VAL                      (0x00u)
#define BQ7982X_UV_THRESH2_SPARE1_POS                   (0x07u)
#define BQ7982X_UV_THRESH2_SPARE0_POS                   (0x06u)
#define BQ7982X_UV_THRESH2_UV_THR_POS                   (0x00u)
#define BQ7982X_UV_THRESH2_SPARE1_MSK                   (0x80u)
#define BQ7982X_UV_THRESH2_SPARE0_MSK                   (0x40u)
#define BQ7982X_UV_THRESH2_UV_THR_MSK                   (0x3Fu)

/* --------------------------------------------------------------------------
 * OTUT_THRESH1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTUT_THRESH1_OFFSET                       (0x0014u)
#define BQ7982X_OTUT_THRESH1_POR_VAL                      (0x00u)

#define BQ7982X_OTUT_THRESH1_UT_THR_POS                   (0x05u)
#define BQ7982X_OTUT_THRESH1_OT_THR_POS                   (0x00u)

#define BQ7982X_OTUT_THRESH1_UT_THR_MSK                   (0xE0u)
#define BQ7982X_OTUT_THRESH1_OT_THR_MSK                  (0x1Fu)

/* --------------------------------------------------------------------------
 * OTUT_THRESH2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTUT_THRESH2_OFFSET                       (0x0015u)
#define BQ7982X_OTUT_THRESH2_POR_VAL                      (0x00u)

#define BQ7982X_OTUT_THRESH2_UT_THR2_POS                  (0x07u)
#define BQ7982X_OTUT_THRESH2_UT_THR1_POS                  (0x06u)
#define BQ7982X_OTUT_THRESH2_UT_THR0_POS                  (0x05u)
#define BQ7982X_OTUT_THRESH2_OT_THR4_POS                  (0x04u)
#define BQ7982X_OTUT_THRESH2_OT_THR3_POS                  (0x03u)
#define BQ7982X_OTUT_THRESH2_OT_THR2_POS                  (0x02u)
#define BQ7982X_OTUT_THRESH2_OT_THR1_POS                  (0x01u)
#define BQ7982X_OTUT_THRESH2_OT_THR0_POS                  (0x00u)

#define BQ7982X_OTUT_THRESH2_UT_THR2_MSK                  (0x80u)
#define BQ7982X_OTUT_THRESH2_UT_THR1_MSK                  (0x40u)
#define BQ7982X_OTUT_THRESH2_UT_THR0_MSK                  (0x20u)
#define BQ7982X_OTUT_THRESH2_OT_THR4_MSK                  (0x10u)
#define BQ7982X_OTUT_THRESH2_OT_THR3_MSK                  (0x08u)
#define BQ7982X_OTUT_THRESH2_OT_THR2_MSK                  (0x04u)
#define BQ7982X_OTUT_THRESH2_OT_THR1_MSK                  (0x02u)
#define BQ7982X_OTUT_THRESH2_OT_THR0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * SMONH_THRESH          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMONH_THRESH_OFFSET                       (0x0016u)
#define BQ7982X_SMONH_THRESH_POR_VAL                      (0x00u)
#define BQ7982X_POS_SMONH_THRESH_SMONH_THR               (0x00u)
#define BQ7982X_MSK_SMONH_THRESH_SMONH_THR             (0xFFu)

/* --------------------------------------------------------------------------
 * SMONL_THRESH          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMONL_THRESH_OFFSET                       (0x0017u)
#define BQ7982X_SMONL_THRESH_POR_VAL                      (0x00u)
#define BQ7982X_POS_SMONL_THRESH_SMONL_THR               (0x00u)
#define BQ7982X_MSK_SMONL_THRESH_SMONL_THR             (0xFFu)


/* --------------------------------------------------------------------------
 * FAULT_MSK1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_MSK1_OFFSET                       (0x0018u)
#define BQ7982X_FAULT_MSK1_POR_VAL                      (0x00u)

#define BQ7982X_POS_FAULT_MSK1_MSK_SYS_SYNC             (0x07u)
#define BQ7982X_POS_FAULT_MSK1_MSK_SYS_INT              (0x06u)
#define BQ7982X_POS_FAULT_MSK1_MSK_SYS_MON              (0x05u)
#define BQ7982X_POS_FAULT_MSK1_MSK_SYS_SMON             (0x04u)
#define BQ7982X_FAULT_MSK1_MSK_UT_POS                   (0x03u)
#define BQ7982X_FAULT_MSK1_MSK_OT_POS                   (0x02u)
#define BQ7982X_FAULT_MSK1_MSK_UV_POS                   (0x01u)
#define BQ7982X_FAULT_MSK1_MSK_OV_POS                   (0x00u)

#define BQ7982X_MSK_FAULT_MSK1_MSK_SYS_SYNC             (0x80u)
#define BQ7982X_MSK_FAULT_MSK1_MSK_SYS_INT              (0x40u)
#define BQ7982X_MSK_FAULT_MSK1_MSK_SYS_MON              (0x20u)
#define BQ7982X_MSK_FAULT_MSK1_MSK_SYS_SMON             (0x10u)
#define BQ7982X_FAULT_MSK1_MSK_UT_MSK                   (0x08u)
#define BQ7982X_FAULT_MSK1_MSK_OT_MSK                   (0x04u)
#define BQ7982X_FAULT_MSK1_MSK_UV_MSK                   (0x02u)
#define BQ7982X_FAULT_MSK1_MSK_OV_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_MSK2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_MSK2_OFFSET                       (0x0019u)
#define BQ7982X_FAULT_MSK2_POR_VAL                      (0x00u)

#define BQ7982X_FAULT_MSK2_MSK_PWR_POS                  (0x07u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_FRAME          (0x06u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_FT             (0x05u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_HB             (0x04u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_DSY            (0x03u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_PSPI           (0x02u)
#define BQ7982X_POS_FAULT_MSK2_MSK_COMM_BUSY           (0x01u)
#define BQ7982X_POS_FAULT_MSK2_MSK_SYS_MISC            (0x00u)

#define BQ7982X_FAULT_MSK2_MSK_PWR_MSK                  (0x80u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_FRAME          (0x40u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_FT             (0x20u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_HB             (0x10u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_DSY            (0x08u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_PSPI           (0x04u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_COMM_BUSY           (0x02u)
#define BQ7982X_MSK_FAULT_MSK2_MSK_SYS_MISC            (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_MSK3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_MSK3_OFFSET                       (0x001Au)
#define BQ7982X_FAULT_MSK3_POR_VAL                      (0x00u)

