xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_FAULT_MSK3_SPARE2_POS                   (0x07u)
#define BQ7982X_FAULT_MSK3_SPARE1_POS                   (0x06u)
#define BQ7982X_FAULT_MSK3_SPARE0_POS                   (0x05u)
#define BQ7982X_POS_FAULT_MSK3_MSK_SYS_EIS              (0x04u)
#define BQ7982X_FAULT_MSK3_MSK_CB_POS                   (0x03u)
#define BQ7982X_FAULT_MSK3_MSK_ADC_POS                  (0x02u)
#define BQ7982X_POS_FAULT_MSK3_MSK_MEM_CRC              (0x01u)
#define BQ7982X_POS_FAULT_MSK3_MSK_MEM_DATA             (0x00u)

#define BQ7982X_FAULT_MSK3_SPARE2_MSK                   (0x80u)
#define BQ7982X_FAULT_MSK3_SPARE1_MSK                   (0x40u)
#define BQ7982X_FAULT_MSK3_SPARE0_MSK                   (0x20u)
#define BQ7982X_MSK_FAULT_MSK3_MSK_SYS_EIS              (0x10u)
#define BQ7982X_FAULT_MSK3_MSK_CB_MSK                   (0x08u)
#define BQ7982X_FAULT_MSK3_MSK_ADC_MSK                  (0x04u)
#define BQ7982X_MSK_FAULT_MSK3_MSK_MEM_CRC              (0x02u)
#define BQ7982X_MSK_FAULT_MSK3_MSK_MEM_DATA             (0x01u)

/* --------------------------------------------------------------------------
 * IDDQ_CONF          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_IDDQ_CONF_OFFSET                        (0x001Cu)
#define BQ7982X_IDDQ_CONF_POR_VAL                       (0x00u)

#define BQ7982X_IDDQ_CONF_SPARE1_POS                    (0x07u)
#define BQ7982X_IDDQ_CONF_SPARE0_POS                    (0x06u)
#define BQ7982X_IDDQ_CONF_STATIC5_POS                   (0x05u)
#define BQ7982X_IDDQ_CONF_STATIC4_POS                   (0x04u)
#define BQ7982X_IDDQ_CONF_STATIC3_POS                   (0x03u)
#define BQ7982X_IDDQ_CONF_STATIC2_POS                   (0x02u)
#define BQ7982X_IDDQ_CONF_STATIC1_POS                   (0x01u)
#define BQ7982X_IDDQ_CONF_STATIC0_POS                   (0x00u)

#define BQ7982X_IDDQ_CONF_SPARE1_MSK                    (0x80u)
#define BQ7982X_IDDQ_CONF_SPARE0_MSK                    (0x40u)
#define BQ7982X_IDDQ_CONF_STATIC5_MSK                   (0x20u)
#define BQ7982X_IDDQ_CONF_STATIC4_MSK                   (0x10u)
#define BQ7982X_IDDQ_CONF_STATIC3_MSK                   (0x08u)
#define BQ7982X_IDDQ_CONF_STATIC2_MSK                   (0x04u)
#define BQ7982X_IDDQ_CONF_STATIC1_MSK                   (0x02u)
#define BQ7982X_IDDQ_CONF_STATIC0_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_CONF          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_CONF_OFFSET                        (0x001Du)
#define BQ7982X_CSPI_CONF_POR_VAL                       (0x00u)

#define BQ7982X_CSPI_CONF_CCS8_POS                      (0x07u)
#define BQ7982X_CSPI_CONF_CCS7_POS                      (0x06u)
#define BQ7982X_CSPI_CONF_CCS6_POS                      (0x05u)
#define BQ7982X_CSPI_CONF_CCS5_POS                      (0x04u)
#define BQ7982X_CSPI_CONF_CCS4_POS                      (0x03u)
#define BQ7982X_CSPI_CONF_CCS3_POS                      (0x02u)
#define BQ7982X_CSPI_CONF_CCS2_POS                      (0x01u)
#define BQ7982X_CSPI_CONF_CCS1_POS                      (0x00u)

#define BQ7982X_CSPI_CONF_CCS8_MSK                      (0x80u)
#define BQ7982X_CSPI_CONF_CCS7_MSK                      (0x40u)
#define BQ7982X_CSPI_CONF_CCS6_MSK                      (0x20u)
#define BQ7982X_CSPI_CONF_CCS5_MSK                      (0x10u)
#define BQ7982X_CSPI_CONF_CCS4_MSK                      (0x08u)
#define BQ7982X_CSPI_CONF_CCS3_MSK                      (0x04u)
#define BQ7982X_CSPI_CONF_CCS2_MSK                      (0x02u)
#define BQ7982X_CSPI_CONF_CCS1_MSK                      (0x01u)

/* --------------------------------------------------------------------------
 * INT_CONF          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_INT_CONF_OFFSET                         (0x001Eu)
#define BQ7982X_INT_CONF_POR_VAL                        (0x00u)

#define BQ7982X_INT_CONF_SPARE2_POS                     (0x07u)
#define BQ7982X_INT_CONF_SPARE1_POS                     (0x06u)
#define BQ7982X_INT_CONF_SPARE0_POS                     (0x05u)
#define BQ7982X_INT_CONF_INT5_POS                       (0x04u)
#define BQ7982X_INT_CONF_INT4_POS                       (0x03u)
#define BQ7982X_INT_CONF_INT3_POS                       (0x02u)
#define BQ7982X_INT_CONF_INT2_POS                       (0x01u)
#define BQ7982X_INT_CONF_INT1_POS                       (0x00u)

#define BQ7982X_INT_CONF_SPARE2_MSK                     (0x80u)
#define BQ7982X_INT_CONF_SPARE1_MSK                     (0x40u)
#define BQ7982X_INT_CONF_SPARE0_MSK                     (0x20u)
#define BQ7982X_INT_CONF_INT5_MSK                       (0x10u)
#define BQ7982X_INT_CONF_INT4_MSK                       (0x08u)
#define BQ7982X_INT_CONF_INT3_MSK                       (0x04u)
#define BQ7982X_INT_CONF_INT2_MSK                       (0x02u)
#define BQ7982X_INT_CONF_INT1_MSK                       (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF1_OFFSET                       (0x001Fu)
#define BQ7982X_GPIO_CONF1_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF1_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF1_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF1_GPIO2_2_POS                  (0x05u)
#define BQ7982X_GPIO_CONF1_GPIO2_1_POS                  (0x04u)
#define BQ7982X_GPIO_CONF1_GPIO2_0_POS                  (0x03u)
#define BQ7982X_GPIO_CONF1_GPIO1_2_POS                  (0x02u)
#define BQ7982X_GPIO_CONF1_GPIO1_1_POS                  (0x01u)
#define BQ7982X_GPIO_CONF1_GPIO1_0_POS                  (0x00u)

#define BQ7982X_GPIO_CONF1_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF1_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF1_GPIO2_2_MSK                  (0x20u)
#define BQ7982X_GPIO_CONF1_GPIO2_1_MSK                  (0x10u)
#define BQ7982X_GPIO_CONF1_GPIO2_0_MSK                  (0x08u)
#define BQ7982X_GPIO_CONF1_GPIO1_2_MSK                  (0x04u)
#define BQ7982X_GPIO_CONF1_GPIO1_1_MSK                  (0x02u)
#define BQ7982X_GPIO_CONF1_GPIO1_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF2_OFFSET                       (0x0020u)
#define BQ7982X_GPIO_CONF2_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF2_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF2_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF2_GPIO4_2_POS                  (0x05u)
#define BQ7982X_GPIO_CONF2_GPIO4_1_POS                  (0x04u)
#define BQ7982X_GPIO_CONF2_GPIO4_0_POS                  (0x03u)
#define BQ7982X_GPIO_CONF2_GPIO3_2_POS                  (0x02u)
#define BQ7982X_GPIO_CONF2_GPIO3_1_POS                  (0x01u)
#define BQ7982X_GPIO_CONF2_GPIO3_0_POS                  (0x00u)

#define BQ7982X_GPIO_CONF2_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF2_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF2_GPIO4_2_MSK                  (0x20u)
#define BQ7982X_GPIO_CONF2_GPIO4_1_MSK                  (0x10u)
#define BQ7982X_GPIO_CONF2_GPIO4_0_MSK                  (0x08u)
#define BQ7982X_GPIO_CONF2_GPIO3_2_MSK                  (0x04u)
#define BQ7982X_GPIO_CONF2_GPIO3_1_MSK                  (0x02u)
#define BQ7982X_GPIO_CONF2_GPIO3_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF3_OFFSET                       (0x0021u)
#define BQ7982X_GPIO_CONF3_POR_VAL                      (0x00u)

