xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_GPIO_CONF3_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF3_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF3_GPIO6_2_POS                  (0x05u)
#define BQ7982X_GPIO_CONF3_GPIO6_1_POS                  (0x04u)
#define BQ7982X_GPIO_CONF3_GPIO6_0_POS                  (0x03u)
#define BQ7982X_GPIO_CONF3_GPIO5_2_POS                  (0x02u)
#define BQ7982X_GPIO_CONF3_GPIO5_1_POS                  (0x01u)
#define BQ7982X_GPIO_CONF3_GPIO5_0_POS                  (0x00u)

#define BQ7982X_GPIO_CONF3_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF3_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF3_GPIO6_2_MSK                  (0x20u)
#define BQ7982X_GPIO_CONF3_GPIO6_1_MSK                  (0x10u)
#define BQ7982X_GPIO_CONF3_GPIO6_0_MSK                  (0x08u)
#define BQ7982X_GPIO_CONF3_GPIO5_2_MSK                  (0x04u)
#define BQ7982X_GPIO_CONF3_GPIO5_1_MSK                  (0x02u)
#define BQ7982X_GPIO_CONF3_GPIO5_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF4          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF4_OFFSET                       (0x0022u)
#define BQ7982X_GPIO_CONF4_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF4_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF4_EIS_PWM_EN_POS               (0x06u)
#define BQ7982X_GPIO_CONF4_GPIO8_2_POS                  (0x05u)
#define BQ7982X_GPIO_CONF4_GPIO8_1_POS                  (0x04u)
#define BQ7982X_GPIO_CONF4_GPIO8_0_POS                  (0x03u)
#define BQ7982X_GPIO_CONF4_GPIO7_2_POS                  (0x02u)
#define BQ7982X_GPIO_CONF4_GPIO7_1_POS                  (0x01u)
#define BQ7982X_GPIO_CONF4_GPIO7_0_POS                  (0x00u)

#define BQ7982X_GPIO_CONF4_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF4_EIS_PWM_EN_MSK               (0x40u)
#define BQ7982X_GPIO_CONF4_GPIO8_2_MSK                  (0x20u)
#define BQ7982X_GPIO_CONF4_GPIO8_1_MSK                  (0x10u)
#define BQ7982X_GPIO_CONF4_GPIO8_0_MSK                  (0x08u)
#define BQ7982X_GPIO_CONF4_GPIO7_2_MSK                  (0x04u)
#define BQ7982X_GPIO_CONF4_GPIO7_1_MSK                  (0x02u)
#define BQ7982X_GPIO_CONF4_GPIO7_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF5          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF5_OFFSET                       (0x0023u)
#define BQ7982X_GPIO_CONF5_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF5_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF5_I2C_EN_POS                   (0x06u)
#define BQ7982X_GPIO_CONF5_GPIO10_2_POS                 (0x05u)
#define BQ7982X_GPIO_CONF5_GPIO10_1_POS                 (0x04u)
#define BQ7982X_GPIO_CONF5_GPIO10_0_POS                 (0x03u)
#define BQ7982X_GPIO_CONF5_GPIO9_2_POS                  (0x02u)
#define BQ7982X_GPIO_CONF5_GPIO9_1_POS                  (0x01u)
#define BQ7982X_GPIO_CONF5_GPIO9_0_POS                  (0x00u)

#define BQ7982X_GPIO_CONF5_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF5_I2C_EN_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF5_GPIO10_2_MSK                 (0x20u)
#define BQ7982X_GPIO_CONF5_GPIO10_1_MSK                 (0x10u)
#define BQ7982X_GPIO_CONF5_GPIO10_0_MSK                 (0x08u)
#define BQ7982X_GPIO_CONF5_GPIO9_2_MSK                  (0x04u)
#define BQ7982X_GPIO_CONF5_GPIO9_1_MSK                  (0x02u)
#define BQ7982X_GPIO_CONF5_GPIO9_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF6          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF6_OFFSET                       (0x0024u)
#define BQ7982X_GPIO_CONF6_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF6_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF6_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF6_GPIO12_2_POS                 (0x05u)
#define BQ7982X_GPIO_CONF6_GPIO12_1_POS                 (0x04u)
#define BQ7982X_GPIO_CONF6_GPIO12_0_POS                 (0x03u)
#define BQ7982X_GPIO_CONF6_GPIO11_2_POS                 (0x02u)
#define BQ7982X_GPIO_CONF6_GPIO11_1_POS                 (0x01u)
#define BQ7982X_GPIO_CONF6_GPIO11_0_POS                 (0x00u)

#define BQ7982X_GPIO_CONF6_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF6_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF6_GPIO12_2_MSK                 (0x20u)
#define BQ7982X_GPIO_CONF6_GPIO12_1_MSK                 (0x10u)
#define BQ7982X_GPIO_CONF6_GPIO12_0_MSK                 (0x08u)
#define BQ7982X_GPIO_CONF6_GPIO11_2_MSK                 (0x04u)
#define BQ7982X_GPIO_CONF6_GPIO11_1_MSK                 (0x02u)
#define BQ7982X_GPIO_CONF6_GPIO11_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF7          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF7_OFFSET                       (0x0025u)
#define BQ7982X_GPIO_CONF7_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF7_SPARE0_POS                   (0x07u)
#define BQ7982X_GPIO_CONF7_CSPI_EN_POS                  (0x06u)
#define BQ7982X_GPIO_CONF7_GPIO14_2_POS                 (0x05u)
#define BQ7982X_GPIO_CONF7_GPIO14_1_POS                 (0x04u)
#define BQ7982X_GPIO_CONF7_GPIO14_0_POS                 (0x03u)
#define BQ7982X_GPIO_CONF7_GPIO13_2_POS                 (0x02u)
#define BQ7982X_GPIO_CONF7_GPIO13_1_POS                 (0x01u)
#define BQ7982X_GPIO_CONF7_GPIO13_0_POS                 (0x00u)

#define BQ7982X_GPIO_CONF7_SPARE0_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF7_CSPI_EN_MSK                  (0x40u)
#define BQ7982X_GPIO_CONF7_GPIO14_2_MSK                 (0x20u)
#define BQ7982X_GPIO_CONF7_GPIO14_1_MSK                 (0x10u)
#define BQ7982X_GPIO_CONF7_GPIO14_0_MSK                 (0x08u)
#define BQ7982X_GPIO_CONF7_GPIO13_2_MSK                 (0x04u)
#define BQ7982X_GPIO_CONF7_GPIO13_1_MSK                 (0x02u)
#define BQ7982X_GPIO_CONF7_GPIO13_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF8          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF8_OFFSET                       (0x0026u)
#define BQ7982X_GPIO_CONF8_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF8_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF8_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF8_GPIO16_2_POS                 (0x05u)
#define BQ7982X_GPIO_CONF8_GPIO16_1_POS                 (0x04u)
#define BQ7982X_GPIO_CONF8_GPIO16_0_POS                 (0x03u)
#define BQ7982X_GPIO_CONF8_GPIO15_2_POS                 (0x02u)
#define BQ7982X_GPIO_CONF8_GPIO15_1_POS                 (0x01u)
#define BQ7982X_GPIO_CONF8_GPIO15_0_POS                 (0x00u)

#define BQ7982X_GPIO_CONF8_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF8_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF8_GPIO16_2_MSK                 (0x20u)
#define BQ7982X_GPIO_CONF8_GPIO16_1_MSK                 (0x10u)
#define BQ7982X_GPIO_CONF8_GPIO16_0_MSK                 (0x08u)
#define BQ7982X_GPIO_CONF8_GPIO15_2_MSK                 (0x04u)
#define BQ7982X_GPIO_CONF8_GPIO15_1_MSK                 (0x02u)
#define BQ7982X_GPIO_CONF8_GPIO15_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF9          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF9_OFFSET                       (0x0027u)
#define BQ7982X_GPIO_CONF9_POR_VAL                      (0x00u)

#define BQ7982X_GPIO_CONF9_SPARE1_POS                   (0x07u)
#define BQ7982X_GPIO_CONF9_SPARE0_POS                   (0x06u)
#define BQ7982X_GPIO_CONF9_GPIO18_2_POS                 (0x05u)
#define BQ7982X_GPIO_CONF9_GPIO18_1_POS                 (0x04u)
#define BQ7982X_GPIO_CONF9_GPIO18_0_POS                 (0x03u)
#define BQ7982X_GPIO_CONF9_GPIO17_2_POS                 (0x02u)
#define BQ7982X_GPIO_CONF9_GPIO17_1_POS                 (0x01u)
#define BQ7982X_GPIO_CONF9_GPIO17_0_POS                 (0x00u)

