xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_GPIO_CONF9_SPARE1_MSK                   (0x80u)
#define BQ7982X_GPIO_CONF9_SPARE0_MSK                   (0x40u)
#define BQ7982X_GPIO_CONF9_GPIO18_2_MSK                 (0x20u)
#define BQ7982X_GPIO_CONF9_GPIO18_1_MSK                 (0x10u)
#define BQ7982X_GPIO_CONF9_GPIO18_0_MSK                 (0x08u)
#define BQ7982X_GPIO_CONF9_GPIO17_2_MSK                 (0x04u)
#define BQ7982X_GPIO_CONF9_GPIO17_1_MSK                 (0x02u)
#define BQ7982X_GPIO_CONF9_GPIO17_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_CONF10          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_CONF10_OFFSET                      (0x0028u)
#define BQ7982X_GPIO_CONF10_POR_VAL                     (0x00u)

#define BQ7982X_GPIO_CONF10_SPARE1_POS                  (0x07u)
#define BQ7982X_GPIO_CONF10_SPARE0_POS                  (0x06u)
#define BQ7982X_GPIO_CONF10_GPIO20_2_POS                (0x05u)
#define BQ7982X_GPIO_CONF10_GPIO20_1_POS                (0x04u)
#define BQ7982X_GPIO_CONF10_GPIO20_0_POS                (0x03u)
#define BQ7982X_GPIO_CONF10_GPIO19_2_POS                (0x02u)
#define BQ7982X_GPIO_CONF10_GPIO19_1_POS                (0x01u)
#define BQ7982X_GPIO_CONF10_GPIO19_0_POS                (0x00u)

#define BQ7982X_GPIO_CONF10_SPARE1_MSK                  (0x80u)
#define BQ7982X_GPIO_CONF10_SPARE0_MSK                  (0x40u)
#define BQ7982X_GPIO_CONF10_GPIO20_2_MSK                (0x20u)
#define BQ7982X_GPIO_CONF10_GPIO20_1_MSK                (0x10u)
#define BQ7982X_GPIO_CONF10_GPIO20_0_MSK                (0x08u)
#define BQ7982X_GPIO_CONF10_GPIO19_2_MSK                (0x04u)
#define BQ7982X_GPIO_CONF10_GPIO19_1_MSK                (0x02u)
#define BQ7982X_GPIO_CONF10_GPIO19_0_MSK                (0x01u)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET1_OFFSET                    (0x002Bu)
#define BQ7982X_VCELL_OFFSET1_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET1_OFFSET2             (0x04u)
#define BQ7982X_POS_VCELL_OFFSET1_OFFSET1             (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET1_OFFSET2             (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET1_OFFSET1             (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET2_OFFSET                    (0x002Cu)
#define BQ7982X_VCELL_OFFSET2_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET2_OFFSET4             (0x04u)
#define BQ7982X_POS_VCELL_OFFSET2_OFFSET3             (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET2_OFFSET4             (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET2_OFFSET3             (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET3_OFFSET                    (0x002Du)
#define BQ7982X_VCELL_OFFSET3_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET3_OFFSET6             (0x04u)
#define BQ7982X_POS_VCELL_OFFSET3_OFFSET5             (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET3_OFFSET6             (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET3_OFFSET5             (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET4          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET4_OFFSET                    (0x002Eu)
#define BQ7982X_VCELL_OFFSET4_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET4_OFFSET8             (0x04u)
#define BQ7982X_POS_VCELL_OFFSET4_OFFSET7             (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET4_OFFSET8             (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET4_OFFSET7             (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET5          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET5_OFFSET                    (0x002Fu)
#define BQ7982X_VCELL_OFFSET5_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET5_OFFSET10            (0x04u)
#define BQ7982X_POS_VCELL_OFFSET5_OFFSET9             (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET5_OFFSET10            (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET5_OFFSET9             (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET6          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET6_OFFSET                    (0x0030u)
#define BQ7982X_VCELL_OFFSET6_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET6_OFFSET12            (0x04u)
#define BQ7982X_POS_VCELL_OFFSET6_OFFSET11            (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET6_OFFSET12            (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET6_OFFSET11            (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET7          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET7_OFFSET                    (0x0031u)
#define BQ7982X_VCELL_OFFSET7_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET7_OFFSET14            (0x04u)
#define BQ7982X_POS_VCELL_OFFSET7_OFFSET13            (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET7_OFFSET14            (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET7_OFFSET13            (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET8          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET8_OFFSET                    (0x0032u)
#define BQ7982X_VCELL_OFFSET8_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET8_OFFSET16            (0x04u)
#define BQ7982X_POS_VCELL_OFFSET8_OFFSET15            (0x00u)

