xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_MSK_VCELL_OFFSET8_OFFSET16            (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET8_OFFSET15            (0x0Fu)

/* --------------------------------------------------------------------------
 * VCELL_OFFSET9          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_OFFSET9_OFFSET                    (0x0033u)
#define BQ7982X_VCELL_OFFSET9_POR_VAL                   (0x00u)

#define BQ7982X_POS_VCELL_OFFSET9_OFFSET18            (0x04u)
#define BQ7982X_POS_VCELL_OFFSET9_OFFSET17            (0x00u)

#define BQ7982X_MSK_VCELL_OFFSET9_OFFSET18            (0xF0u)
#define BQ7982X_MSK_VCELL_OFFSET9_OFFSET17            (0x0Fu)

/* --------------------------------------------------------------------------
 * CUST_MISC1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC1_OFFSET                       (0x0034u)
#define BQ7982X_CUST_MISC1_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC1_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC1_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC1_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC1_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC1_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC1_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC1_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC1_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC1_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC1_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC1_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC1_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC1_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC1_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC1_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC1_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC2_OFFSET                       (0x0035u)
#define BQ7982X_CUST_MISC2_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC2_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC2_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC2_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC2_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC2_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC2_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC2_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC2_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC2_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC2_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC2_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC2_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC2_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC2_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC2_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC2_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC3_OFFSET                       (0x0036u)
#define BQ7982X_CUST_MISC3_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC3_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC3_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC3_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC3_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC3_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC3_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC3_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC3_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC3_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC3_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC3_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC3_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC3_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC3_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC3_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC3_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC4          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC4_OFFSET                       (0x0037u)
#define BQ7982X_CUST_MISC4_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC4_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC4_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC4_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC4_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC4_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC4_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC4_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC4_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC4_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC4_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC4_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC4_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC4_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC4_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC4_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC4_DATA_0_MSK                    (0x01u)
/* --------------------------------------------------------------------------
 * CUST_MISC5          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC5_OFFSET                       (0x0038u)
#define BQ7982X_CUST_MISC5_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC5_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC5_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC5_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC5_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC5_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC5_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC5_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC5_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC5_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC5_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC5_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC5_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC5_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC5_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC5_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC5_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC6          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC6_OFFSET                       (0x0039u)
#define BQ7982X_CUST_MISC6_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC6_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC6_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC6_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC6_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC6_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC6_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC6_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC6_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC6_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC6_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC6_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC6_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC6_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC6_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC6_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC6_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC7          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC7_OFFSET                       (0x003Au)
#define BQ7982X_CUST_MISC7_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC7_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC7_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC7_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC7_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC7_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC7_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC7_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC7_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC7_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC7_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC7_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC7_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC7_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC7_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC7_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC7_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CUST_MISC8          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_MISC8_OFFSET                       (0x003Bu)
#define BQ7982X_CUST_MISC8_POR_VAL                      (0x00u)

#define BQ7982X_CUST_MISC8_DATA_7_POS                   (0x07u)
#define BQ7982X_CUST_MISC8_DATA_6_POS                   (0x06u)
#define BQ7982X_CUST_MISC8_DATA_5_POS                   (0x05u)
#define BQ7982X_CUST_MISC8_DATA_4_POS                   (0x04u)
#define BQ7982X_CUST_MISC8_DATA_3_POS                   (0x03u)
#define BQ7982X_CUST_MISC8_DATA_2_POS                   (0x02u)
#define BQ7982X_CUST_MISC8_DATA_1_POS                   (0x01u)
#define BQ7982X_CUST_MISC8_DATA_0_POS                   (0x00u)

#define BQ7982X_CUST_MISC8_DATA_7_MSK                    (0x80u)
#define BQ7982X_CUST_MISC8_DATA_6_MSK                    (0x40u)
#define BQ7982X_CUST_MISC8_DATA_5_MSK                    (0x20u)
#define BQ7982X_CUST_MISC8_DATA_4_MSK                    (0x10u)
#define BQ7982X_CUST_MISC8_DATA_3_MSK                    (0x08u)
#define BQ7982X_CUST_MISC8_DATA_2_MSK                    (0x04u)
#define BQ7982X_CUST_MISC8_DATA_1_MSK                    (0x02u)
#define BQ7982X_CUST_MISC8_DATA_0_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CONF1      (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CONF1_OFFSET                   (0x003Cu)
#define BQ7982X_DIG_SYNC_CONF1_POR_VAL                  (0x00u)

#define BQ7982X_POS_DIG_SYNC_CONF1_ADDRH              (0x00u)

#define BQ7982X_MSK_DIG_SYNC_CONF1_ADDRH              (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CONF2      (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CONF2_OFFSET                   (0x003Du)
#define BQ7982X_DIG_SYNC_CONF2_POR_VAL                  (0x00u)

#define BQ7982X_DIG_SYNC_CONF2_ADDRL_7_POS              (0x07u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_6_POS              (0x06u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_5_POS              (0x05u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_4_POS              (0x04u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_3_POS              (0x03u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_2_POS              (0x02u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_1_POS              (0x01u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRL_0_POS              (0x00u)

#define BQ7982X_DIG_SYNC_CONF2_ADDRH_7_MSK              (0x80u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_6_MSK              (0x40u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_5_MSK              (0x20u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_4_MSK              (0x10u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_3_MSK              (0x08u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_2_MSK              (0x04u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_1_MSK              (0x02u)
#define BQ7982X_DIG_SYNC_CONF2_ADDRH_0_MSK              (0x01u)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_CONF   (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_CONF_OFFSET                (0x003Eu)
#define BQ7982X_SMART_FREEZE_CONF_POR_VAL               (0x00u)


