xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_SMART_FREEZE_CONF_SPARE           (0x05u)
#define BQ7982X_POS_SMART_FREEZE_CONF_SLOT_LEN        (0x03u)
#define BQ7982X_POS_SMART_FREEZE_CONF_SAMP_LEN        (0x00u)

#define BQ7982X_MSK_SMART_FREEZE_CONF_SPARE            (0xE0u)
#define BQ7982X_MSK_SMART_FREEZE_CONF_SLOT_LEN         (0x18u)
#define BQ7982X_MSK_SMART_FREEZE_CONF_SAMP_LEN         (0x07u)

/* --------------------------------------------------------------------------
 * ADC_CONF            (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CONF_OFFSET                         (0x003Fu)
#define BQ7982X_ADC_CONF_POR_VAL                        (0x00u)

#define BQ7982X_ADC_CONF_ADC_DLY_7_POS                  (0x07u)
#define BQ7982X_ADC_CONF_ADC_DLY_6_POS                  (0x06u)
#define BQ7982X_ADC_CONF_ADC_DLY_5_POS                  (0x05u)
#define BQ7982X_ADC_CONF_ADC_DLY_4_POS                  (0x04u)
#define BQ7982X_ADC_CONF_ADC_DLY_3_POS                  (0x03u)
#define BQ7982X_ADC_CONF_ADC_DLY_2_POS                  (0x02u)
#define BQ7982X_ADC_CONF_ADC_DLY_1_POS                  (0x01u)
#define BQ7982X_ADC_CONF_ADC_DLY_0_POS                  (0x00u)

#define BQ7982X_ADC_CONF_ADC_DLY_7_MSK                   (0x80u)
#define BQ7982X_ADC_CONF_ADC_DLY_6_MSK                   (0x40u)
#define BQ7982X_ADC_CONF_ADC_DLY_5_MSK                   (0x20u)
#define BQ7982X_ADC_CONF_ADC_DLY_4_MSK                   (0x10u)
#define BQ7982X_ADC_CONF_ADC_DLY_3_MSK                   (0x08u)
#define BQ7982X_ADC_CONF_ADC_DLY_2_MSK                   (0x04u)
#define BQ7982X_ADC_CONF_ADC_DLY_1_MSK                   (0x02u)
#define BQ7982X_ADC_CONF_ADC_DLY_0_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE6          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE6_OFFSET                       (0x0040u)
#define BQ7982X_OTP_SPARE6_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE6_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE6_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE6_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE6_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE6_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE6_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE6_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE6_SPARE_0_POS                  (0x00u)

#define BQ7982X_OTP_SPARE6_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE6_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE6_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE6_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE6_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE6_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE6_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE6_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE5          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE5_OFFSET                       (0x0041u)
#define BQ7982X_OTP_SPARE5_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE5_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE5_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE5_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE5_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE5_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE5_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE5_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE5_SPARE_0_POS                  (0x00u)

#define BQ7982X_OTP_SPARE5_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE5_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE5_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE5_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE5_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE5_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE5_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE5_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE4          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE4_OFFSET                       (0x0042u)
#define BQ7982X_OTP_SPARE4_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE4_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE4_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE4_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE4_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE4_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE4_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE4_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE4_SPARE_0_POS                  (0x00u)

#define BQ7982X_OTP_SPARE4_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE4_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE4_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE4_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE4_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE4_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE4_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE4_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE3          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE3_OFFSET                       (0x0043u)
#define BQ7982X_OTP_SPARE3_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE3_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE3_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE3_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE3_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE3_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE3_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE3_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE3_SPARE_0_POS                  (0x00u)

#define BQ7982X_OTP_SPARE3_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE3_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE3_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE3_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE3_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE3_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE3_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE3_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE2          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE2_OFFSET                       (0x0044u)
#define BQ7982X_OTP_SPARE2_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE2_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE2_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE2_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE2_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE2_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE2_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE2_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE2_SPARE_0_POS                  (0x00u)

