xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_OTP_SPARE2_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE2_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE2_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE2_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE2_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE2_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE2_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE2_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * OTP_SPARE1          (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE1_OFFSET                       (0x0045u)
#define BQ7982X_OTP_SPARE1_POR_VAL                      (0x00u)

#define BQ7982X_OTP_SPARE1_SPARE_7_POS                  (0x07u)
#define BQ7982X_OTP_SPARE1_SPARE_6_POS                  (0x06u)
#define BQ7982X_OTP_SPARE1_SPARE_5_POS                  (0x05u)
#define BQ7982X_OTP_SPARE1_SPARE_4_POS                  (0x04u)
#define BQ7982X_OTP_SPARE1_SPARE_3_POS                  (0x03u)
#define BQ7982X_OTP_SPARE1_SPARE_2_POS                  (0x02u)
#define BQ7982X_OTP_SPARE1_SPARE_1_POS                  (0x01u)
#define BQ7982X_OTP_SPARE1_SPARE_0_POS                  (0x00u)

#define BQ7982X_OTP_SPARE1_SPARE_7_MSK                  (0x80u)
#define BQ7982X_OTP_SPARE1_SPARE_6_MSK                  (0x40u)
#define BQ7982X_OTP_SPARE1_SPARE_5_MSK                  (0x20u)
#define BQ7982X_OTP_SPARE1_SPARE_4_MSK                  (0x10u)
#define BQ7982X_OTP_SPARE1_SPARE_3_MSK                  (0x08u)
#define BQ7982X_OTP_SPARE1_SPARE_2_MSK                  (0x04u)
#define BQ7982X_OTP_SPARE1_SPARE_1_MSK                  (0x02u)
#define BQ7982X_OTP_SPARE1_SPARE_0_MSK                  (0x01u)

/* --------------------------------------------------------------------------
 * CS_ADC1_CAL1        (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CS_ADC1_CAL1_OFFSET                     (0x0046u)
#define BQ7982X_CS_ADC1_CAL1_POR_VAL                    (0x00u)

#define BQ7982X_CS_ADC1_CAL1_OFFSET_4_POS               (0x04u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_3_POS               (0x03u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_2_POS               (0x02u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_1_POS               (0x01u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_0_POS               (0x00u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_2_POS                (0x05u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_1_POS                (0x04u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_0_POS                (0x03u)

#define BQ7982X_CS_ADC1_CAL1_OFFSET_4_MSK               (0x80u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_3_MSK               (0x40u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_2_MSK               (0x20u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_1_MSK               (0x10u)
#define BQ7982X_CS_ADC1_CAL1_OFFSET_0_MSK               (0x08u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_2_MSK                (0x04u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_1_MSK                (0x02u)
#define BQ7982X_CS_ADC1_CAL1_GAINH_0_MSK                (0x01u)

/* --------------------------------------------------------------------------
 * CS_ADC1_CAL2        (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CS_ADC1_CAL2_OFFSET                     (0x0047u)
#define BQ7982X_CS_ADC1_CAL2_POR_VAL                    (0x00u)

#define BQ7982X_CS_ADC1_CAL2_GAINL_7_POS                (0x07u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_6_POS                (0x06u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_5_POS                (0x05u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_4_POS                (0x04u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_3_POS                (0x03u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_2_POS                (0x02u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_1_POS                (0x01u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_0_POS                (0x00u)

#define BQ7982X_CS_ADC1_CAL2_GAINL_7_MSK                (0x80u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_6_MSK                (0x40u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_5_MSK                (0x20u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_4_MSK                (0x10u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_3_MSK                (0x08u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_2_MSK                (0x04u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_1_MSK                (0x02u)
#define BQ7982X_CS_ADC1_CAL2_GAINL_0_MSK                (0x01u)

/* --------------------------------------------------------------------------
 * OTP_PROG_UNLOCK1   (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_PROG_UNLOCK1_OFFSET                (0x0200u)
#define BQ7982X_OTP_PROG_UNLOCK1_POR_VAL               (0x00u)


#define BQ7982X_POS_OTP_PROG_UNLOCK1_CODE            (0x00u)

#define BQ7982X_MSK_OTP_PROG_UNLOCK1_CODE            (0xFFu)

/* --------------------------------------------------------------------------
 * CONTROL1           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CONTROL1_OFFSET                        (0x0204u)
#define BQ7982X_CONTROL1_POR_VAL                       (0x00u)

#define BQ7982X_CONTROL1_DIR_SEL_POS                    (0x07u)
#define BQ7982X_POS_CONTROL1_SEND_SD_HW_RST             (0x06u)
#define BQ7982X_CONTROL1_SEND_WAKE_POS                  (0x05u)
#define BQ7982X_POS_CONTROL1_SEND_SLPTOACT              (0x04u)
#define BQ7982X_POS_CONTROL1_GOTO_SHUTDOWN              (0x03u)
#define BQ7982X_CONTROL1_GOTO_SLEEP_POS                 (0x02u)
#define BQ7982X_CONTROL1_SOFT_RESET_POS                 (0x01u)
#define BQ7982X_CONTROL1_MD_TONE_SEL_POS                (0x00u)

#define BQ7982X_CONTROL1_DIR_SEL_MSK                    (0x80u)
#define BQ7982X_MSK_CONTROL1_SEND_SD_HW_RST             (0x40u)
#define BQ7982X_CONTROL1_SEND_WAKE_MSK                  (0x20u)
#define BQ7982X_MSK_CONTROL1_SEND_SLPTOACT              (0x10u)
#define BQ7982X_MSK_CONTROL1_GOTO_SHUTDOWN              (0x08u)
#define BQ7982X_CONTROL1_GOTO_SLEEP_MSK                 (0x04u)
#define BQ7982X_CONTROL1_SOFT_RESET_MSK                 (0x02u)
#define BQ7982X_CONTROL1_MD_TONE_SEL_MSK                (0x01u)

/* --------------------------------------------------------------------------
 * CONTROL2           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CONTROL2_OFFSET                        (0x0205u)
#define BQ7982X_CONTROL2_POR_VAL                       (0x01u)

#define BQ7982X_CONTROL2_ADDR_WR_POS                    (0x03u)
#define BQ7982X_POS_CONTROL2_SEND_HW_RST_BLAST          (0x02u)
#define BQ7982X_CONTROL2_PROG_GO_POS                    (0x01u)
#define BQ7982X_CONTROL2_TSREF_EN_POS                   (0x00u)

#define BQ7982X_CONTROL2_ADDR_WR_MSK                    (0x08u)
#define BQ7982X_MSK_CONTROL2_SEND_HW_RST_BLAST          (0x04u)
#define BQ7982X_CONTROL2_PROG_GO_MSK                    (0x02u)
#define BQ7982X_CONTROL2_TSREF_EN_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * COML_CTRL           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COML_CTRL_OFFSET                         (0x0208u)
#define BQ7982X_COML_CTRL_POR_VAL                        (0x00u)

#define BQ7982X_COML_CTRL_TOP_STACK_POS                  (0x07u)
#define BQ7982X_COML_CTRL_ADDRESS_POS                    (0x00u)

#define BQ7982X_COML_CTRL_TOP_STACK_MSK                  (0x80u)
#define BQ7982X_COML_CTRL_ADDRESS_MSK                    (0x7Fu)

/* --------------------------------------------------------------------------
 * COMH_CTRL           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COMH_CTRL_OFFSET                         (0x0209u)
#define BQ7982X_COMH_CTRL_POR_VAL                        (0x00u)

#define BQ7982X_COMH_CTRL_TOP_STACK_POS                  (0x07u)
#define BQ7982X_COMH_CTRL_ADDRESS_POS                    (0x00u)

