xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_COMH_CTRL_TOP_STACK_MSK                  (0x80u)
#define BQ7982X_COMH_CTRL_ADDRESS_MSK                    (0x7Fu)

/* --------------------------------------------------------------------------
 * PROP_DLY_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PROP_DLY_CTRL1_OFFSET                    (0x0222u)
#define BQ7982X_PROP_DLY_CTRL1_POR_VAL                   (0x00u)

#define BQ7982X_POS_PROP_DLY_CTRL1_PROP_DLY_TO           (0x04u)
#define BQ7982X_POS_PROP_DLY_CTRL1_PROP_DLY_DIR          (0x03u)
#define BQ7982X_POS_PROP_DLY_CTRL1_PROP_DLY_MODE         (0x00u)

#define BQ7982X_MSK_PROP_DLY_CTRL1_PROP_DLY_TO           (0x10u)
#define BQ7982X_MSK_PROP_DLY_CTRL1_PROP_DLY_DIR          (0x08u)
#define BQ7982X_MSK_PROP_DLY_CTRL1_PROP_DLY_MODE         (0x07u)

/* --------------------------------------------------------------------------
 * PROP_DLY_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PROP_DLY_CTRL2_OFFSET                    (0x0223u)
#define BQ7982X_PROP_DLY_CTRL2_POR_VAL                   (0x00u)

#define BQ7982X_POS_PROP_DLY_CTRL2_PROP_DLY_GO           (0x00u)

#define BQ7982X_MSK_PROP_DLY_CTRL2_PROP_DLY_GO           (0x01u)

/* --------------------------------------------------------------------------
 * HFO_FREQ_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_HFO_FREQ_CTRL1_OFFSET                    (0x0226u)
#define BQ7982X_HFO_FREQ_CTRL1_POR_VAL                   (0x00u)

#define BQ7982X_POS_HFO_FREQ_CTRL1_FREQ_ADJ              (0x00u)

#define BQ7982X_MSK_HFO_FREQ_CTRL1_FREQ_ADJ              (0xFFu)

/* --------------------------------------------------------------------------
 * HFO_FREQ_CTRL2           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_HFO_FREQ_CTRL2_OFFSET                    (0x0227u)
#define BQ7982X_HFO_FREQ_CTRL2_POR_VAL                   (0x00u)

#define BQ7982X_POS_HFO_FREQ_CTRL2_FREQ_GO               (0x00u)

#define BQ7982X_MSK_HFO_FREQ_CTRL2_FREQ_GO               (0x01u)

/* --------------------------------------------------------------------------
 * PLL_SYNC_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PLL_SYNC_CTRL1_OFFSET                    (0x022Au)
#define BQ7982X_PLL_SYNC_CTRL1_POR_VAL                   (0x00u)

#define BQ7982X_POS_PLL_SYNC_CTRL1_PLL_SYNC_WAIT         (0x04u)
#define BQ7982X_POS_PLL_SYNC_CTRL1_PLL_SYNC_DIR          (0x03u)
#define BQ7982X_POS_PLL_SYNC_CTRL1_PLL_DEV_MODE          (0x00u)

#define BQ7982X_MSK_PLL_SYNC_CTRL1_PLL_SYNC_WAIT         (0x10u)
#define BQ7982X_MSK_PLL_SYNC_CTRL1_PLL_SYNC_DIR          (0x08u)
#define BQ7982X_MSK_PLL_SYNC_CTRL1_PLL_DEV_MODE          (0x07u)

/* --------------------------------------------------------------------------
 * PLL_SYNC_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PLL_SYNC_CTRL2_OFFSET                    (0x022Bu)
#define BQ7982X_PLL_SYNC_CTRL2_POR_VAL                   (0x00u)

#define BQ7982X_POS_PLL_SYNC_CTRL2_PLL_SYNC_GO           (0x00u)

#define BQ7982X_MSK_PLL_SYNC_CTRL2_PLL_SYNC_GO           (0x01u)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL1_OFFSET                    (0x022Eu)
#define BQ7982X_DIG_SYNC_CTRL1_POR_VAL                   (0x00u)

#define BQ7982X_DIG_SYNC_CTRL1_GAINH_POS                 (0x00u)

#define BQ7982X_DIG_SYNC_CTRL1_GAINH_MSK                 (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL2_OFFSET                    (0x022Fu)
#define BQ7982X_DIG_SYNC_CTRL2_POR_VAL                   (0x00u)

#define BQ7982X_DIG_SYNC_CTRL2_GAINL_POS                 (0x00u)

#define BQ7982X_DIG_SYNC_CTRL2_GAINL_MSK                 (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL3           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL3_OFFSET                    (0x0230u)
#define BQ7982X_DIG_SYNC_CTRL3_POR_VAL                   (0x00u)

#define BQ7982X_POS_DIG_SYNC_CTRL3_SYNC_DEV_FRAME        (0x04u)
#define BQ7982X_POS_DIG_SYNC_CTRL3_SYNC_DEV_DIR          (0x03u)
#define BQ7982X_POS_DIG_SYNC_CTRL3_SYNC_DEV_MODE1        (0x02u)
#define BQ7982X_POS_DIG_SYNC_CTRL3_SYNC_DEV_MODE0        (0x01u)
#define BQ7982X_POS_DIG_SYNC_CTRL3_SYNC_DEV_GO           (0x00u)

#define BQ7982X_MSK_DIG_SYNC_CTRL3_SYNC_DEV_FRAME        (0x10u)
#define BQ7982X_MSK_DIG_SYNC_CTRL3_SYNC_DEV_DIR          (0x08u)
#define BQ7982X_MSK_DIG_SYNC_CTRL3_SYNC_DEV_MODE1        (0x04u)
#define BQ7982X_MSK_DIG_SYNC_CTRL3_SYNC_DEV_MODE0        (0x02u)
#define BQ7982X_MSK_DIG_SYNC_CTRL3_SYNC_DEV_GO           (0x01u)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL4           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL4_OFFSET                    (0x0231u)
#define BQ7982X_DIG_SYNC_CTRL4_POR_VAL                   (0x00u)

#define BQ7982X_POS_DIG_SYNC_CTRL4_REF_COUNTH            (0x00u)

#define BQ7982X_MSK_DIG_SYNC_CTRL4_REF_COUNTH            (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL5           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL5_OFFSET                    (0x0232u)
#define BQ7982X_DIG_SYNC_CTRL5_POR_VAL                   (0x00u)

#define BQ7982X_POS_DIG_SYNC_CTRL5_REF_COUNTL            (0x00u)

#define BQ7982X_MSK_DIG_SYNC_CTRL5_REF_COUNTL            (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_CTRL6           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_CTRL6_OFFSET                    (0x0233u)
#define BQ7982X_DIG_SYNC_CTRL6_POR_VAL                   (0x00u)

#define BQ7982X_POS_DIG_SYNC_CTRL6_DIG_SYNC_START        (0x05u)
#define BQ7982X_POS_DIG_SYNC_CTRL6_DIG_SYNC_WAIT         (0x04u)
#define BQ7982X_POS_DIG_SYNC_CTRL6_SYNC_ADC_RESET        (0x03u)
#define BQ7982X_POS_DIG_SYNC_CTRL6_DIG_SYNC_MODE         (0x01u)
#define BQ7982X_POS_DIG_SYNC_CTRL6_DIG_SYNC_GO           (0x00u)

#define BQ7982X_MSK_DIG_SYNC_CTRL6_DIG_SYNC_START        (0x20u)
#define BQ7982X_MSK_DIG_SYNC_CTRL6_DIG_SYNC_WAIT         (0x10u)
#define BQ7982X_MSK_DIG_SYNC_CTRL6_SYNC_ADC_RESET        (0x08u)
#define BQ7982X_MSK_DIG_SYNC_CTRL6_DIG_SYNC_MODE         (0x06u)
#define BQ7982X_MSK_DIG_SYNC_CTRL6_DIG_SYNC_GO           (0x01u)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_CTRL1_OFFSET                    (0x0236u)
#define BQ7982X_SMART_FREEZE_CTRL1_POR_VAL                   (0x00u)

#define BQ7982X_POS_SMART_FREEZE_CTRL1_SLOT_SEL              (0x00u)

#define BQ7982X_MSK_SMART_FREEZE_CTRL1_SLOT_SEL              (0xFFu)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_CTRL2_OFFSET                    (0x0237u)
#define BQ7982X_SMART_FREEZE_CTRL2_POR_VAL                   (0x00u)

#define BQ7982X_POS_SMART_FREEZE_CTRL2_SF_MODE               (0x01u)
#define BQ7982X_POS_SMART_FREEZE_CTRL2_SF_GO                 (0x00u)

#define BQ7982X_MSK_SMART_FREEZE_CTRL2_SF_MODE               (0x06u)
#define BQ7982X_MSK_SMART_FREEZE_CTRL2_SF_GO                 (0x01u)

/* --------------------------------------------------------------------------
 * ADC_CTRL5                    (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CTRL5_OFFSET                            (0x0243u)
#define BQ7982X_ADC_CTRL5_POR_VAL                           (0x00u)

#define BQ7982X_ADC_CTRL5_LPF2_CS_POS                       (0x05u)
#define BQ7982X_ADC_CTRL5_LPF2_CS_EN_POS                    (0x04u)
#define BQ7982X_ADC_CTRL5_LPF_CS_POS                        (0x01u)
#define BQ7982X_ADC_CTRL5_LPF_CS_EN_POS                     (0x00u)

#define BQ7982X_ADC_CTRL5_LPF2_CS_MSK                       (0xE0u)
#define BQ7982X_ADC_CTRL5_LPF2_CS_EN_MSK                    (0x10u)
#define BQ7982X_ADC_CTRL5_LPF_CS_MSK                        (0x0Eu)
#define BQ7982X_ADC_CTRL5_LPF_CS_EN_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * ADC_CTRL4                    (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CTRL4_OFFSET                            (0x0244u)
#define BQ7982X_ADC_CTRL4_POR_VAL                           (0x00u)

#define BQ7982X_POS_ADC_CTRL4_FREEZE_LPF_EN                 (0x03u)
#define BQ7982X_POS_ADC_CTRL4_ADC_DLY_MODE                  (0x02u)
#define BQ7982X_ADC_CTRL4_CSADC_MODE_POS                    (0x01u)
#define BQ7982X_ADC_CTRL4_GP_DR_POS                         (0x00u)

