xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_MSK_ADC_CTRL4_FREEZE_LPF_EN                 (0x08u)
#define BQ7982X_MSK_ADC_CTRL4_ADC_DLY_MODE                  (0x04u)
#define BQ7982X_ADC_CTRL4_CSADC_MODE_MSK                    (0x02u)
#define BQ7982X_ADC_CTRL4_GP_DR_MSK                         (0x01u)

/* --------------------------------------------------------------------------
 * ADC_CTRL3                    (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CTRL3_OFFSET                            (0x0245u)
#define BQ7982X_ADC_CTRL3_POR_VAL                           (0x00u)

#define BQ7982X_ADC_CTRL3_FREEZE_EN_POS                     (0x07u)
#define BQ7982X_ADC_CTRL3_LPF_VCELL_POS                     (0x04u)
#define BQ7982X_ADC_CTRL3_LPF_VCELL_EN_POS                  (0x03u)
#define BQ7982X_ADC_CTRL3_ADC_MODE_POS                      (0x01u)
#define BQ7982X_ADC_CTRL3_ADC_GO_POS                        (0x00u)

#define BQ7982X_ADC_CTRL3_FREEZE_EN_MSK                     (0x80u)
#define BQ7982X_ADC_CTRL3_LPF_VCELL_MSK                     (0x70u)
#define BQ7982X_ADC_CTRL3_LPF_VCELL_EN_MSK                  (0x08u)
#define BQ7982X_ADC_CTRL3_ADC_MODE_MSK                      (0x06u)
#define BQ7982X_ADC_CTRL3_ADC_GO_MSK                        (0x01u)

/* --------------------------------------------------------------------------
 * ADC_CTRL2                    (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CTRL2_OFFSET                            (0x0246u)
#define BQ7982X_ADC_CTRL2_POR_VAL                           (0x00u)

#define BQ7982X_POS_ADC_CTRL2_FLIP_READ_EN                  (0x07u)
#define BQ7982X_ADC_CTRL2_FLIP_RESET_POS                    (0x06u)
#define BQ7982X_POS_ADC_CTRL2_DIAG_VCELL_GPIO               (0x05u)
#define BQ7982X_POS_ADC_CTRL2_DIAG_ANA_SEL                  (0x00u)

#define BQ7982X_MSK_ADC_CTRL2_FLIP_READ_EN                  (0x80u)
#define BQ7982X_ADC_CTRL2_FLIP_RESET_MSK                    (0x40u)
#define BQ7982X_MSK_ADC_CTRL2_DIAG_VCELL_GPIO               (0x20u)
#define BQ7982X_MSK_ADC_CTRL2_DIAG_ANA_SEL                  (0x1Fu)

/* --------------------------------------------------------------------------
 * ADC_CTRL1                    (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_CTRL1_OFFSET                            (0x0247u)
#define BQ7982X_ADC_CTRL1_POR_VAL                           (0x00u)

#define BQ7982X_POS_ADC_CTRL1_DIAG_D1D2_SEL                 (0x01u)
#define BQ7982X_POS_ADC_CTRL1_DIAG_MEAS_GO                  (0x00u)

#define BQ7982X_MSK_ADC_CTRL1_DIAG_D1D2_SEL                 (0x0Eu)
#define BQ7982X_MSK_ADC_CTRL1_DIAG_MEAS_GO                  (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_ADC_CTRL1               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_ADC_CTRL1_OFFSET                       (0x0248u)
#define BQ7982X_DIAG_ADC_CTRL1_POR_VAL                      (0x00u)

#define BQ7982X_POS_DIAG_ADC_CTRL1_VCELL_FILT               (0x06u)
#define BQ7982X_POS_DIAG_ADC_CTRL1_VCELL_THR                (0x00u)

#define BQ7982X_MSK_DIAG_ADC_CTRL1_VCELL_FILT               (0x40u)
#define BQ7982X_MSK_DIAG_ADC_CTRL1_VCELL_THR                (0x3Fu)

/* --------------------------------------------------------------------------
 * DIAG_ADC_CTRL2               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_ADC_CTRL2_OFFSET                       (0x0249u)
#define BQ7982X_DIAG_ADC_CTRL2_POR_VAL                      (0x00u)

#define BQ7982X_POS_DIAG_ADC_CTRL2_BAL_CYCLES               (0x05u)
#define BQ7982X_DIAG_ADC_CTRL2_BB_THR_POS                   (0x03u)
#define BQ7982X_POS_DIAG_ADC_CTRL2_GPIO_THR                 (0x00u)

#define BQ7982X_MSK_DIAG_ADC_CTRL2_BAL_CYCLES               (0x20u)
#define BQ7982X_DIAG_ADC_CTRL2_BB_THR_MSK                   (0x18u)
#define BQ7982X_MSK_DIAG_ADC_CTRL2_GPIO_THR                 (0x07u)

/* --------------------------------------------------------------------------
 * DIAG_ADC_CTRL3               (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_ADC_CTRL3_OFFSET                       (0x024Au)
#define BQ7982X_DIAG_ADC_CTRL3_POR_VAL                      (0x00u)

#define BQ7982X_POS_DIAG_ADC_CTRL3_DIAG_BAL_FREEZE          (0x07u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_BB_ACOMP_EN              (0x06u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_ACOMP_MPFLT_INJ          (0x05u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_DCOMP_MPFLT_INJ          (0x04u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_DIAG_DIG_EN              (0x03u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_DIAG_ANA_MODE            (0x01u)
#define BQ7982X_POS_DIAG_ADC_CTRL3_DIAG_ANA_GO              (0x00u)

#define BQ7982X_MSK_DIAG_ADC_CTRL3_DIAG_BAL_FREEZE          (0x80u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_BB_ACOMP_EN              (0x40u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_ACOMP_MPFLT_INJ          (0x20u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_DCOMP_MPFLT_INJ          (0x10u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_DIAG_DIG_EN              (0x08u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_DIAG_ANA_MODE            (0x06u)
#define BQ7982X_MSK_DIAG_ADC_CTRL3_DIAG_ANA_GO              (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_MISC_CTRL1              (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_MISC_CTRL1_OFFSET                      (0x024Bu)
#define BQ7982X_DIAG_MISC_CTRL1_POR_VAL                     (0x00u)

#define BQ7982X_POS_DIAG_MISC_CTRL1_CSPI_LOOPBACK           (0x06u)
#define BQ7982X_POS_DIAG_MISC_CTRL1_FLIP_TR_CRC             (0x05u)
#define BQ7982X_POS_DIAG_MISC_CTRL1_FLIP_FACT_CRC           (0x04u)
#define BQ7982X_POS_DIAG_MISC_CTRL1_MARGIN_MODE             (0x01u)
#define BQ7982X_POS_DIAG_MISC_CTRL1_MARGIN_GO               (0x00u)

