xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_MSK_DIAG_MISC_CTRL1_CSPI_LOOPBACK           (0x40u)
#define BQ7982X_MSK_DIAG_MISC_CTRL1_FLIP_TR_CRC             (0x20u)
#define BQ7982X_MSK_DIAG_MISC_CTRL1_FLIP_FACT_CRC           (0x10u)
#define BQ7982X_MSK_DIAG_MISC_CTRL1_MARGIN_MODE             (0xE0u)
#define BQ7982X_MSK_DIAG_MISC_CTRL1_MARGIN_GO               (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_MISC_CTRL2              (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_MISC_CTRL2_OFFSET                      (0x024Cu)
#define BQ7982X_DIAG_MISC_CTRL2_POR_VAL                     (0x00u)

#define BQ7982X_POS_DIAG_MISC_CTRL2_DIAG_VCOW_DIS           (0x06u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_DIAG_CBOW_DIS           (0x05u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_NUM_CELL_OV_MPFLT_INJ   (0x04u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_CBFETOW_MPFLT_INJ       (0x03u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_DIAG_CBFETOW_GO         (0x02u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_PWRBIST_NO_RST          (0x01u)
#define BQ7982X_POS_DIAG_MISC_CTRL2_PWRBIST_GO              (0x00u)

#define BQ7982X_MSK_DIAG_MISC_CTRL2_DIAG_VCOW_DIS           (0x40u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_DIAG_CBOW_DIS           (0x20u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_NUM_CELL_OV_MPFLT_INJ   (0x10u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_CBFETOW_MPFLT_INJ       (0x08u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_DIAG_CBFETOW_GO         (0x04u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_PWRBIST_NO_RST          (0x02u)
#define BQ7982X_MSK_DIAG_MISC_CTRL2_PWRBIST_GO              (0x01u)

/* --------------------------------------------------------------------------
 * CB_CELL26_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL26_CTRL_OFFSET                       (0x0256u)
#define BQ7982X_CB_CELL26_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL26_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL26_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL25_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL25_CTRL_OFFSET                       (0x0257u)
#define BQ7982X_CB_CELL25_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL25_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL25_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL24_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL24_CTRL_OFFSET                       (0x0258u)
#define BQ7982X_CB_CELL24_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL24_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL24_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL23_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL23_CTRL_OFFSET                       (0x0259u)
#define BQ7982X_CB_CELL23_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL23_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL23_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL22_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL22_CTRL_OFFSET                       (0x025Au)
#define BQ7982X_CB_CELL22_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL22_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL22_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL21_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL21_CTRL_OFFSET                       (0x025Bu)
#define BQ7982X_CB_CELL21_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL21_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL21_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL20_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL20_CTRL_OFFSET                       (0x025Cu)
#define BQ7982X_CB_CELL20_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL20_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL20_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL19_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL19_CTRL_OFFSET                       (0x025Du)
#define BQ7982X_CB_CELL19_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL19_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL19_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL18_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL18_CTRL_OFFSET                       (0x025Eu)
#define BQ7982X_CB_CELL18_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL18_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL18_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL17_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL17_CTRL_OFFSET                       (0x025Fu)
#define BQ7982X_CB_CELL17_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL17_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL17_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL16_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL16_CTRL_OFFSET                       (0x0260u)
#define BQ7982X_CB_CELL16_CTRL_POR_VAL                      (0x00u)

