xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_CB_CELL16_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL16_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL15_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL15_CTRL_OFFSET                       (0x0261u)
#define BQ7982X_CB_CELL15_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL15_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL15_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL14_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL14_CTRL_OFFSET                       (0x0262u)
#define BQ7982X_CB_CELL14_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL14_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL14_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL13_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL13_CTRL_OFFSET                       (0x0263u)
#define BQ7982X_CB_CELL13_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL13_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL13_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL12_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL12_CTRL_OFFSET                       (0x0264u)
#define BQ7982X_CB_CELL12_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL12_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL12_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL11_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL11_CTRL_OFFSET                       (0x0265u)
#define BQ7982X_CB_CELL11_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL11_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL11_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL10_CTRL               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL10_CTRL_OFFSET                       (0x0266u)
#define BQ7982X_CB_CELL10_CTRL_POR_VAL                      (0x00u)

#define BQ7982X_CB_CELL10_CTRL_TIME_POS                     (0x00u)
#define BQ7982X_CB_CELL10_CTRL_TIME_MSK                     (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL9_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL9_CTRL_OFFSET                        (0x0267u)
#define BQ7982X_CB_CELL9_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL9_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL9_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL8_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL8_CTRL_OFFSET                        (0x0268u)
#define BQ7982X_CB_CELL8_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL8_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL8_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL7_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL7_CTRL_OFFSET                        (0x0269u)
#define BQ7982X_CB_CELL7_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL7_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL7_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL6_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL6_CTRL_OFFSET                        (0x026Au)
#define BQ7982X_CB_CELL6_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL6_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL6_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL5_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL5_CTRL_OFFSET                        (0x026Bu)
#define BQ7982X_CB_CELL5_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL5_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL5_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL4_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL4_CTRL_OFFSET                        (0x026Cu)
#define BQ7982X_CB_CELL4_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL4_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL4_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL3_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL3_CTRL_OFFSET                        (0x026Du)
#define BQ7982X_CB_CELL3_CTRL_POR_VAL                       (0x00u)

