xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_CB_CELL3_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL3_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL2_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL2_CTRL_OFFSET                        (0x026Eu)
#define BQ7982X_CB_CELL2_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL2_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL2_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_CELL1_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_CELL1_CTRL_OFFSET                        (0x026Fu)
#define BQ7982X_CB_CELL1_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_CELL1_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_CELL1_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * CB_GLOBAL_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CB_GLOBAL_CTRL_OFFSET                        (0x0270u)
#define BQ7982X_CB_GLOBAL_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CB_GLOBAL_CTRL_TIME_POS                      (0x00u)
#define BQ7982X_CB_GLOBAL_CTRL_TIME_MSK                      (0x1Fu)

/* --------------------------------------------------------------------------
 * VCBDONE_THRESH               (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCBDONE_THRESH_OFFSET                        (0x0271u)
#define BQ7982X_VCBDONE_THRESH_POR_VAL                       (0x00u)

#define BQ7982X_VCBDONE_THRESH_CB_THR_POS                    (0x00u)
#define BQ7982X_VCBDONE_THRESH_CB_THR_MSK                    (0x7Fu)

/* --------------------------------------------------------------------------
 * OTCB_THRESH                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTCB_THRESH_OFFSET                        (0x0272u)
#define BQ7982X_OTCB_THRESH_POR_VAL                       (0x00u)

#define BQ7982X_OTCB_THRESH_OTCB_THR_POS                    (0x00u)
#define BQ7982X_OTCB_THRESH_OTCB_THR_MSK                    (0x0Fu)

/* --------------------------------------------------------------------------
 * OVUV_THR_SEL1                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OVUV_THR_SEL1_OFFSET                        (0x0273u)
#define BQ7982X_OVUV_THR_SEL1_POR_VAL                       (0x00u)

#define BQ7982X_OVUV_THR_SEL1_CELL8_POS                    (0x07u)
#define BQ7982X_OVUV_THR_SEL1_CELL8_MSK                    (0x80u)

#define BQ7982X_OVUV_THR_SEL1_CELL7_POS                    (0x06u)
#define BQ7982X_OVUV_THR_SEL1_CELL7_MSK                    (0x40u)

#define BQ7982X_OVUV_THR_SEL1_CELL6_POS                    (0x05u)
#define BQ7982X_OVUV_THR_SEL1_CELL6_MSK                    (0x20u)

#define BQ7982X_OVUV_THR_SEL1_CELL5_POS                    (0x04u)
#define BQ7982X_OVUV_THR_SEL1_CELL5_MSK                    (0x10u)

#define BQ7982X_OVUV_THR_SEL1_CELL4_POS                    (0x03u)
#define BQ7982X_OVUV_THR_SEL1_CELL4_MSK                    (0x08u)

#define BQ7982X_OVUV_THR_SEL1_CELL3_POS                    (0x02u)
#define BQ7982X_OVUV_THR_SEL1_CELL3_MSK                    (0x04u)

#define BQ7982X_OVUV_THR_SEL1_CELL2_POS                    (0x01u)
#define BQ7982X_OVUV_THR_SEL1_CELL2_MSK                    (0x02u)

#define BQ7982X_OVUV_THR_SEL1_CELL1_POS                    (0x00u)
#define BQ7982X_OVUV_THR_SEL1_CELL1_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * OVUV_THR_SEL2                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OVUV_THR_SEL2_OFFSET                        (0x0274u)
#define BQ7982X_OVUV_THR_SEL2_POR_VAL                       (0x00u)

#define BQ7982X_OVUV_THR_SEL2_CELL16_POS                    (0x07u)
#define BQ7982X_OVUV_THR_SEL2_CELL16_MSK                    (0x80u)

#define BQ7982X_OVUV_THR_SEL2_CELL15_POS                    (0x06u)
#define BQ7982X_OVUV_THR_SEL2_CELL15_MSK                    (0x40u)

#define BQ7982X_OVUV_THR_SEL2_CELL14_POS                    (0x05u)
#define BQ7982X_OVUV_THR_SEL2_CELL14_MSK                    (0x20u)

#define BQ7982X_OVUV_THR_SEL2_CELL13_POS                    (0x04u)
#define BQ7982X_OVUV_THR_SEL2_CELL13_MSK                    (0x10u)

#define BQ7982X_OVUV_THR_SEL2_CELL12_POS                    (0x03u)
#define BQ7982X_OVUV_THR_SEL2_CELL12_MSK                    (0x08u)

#define BQ7982X_OVUV_THR_SEL2_CELL11_POS                    (0x02u)
#define BQ7982X_OVUV_THR_SEL2_CELL11_MSK                    (0x04u)

#define BQ7982X_OVUV_THR_SEL2_CELL10_POS                    (0x01u)
#define BQ7982X_OVUV_THR_SEL2_CELL10_MSK                    (0x02u)

#define BQ7982X_OVUV_THR_SEL2_CELL9_POS                    (0x00u)
#define BQ7982X_OVUV_THR_SEL2_CELL9_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * OVUV_THR_SEL3                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OVUV_THR_SEL3_OFFSET                        (0x0275u)
#define BQ7982X_OVUV_THR_SEL3_POR_VAL                       (0x00u)

#define BQ7982X_OVUV_THR_SEL3_CELL24_POS                    (0x07u)
#define BQ7982X_OVUV_THR_SEL3_CELL24_MSK                    (0x80u)

#define BQ7982X_OVUV_THR_SEL3_CELL23_POS                    (0x06u)
#define BQ7982X_OVUV_THR_SEL3_CELL23_MSK                    (0x40u)

#define BQ7982X_OVUV_THR_SEL3_CELL22_POS                    (0x05u)
#define BQ7982X_OVUV_THR_SEL3_CELL22_MSK                    (0x20u)

#define BQ7982X_OVUV_THR_SEL3_CELL21_POS                    (0x04u)
#define BQ7982X_OVUV_THR_SEL3_CELL21_MSK                    (0x10u)

#define BQ7982X_OVUV_THR_SEL3_CELL20_POS                    (0x03u)
#define BQ7982X_OVUV_THR_SEL3_CELL20_MSK                    (0x08u)

#define BQ7982X_OVUV_THR_SEL3_CELL19_POS                    (0x02u)
#define BQ7982X_OVUV_THR_SEL3_CELL19_MSK                    (0x04u)

#define BQ7982X_OVUV_THR_SEL3_CELL18_POS                    (0x01u)
#define BQ7982X_OVUV_THR_SEL3_CELL18_MSK                    (0x02u)

#define BQ7982X_OVUV_THR_SEL3_CELL17_POS                    (0x00u)
#define BQ7982X_OVUV_THR_SEL3_CELL17_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * OVUV_THR_SEL4                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OVUV_THR_SEL4_OFFSET                        (0x0276u)
#define BQ7982X_OVUV_THR_SEL4_POR_VAL                       (0x00u)

#define BQ7982X_OVUV_THR_SEL4_CELL26_POS                    (0x01u)
#define BQ7982X_OVUV_THR_SEL4_CELL26_MSK                    (0x02u)

#define BQ7982X_OVUV_THR_SEL4_CELL25_POS                    (0x00u)
#define BQ7982X_OVUV_THR_SEL4_CELL25_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * OTUT_THR_SEL1                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTUT_THR_SEL1_OFFSET                        (0x0277u)
#define BQ7982X_OTUT_THR_SEL1_POR_VAL                       (0x00u)

#define BQ7982X_OTUT_THR_SEL1_GPIO8_POS                     (0x07u)
#define BQ7982X_OTUT_THR_SEL1_GPIO8_MSK                     (0x80u)

