xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_OTUT_THR_SEL1_GPIO7_POS                     (0x06u)
#define BQ7982X_OTUT_THR_SEL1_GPIO7_MSK                     (0x40u)

#define BQ7982X_OTUT_THR_SEL1_GPIO6_POS                     (0x05u)
#define BQ7982X_OTUT_THR_SEL1_GPIO6_MSK                     (0x20u)

#define BQ7982X_OTUT_THR_SEL1_GPIO5_POS                     (0x04u)
#define BQ7982X_OTUT_THR_SEL1_GPIO5_MSK                     (0x10u)

#define BQ7982X_OTUT_THR_SEL1_GPIO4_POS                     (0x03u)
#define BQ7982X_OTUT_THR_SEL1_GPIO4_MSK                     (0x08u)

#define BQ7982X_OTUT_THR_SEL1_GPIO3_POS                     (0x02u)
#define BQ7982X_OTUT_THR_SEL1_GPIO3_MSK                     (0x04u)

#define BQ7982X_OTUT_THR_SEL1_GPIO2_POS                     (0x01u)
#define BQ7982X_OTUT_THR_SEL1_GPIO2_MSK                     (0x02u)

#define BQ7982X_OTUT_THR_SEL1_GPIO1_POS                     (0x00u)
#define BQ7982X_OTUT_THR_SEL1_GPIO1_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * OTUT_THR_SEL2                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTUT_THR_SEL2_OFFSET                        (0x0278u)
#define BQ7982X_OTUT_THR_SEL2_POR_VAL                       (0x00u)

#define BQ7982X_OTUT_THR_SEL2_GPIO16_POS                    (0x07u)
#define BQ7982X_OTUT_THR_SEL2_GPIO16_MSK                    (0x80u)

#define BQ7982X_OTUT_THR_SEL2_GPIO15_POS                    (0x06u)
#define BQ7982X_OTUT_THR_SEL2_GPIO15_MSK                    (0x40u)

#define BQ7982X_OTUT_THR_SEL2_GPIO14_POS                    (0x05u)
#define BQ7982X_OTUT_THR_SEL2_GPIO14_MSK                    (0x20u)

#define BQ7982X_OTUT_THR_SEL2_GPIO13_POS                    (0x04u)
#define BQ7982X_OTUT_THR_SEL2_GPIO13_MSK                    (0x10u)

#define BQ7982X_OTUT_THR_SEL2_GPIO12_POS                    (0x03u)
#define BQ7982X_OTUT_THR_SEL2_GPIO12_MSK                    (0x08u)

#define BQ7982X_OTUT_THR_SEL2_GPIO11_POS                    (0x02u)
#define BQ7982X_OTUT_THR_SEL2_GPIO11_MSK                    (0x04u)

#define BQ7982X_OTUT_THR_SEL2_GPIO10_POS                    (0x01u)
#define BQ7982X_OTUT_THR_SEL2_GPIO10_MSK                    (0x02u)

#define BQ7982X_OTUT_THR_SEL2_GPIO9_POS                     (0x00u)
#define BQ7982X_OTUT_THR_SEL2_GPIO9_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * OTUT_THR_SEL3                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTUT_THR_SEL3_OFFSET                        (0x0279u)
#define BQ7982X_OTUT_THR_SEL3_POR_VAL                       (0x00u)

#define BQ7982X_OTUT_THR_SEL3_GPIO20_POS                    (0x03u)
#define BQ7982X_OTUT_THR_SEL3_GPIO20_MSK                    (0x08u)

#define BQ7982X_OTUT_THR_SEL3_GPIO19_POS                    (0x02u)
#define BQ7982X_OTUT_THR_SEL3_GPIO19_MSK                    (0x04u)

#define BQ7982X_OTUT_THR_SEL3_GPIO18_POS                    (0x01u)
#define BQ7982X_OTUT_THR_SEL3_GPIO18_MSK                    (0x02u)

#define BQ7982X_OTUT_THR_SEL3_GPIO17_POS                    (0x00u)
#define BQ7982X_OTUT_THR_SEL3_GPIO17_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * MON_CTRL                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_MON_CTRL_OFFSET                        (0x027Au)
#define BQ7982X_MON_CTRL_POR_VAL                       (0x31u)

#define BQ7982X_POS_MON_CTRL_SMON_PEAK_RST            (0x07u)
#define BQ7982X_MSK_MON_CTRL_SMON_PEAK_RST            (0x80u)

#define BQ7982X_POS_MON_CTRL_SMON_PEAK_MODE           (0x06u)
#define BQ7982X_MSK_MON_CTRL_SMON_PEAK_MODE           (0x40u)

#define BQ7982X_MON_CTRL_OTCB_MODE_POS                (0x05u)
#define BQ7982X_MON_CTRL_OTCB_MODE_MSK                (0x20u)

#define BQ7982X_MON_CTRL_VCBDONE_MODE_POS            (0x04u)
#define BQ7982X_MON_CTRL_VCBDONE_MODE_MSK            (0x10u)

#define BQ7982X_MON_CTRL_SMON_MODE_POS                (0x03u)
#define BQ7982X_MON_CTRL_SMON_MODE_MSK                (0x08u)

#define BQ7982X_MON_CTRL_OTUT_MODE_POS                (0x02u)
#define BQ7982X_MON_CTRL_OTUT_MODE_MSK                (0x04u)

#define BQ7982X_MON_CTRL_OVUV_MODE_POS                (0x01u)
#define BQ7982X_MON_CTRL_OVUV_MODE_MSK                (0x02u)

#define BQ7982X_MON_CTRL_MON_GO_POS                   (0x00u)
#define BQ7982X_MON_CTRL_MON_GO_MSK                   (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_MON_CTRL                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_MON_CTRL_OFFSET                        (0x027Bu)
#define BQ7982X_DIAG_MON_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_POS_DIAG_MON_CTRL_SMON_MPFLT_INJ           (0x02u)
#define BQ7982X_MSK_DIAG_MON_CTRL_SMON_MPFLT_INJ           (0x04u)

#define BQ7982X_POS_DIAG_MON_CTRL_TMON_MPFLT_INJ           (0x01u)
#define BQ7982X_MSK_DIAG_MON_CTRL_TMON_MPFLT_INJ           (0x02u)

#define BQ7982X_POS_DIAG_MON_CTRL_OVUV_MPFLT_INJ           (0x00u)
#define BQ7982X_MSK_DIAG_MON_CTRL_OVUV_MPFLT_INJ           (0x01u)

/* --------------------------------------------------------------------------
 * BAL_CTRL1                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_CTRL1_OFFSET                        (0x027Cu)
#define BQ7982X_BAL_CTRL1_POR_VAL                       (0x00u)

#define BQ7982X_BAL_CTRL1_PWM5_POS                      (0x05u)
#define BQ7982X_BAL_CTRL1_PWM5_MSK                      (0x20u)

#define BQ7982X_BAL_CTRL1_PWM4_POS                      (0x04u)
#define BQ7982X_BAL_CTRL1_PWM4_MSK                      (0x10u)

#define BQ7982X_BAL_CTRL1_PWM3_POS                      (0x03u)
#define BQ7982X_BAL_CTRL1_PWM3_MSK                      (0x08u)

#define BQ7982X_BAL_CTRL1_PWM2_POS                      (0x02u)
#define BQ7982X_BAL_CTRL1_PWM2_MSK                      (0x04u)

#define BQ7982X_BAL_CTRL1_PWM1_POS                      (0x01u)
#define BQ7982X_BAL_CTRL1_PWM1_MSK                      (0x02u)

