xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_BAL_CTRL1_PWM0_POS                      (0x00u)
#define BQ7982X_BAL_CTRL1_PWM0_MSK                      (0x01u)

#define BQ7982X_BAL_CTRL1_PWM_MSK                       (0x3Fu)
/* --------------------------------------------------------------------------
 * BAL_CTRL2                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_CTRL2_OFFSET                        (0x027Du)
#define BQ7982X_BAL_CTRL2_POR_VAL                       (0x00u)

#define BQ7982X_BAL_CTRL2_CB_PAUSE_POS                  (0x04u)
#define BQ7982X_BAL_CTRL2_CB_PAUSE_MSK                  (0x10u)

#define BQ7982X_BAL_CTRL2_FLTSTOP_EN_POS                (0x03u)
#define BQ7982X_BAL_CTRL2_FLTSTOP_EN_MSK                (0x08u)

#define BQ7982X_BAL_CTRL2_BAL_ACT_POS                   (0x02u)
#define BQ7982X_BAL_CTRL2_BAL_ACT_MSK                   (0x04u)

#define BQ7982X_BAL_CTRL2_AUTO_BAL_POS                  (0x01u)
#define BQ7982X_BAL_CTRL2_AUTO_BAL_MSK                  (0x02u)

#define BQ7982X_BAL_CTRL2_BAL_GO_POS                    (0x00u)
#define BQ7982X_BAL_CTRL2_BAL_GO_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * BAL_CTRL3                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_CTRL3_OFFSET                        (0x027Eu)
#define BQ7982X_BAL_CTRL3_POR_VAL                       (0x00u)

#define BQ7982X_POS_BAL_CTRL3_GLOBAL_TIME_SEL           (0x06u)
#define BQ7982X_MSK_BAL_CTRL3_GLOBAL_TIME_SEL           (0x40u)

#define BQ7982X_POS_BAL_CTRL3_BAL_TIME_SEL             (0x01u)
#define BQ7982X_MSK_BAL_CTRL3_BAL_TIME_SEL             (0x3Eu)

#define BQ7982X_BAL_CTRL3_BAL_TIME_GO_POS               (0x00u)
#define BQ7982X_BAL_CTRL3_BAL_TIME_GO_MSK               (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_BAL_CTRL                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_BAL_CTRL_OFFSET                        (0x027Fu)
#define BQ7982X_DIAG_BAL_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_POS_DIAG_BAL_CTRL_DIAG_BAL_UNFREEZE_GO      (0x01u)
#define BQ7982X_MSK_DIAG_BAL_CTRL_DIAG_BAL_UNFREEZE_GO      (0x02u)

#define BQ7982X_POS_DIAG_BAL_CTRL_DIAG_BAL_GO               (0x00u)
#define BQ7982X_MSK_DIAG_BAL_CTRL_DIAG_BAL_GO               (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_RST1                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_RST1_OFFSET                        (0x0290u)
#define BQ7982X_FAULT_RST1_POR_VAL                       (0x00u)

#define BQ7982X_POS_FAULT_RST1_RST_SYS_SYNC              (0x07u)
#define BQ7982X_MSK_FAULT_RST1_RST_SYS_SYNC              (0x80u)

#define BQ7982X_POS_FAULT_RST1_RST_SYS_INT               (0x06u)
#define BQ7982X_MSK_FAULT_RST1_RST_SYS_INT               (0x40u)

#define BQ7982X_POS_FAULT_RST1_RST_SYS_MON               (0x05u)
#define BQ7982X_MSK_FAULT_RST1_RST_SYS_MON               (0x20u)

#define BQ7982X_POS_FAULT_RST1_RST_SYS_SMON              (0x04u)
#define BQ7982X_MSK_FAULT_RST1_RST_SYS_SMON              (0x10u)

#define BQ7982X_FAULT_RST1_RST_UT_POS                    (0x03u)
#define BQ7982X_FAULT_RST1_RST_UT_MSK                    (0x08u)

#define BQ7982X_FAULT_RST1_RST_OT_POS                    (0x02u)
#define BQ7982X_FAULT_RST1_RST_OT_MSK                    (0x04u)

#define BQ7982X_FAULT_RST1_RST_UV_POS                    (0x01u)
#define BQ7982X_FAULT_RST1_RST_UV_MSK                    (0x02u)

#define BQ7982X_FAULT_RST1_RST_OV_POS                    (0x00u)
#define BQ7982X_FAULT_RST1_RST_OV_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_RST2                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_RST2_OFFSET                        (0x0291u)
#define BQ7982X_FAULT_RST2_POR_VAL                       (0x00u)

#define BQ7982X_FAULT_RST2_RST_PWR_POS                   (0x07u)
#define BQ7982X_FAULT_RST2_RST_PWR_MSK                   (0x80u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_FRAME           (0x06u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_FRAME           (0x40u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_FT              (0x05u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_FT              (0x20u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_HB              (0x04u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_HB              (0x10u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_DSY             (0x03u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_DSY             (0x08u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_PSPI            (0x02u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_PSPI            (0x04u)

#define BQ7982X_POS_FAULT_RST2_RST_COMM_BUSY            (0x01u)
#define BQ7982X_MSK_FAULT_RST2_RST_COMM_BUSY            (0x02u)

#define BQ7982X_POS_FAULT_RST2_RST_SYS_MISC             (0x00u)
#define BQ7982X_MSK_FAULT_RST2_RST_SYS_MISC             (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_RST3                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_RST3_OFFSET                        (0x0292u)
#define BQ7982X_FAULT_RST3_POR_VAL                       (0x00u)

#define BQ7982X_POS_FAULT_RST3_RST_SYS_EIS              (0x04u)
#define BQ7982X_MSK_FAULT_RST3_RST_SYS_EIS              (0x10u)

#define BQ7982X_FAULT_RST3_RST_CB_POS                   (0x03u)
#define BQ7982X_FAULT_RST3_RST_CB_MSK                   (0x08u)

#define BQ7982X_FAULT_RST3_RST_ADC_POS                  (0x02u)
#define BQ7982X_FAULT_RST3_RST_ADC_MSK                  (0x04u)

#define BQ7982X_POS_FAULT_RST3_RST_MEM_CRC              (0x01u)
#define BQ7982X_MSK_FAULT_RST3_RST_MEM_CRC              (0x02u)

