xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_FAULT_RST3_RST_MEM_DATA             (0x00u)
#define BQ7982X_MSK_FAULT_RST3_RST_MEM_DATA             (0x01u)

/* --------------------------------------------------------------------------
 * OTP_ECC_TEST                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_ECC_TEST_OFFSET                        (0x0298u)
#define BQ7982X_OTP_ECC_TEST_POR_VAL                       (0x00u)


#define BQ7982X_OTP_ECC_TEST_DED_SEC_POS                   (0x02u)
#define BQ7982X_OTP_ECC_TEST_DED_SEC_MSK                   (0x04u)

#define BQ7982X_OTP_ECC_TEST_ENC_DEC_POS                   (0x01u)
#define BQ7982X_OTP_ECC_TEST_ENC_DEC_MSK                   (0x02u)

#define BQ7982X_OTP_ECC_TEST_ENABLE_POS                    (0x00u)
#define BQ7982X_OTP_ECC_TEST_ENABLE_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * I2C_WR_DATA                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_I2C_WR_DATA_OFFSET                        (0x02A0u)
#define BQ7982X_I2C_WR_DATA_POR_VAL                       (0x00u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_7                (0x07u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_7                (0x80u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_6                (0x06u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_6                (0x40u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_5                (0x05u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_5                (0x20u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_4                (0x04u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_4                (0x10u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_3                (0x03u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_3                (0x08u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_2                (0x02u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_2                (0x04u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_1                (0x01u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_1                (0x02u)

#define BQ7982X_POS_I2C_WR_DATA_DATA_BIT_0                (0x00u)
#define BQ7982X_MSK_I2C_WR_DATA_DATA_BIT_0                (0x01u)

/* --------------------------------------------------------------------------
 * I2C_CTRL                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_I2C_CTRL_OFFSET                        (0x02A1u)
#define BQ7982X_I2C_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_I2C_CTRL_RSVD_BIT_7_POS                (0x07u)
#define BQ7982X_I2C_CTRL_RSVD_BIT_7_MSK                (0x80u)

#define BQ7982X_I2C_CTRL_RSVD_BIT_6_POS                (0x06u)
#define BQ7982X_I2C_CTRL_RSVD_BIT_6_MSK                (0x40u)

#define BQ7982X_I2C_CTRL_SEND_POS                      (0x05u)
#define BQ7982X_I2C_CTRL_SEND_MSK                      (0x20u)

#define BQ7982X_I2C_CTRL_RECEIVE_POS                   (0x04u)
#define BQ7982X_I2C_CTRL_RECEIVE_MSK                   (0x10u)

#define BQ7982X_I2C_CTRL_START_POS                     (0x03u)
#define BQ7982X_I2C_CTRL_START_MSK                     (0x08u)

#define BQ7982X_I2C_CTRL_STOP_POS                      (0x02u)
#define BQ7982X_I2C_CTRL_STOP_MSK                      (0x04u)

#define BQ7982X_I2C_CTRL_NACK_POS                      (0x01u)
#define BQ7982X_I2C_CTRL_NACK_MSK                      (0x02u)

#define BQ7982X_I2C_CTRL_I2C_GO_POS                    (0x00u)
#define BQ7982X_I2C_CTRL_I2C_GO_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_CTRL                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_CTRL_OFFSET                        (0x02B0u)
#define BQ7982X_CSPI_CTRL_POR_VAL                       (0x00u)

#define BQ7982X_CSPI_CTRL_CPOL_POS                      (0x06u)
#define BQ7982X_CSPI_CTRL_CPOL_MSK                      (0x40u)

#define BQ7982X_CSPI_CTRL_CPHA_POS                      (0x05u)
#define BQ7982X_CSPI_CTRL_CPHA_MSK                      (0x20u)

#define BQ7982X_POS_CSPI_CTRL_NUMBIT_BIT_4              (0x04u)
#define BQ7982X_MSK_CSPI_CTRL_NUMBIT_BIT_4              (0x10u)

#define BQ7982X_POS_CSPI_CTRL_NUMBIT_BIT_3              (0x03u)
#define BQ7982X_MSK_CSPI_CTRL_NUMBIT_BIT_3              (0x08u)

#define BQ7982X_POS_CSPI_CTRL_NUMBIT_BIT_2              (0x02u)
#define BQ7982X_MSK_CSPI_CTRL_NUMBIT_BIT_2              (0x04u)

#define BQ7982X_POS_CSPI_CTRL_NUMBIT_BIT_1              (0x01u)
#define BQ7982X_MSK_CSPI_CTRL_NUMBIT_BIT_1              (0x02u)

#define BQ7982X_POS_CSPI_CTRL_NUMBIT_BIT_0              (0x00u)
#define BQ7982X_MSK_CSPI_CTRL_NUMBIT_BIT_0              (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_TX4                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_TX4_OFFSET                         (0x02B1u)
#define BQ7982X_CSPI_TX4_POR_VAL                        (0x00u)

#define BQ7982X_CSPI_TX4_DATA_BIT_7_POS                 (0x07u)
#define BQ7982X_CSPI_TX4_DATA_BIT_7_MSK                 (0x80u)

#define BQ7982X_CSPI_TX4_DATA_BIT_6_POS                 (0x06u)
#define BQ7982X_CSPI_TX4_DATA_BIT_6_MSK                 (0x40u)

#define BQ7982X_CSPI_TX4_DATA_BIT_5_POS                 (0x05u)
#define BQ7982X_CSPI_TX4_DATA_BIT_5_MSK                 (0x20u)

#define BQ7982X_CSPI_TX4_DATA_BIT_4_POS                 (0x04u)
#define BQ7982X_CSPI_TX4_DATA_BIT_4_MSK                 (0x10u)

#define BQ7982X_CSPI_TX4_DATA_BIT_3_POS                 (0x03u)
#define BQ7982X_CSPI_TX4_DATA_BIT_3_MSK                 (0x08u)

#define BQ7982X_CSPI_TX4_DATA_BIT_2_POS                 (0x02u)
#define BQ7982X_CSPI_TX4_DATA_BIT_2_MSK                 (0x04u)

#define BQ7982X_CSPI_TX4_DATA_BIT_1_POS                 (0x01u)
#define BQ7982X_CSPI_TX4_DATA_BIT_1_MSK                 (0x02u)

