xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_CSPI_TX4_DATA_BIT_0_POS                 (0x00u)
#define BQ7982X_CSPI_TX4_DATA_BIT_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_TX3                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_TX3_OFFSET                         (0x02B2u)
#define BQ7982X_CSPI_TX3_POR_VAL                        (0x00u)

#define BQ7982X_CSPI_TX3_DATA_BIT_7_POS                 (0x07u)
#define BQ7982X_CSPI_TX3_DATA_BIT_7_MSK                 (0x80u)

#define BQ7982X_CSPI_TX3_DATA_BIT_6_POS                 (0x06u)
#define BQ7982X_CSPI_TX3_DATA_BIT_6_MSK                 (0x40u)

#define BQ7982X_CSPI_TX3_DATA_BIT_5_POS                 (0x05u)
#define BQ7982X_CSPI_TX3_DATA_BIT_5_MSK                 (0x20u)

#define BQ7982X_CSPI_TX3_DATA_BIT_4_POS                 (0x04u)
#define BQ7982X_CSPI_TX3_DATA_BIT_4_MSK                 (0x10u)

#define BQ7982X_CSPI_TX3_DATA_BIT_3_POS                 (0x03u)
#define BQ7982X_CSPI_TX3_DATA_BIT_3_MSK                 (0x08u)

#define BQ7982X_CSPI_TX3_DATA_BIT_2_POS                 (0x02u)
#define BQ7982X_CSPI_TX3_DATA_BIT_2_MSK                 (0x04u)

#define BQ7982X_CSPI_TX3_DATA_BIT_1_POS                 (0x01u)
#define BQ7982X_CSPI_TX3_DATA_BIT_1_MSK                 (0x02u)

#define BQ7982X_CSPI_TX3_DATA_BIT_0_POS                 (0x00u)
#define BQ7982X_CSPI_TX3_DATA_BIT_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_TX2                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_TX2_OFFSET                         (0x02B3u)
#define BQ7982X_CSPI_TX2_POR_VAL                        (0x00u)

#define BQ7982X_CSPI_TX2_DATA_BIT_7_POS                 (0x07u)
#define BQ7982X_CSPI_TX2_DATA_BIT_7_MSK                 (0x80u)

#define BQ7982X_CSPI_TX2_DATA_BIT_6_POS                 (0x06u)
#define BQ7982X_CSPI_TX2_DATA_BIT_6_MSK                 (0x40u)

#define BQ7982X_CSPI_TX2_DATA_BIT_5_POS                 (0x05u)
#define BQ7982X_CSPI_TX2_DATA_BIT_5_MSK                 (0x20u)

#define BQ7982X_CSPI_TX2_DATA_BIT_4_POS                 (0x04u)
#define BQ7982X_CSPI_TX2_DATA_BIT_4_MSK                 (0x10u)

#define BQ7982X_CSPI_TX2_DATA_BIT_3_POS                 (0x03u)
#define BQ7982X_CSPI_TX2_DATA_BIT_3_MSK                 (0x08u)

#define BQ7982X_CSPI_TX2_DATA_BIT_2_POS                 (0x02u)
#define BQ7982X_CSPI_TX2_DATA_BIT_2_MSK                 (0x04u)

#define BQ7982X_CSPI_TX2_DATA_BIT_1_POS                 (0x01u)
#define BQ7982X_CSPI_TX2_DATA_BIT_1_MSK                 (0x02u)

#define BQ7982X_CSPI_TX2_DATA_BIT_0_POS                 (0x00u)
#define BQ7982X_CSPI_TX2_DATA_BIT_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_TX1                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_TX1_OFFSET                         (0x02B4u)
#define BQ7982X_CSPI_TX1_POR_VAL                        (0x00u)

#define BQ7982X_CSPI_TX1_DATA_BIT_7_POS                 (0x07u)
#define BQ7982X_CSPI_TX1_DATA_BIT_7_MSK                 (0x80u)

#define BQ7982X_CSPI_TX1_DATA_BIT_6_POS                 (0x06u)
#define BQ7982X_CSPI_TX1_DATA_BIT_6_MSK                 (0x40u)

#define BQ7982X_CSPI_TX1_DATA_BIT_5_POS                 (0x05u)
#define BQ7982X_CSPI_TX1_DATA_BIT_5_MSK                 (0x20u)

#define BQ7982X_CSPI_TX1_DATA_BIT_4_POS                 (0x04u)
#define BQ7982X_CSPI_TX1_DATA_BIT_4_MSK                 (0x10u)

#define BQ7982X_CSPI_TX1_DATA_BIT_3_POS                 (0x03u)
#define BQ7982X_CSPI_TX1_DATA_BIT_3_MSK                 (0x08u)

#define BQ7982X_CSPI_TX1_DATA_BIT_2_POS                 (0x02u)
#define BQ7982X_CSPI_TX1_DATA_BIT_2_MSK                 (0x04u)

#define BQ7982X_CSPI_TX1_DATA_BIT_1_POS                 (0x01u)
#define BQ7982X_CSPI_TX1_DATA_BIT_1_MSK                 (0x02u)

#define BQ7982X_CSPI_TX1_DATA_BIT_0_POS                 (0x00u)
#define BQ7982X_CSPI_TX1_DATA_BIT_0_MSK                 (0x01u)

/* --------------------------------------------------------------------------
 * CSPI_EXE                (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_EXE_OFFSET                         (0x02B5u)
#define BQ7982X_CSPI_EXE_POR_VAL                        (0x02u)


#define BQ7982X_POS_CSPI_EXE_CCS_ADDR_BIT_2             (0x05u)
#define BQ7982X_MSK_CSPI_EXE_CCS_ADDR_BIT_2             (0x20u)

#define BQ7982X_POS_CSPI_EXE_CCS_ADDR_BIT_1             (0x04u)
#define BQ7982X_MSK_CSPI_EXE_CCS_ADDR_BIT_1             (0x10u)

#define BQ7982X_POS_CSPI_EXE_CCS_ADDR_BIT_0             (0x03u)
#define BQ7982X_MSK_CSPI_EXE_CCS_ADDR_BIT_0             (0x08u)

#define BQ7982X_POS_CSPI_EXE_CCS_CTRL_BIT_1             (0x02u)
#define BQ7982X_MSK_CSPI_EXE_CCS_CTRL_BIT_1             (0x04u)

#define BQ7982X_POS_CSPI_EXE_CCS_CTRL_BIT_0             (0x01u)
#define BQ7982X_MSK_CSPI_EXE_CCS_CTRL_BIT_0             (0x02u)

#define BQ7982X_CSPI_EXE_CSPI_GO_POS                    (0x00u)
#define BQ7982X_CSPI_EXE_CSPI_GO_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_OUT1                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_OUT1_OFFSET                        (0x02C0u)
#define BQ7982X_GPIO_OUT1_POR_VAL                       (0x00u)

#define BQ7982X_GPIO_OUT1_GPIO8_POS                     (0x07u)
#define BQ7982X_GPIO_OUT1_GPIO8_MSK                     (0x80u)

#define BQ7982X_GPIO_OUT1_GPIO7_POS                     (0x06u)
#define BQ7982X_GPIO_OUT1_GPIO7_MSK                     (0x40u)

#define BQ7982X_GPIO_OUT1_GPIO6_POS                     (0x05u)
#define BQ7982X_GPIO_OUT1_GPIO6_MSK                     (0x20u)

#define BQ7982X_GPIO_OUT1_GPIO5_POS                     (0x04u)
#define BQ7982X_GPIO_OUT1_GPIO5_MSK                     (0x10u)

#define BQ7982X_GPIO_OUT1_GPIO4_POS                     (0x03u)
#define BQ7982X_GPIO_OUT1_GPIO4_MSK                     (0x08u)

#define BQ7982X_GPIO_OUT1_GPIO3_POS                     (0x02u)
#define BQ7982X_GPIO_OUT1_GPIO3_MSK                     (0x04u)

#define BQ7982X_GPIO_OUT1_GPIO2_POS                     (0x01u)
#define BQ7982X_GPIO_OUT1_GPIO2_MSK                     (0x02u)

#define BQ7982X_GPIO_OUT1_GPIO1_POS                     (0x00u)
#define BQ7982X_GPIO_OUT1_GPIO1_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_OUT2                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_OUT2_OFFSET                        (0x02C1u)
#define BQ7982X_GPIO_OUT2_POR_VAL                       (0x00u)

