xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_GPIO_OUT2_GPIO16_POS                    (0x07u)
#define BQ7982X_GPIO_OUT2_GPIO16_MSK                    (0x80u)

#define BQ7982X_GPIO_OUT2_GPIO15_POS                    (0x06u)
#define BQ7982X_GPIO_OUT2_GPIO15_MSK                    (0x40u)

#define BQ7982X_GPIO_OUT2_GPIO14_POS                    (0x05u)
#define BQ7982X_GPIO_OUT2_GPIO14_MSK                    (0x20u)

#define BQ7982X_GPIO_OUT2_GPIO13_POS                    (0x04u)
#define BQ7982X_GPIO_OUT2_GPIO13_MSK                    (0x10u)

#define BQ7982X_GPIO_OUT2_GPIO12_POS                    (0x03u)
#define BQ7982X_GPIO_OUT2_GPIO12_MSK                    (0x08u)

#define BQ7982X_GPIO_OUT2_GPIO11_POS                    (0x02u)
#define BQ7982X_GPIO_OUT2_GPIO11_MSK                    (0x04u)

#define BQ7982X_GPIO_OUT2_GPIO10_POS                    (0x01u)
#define BQ7982X_GPIO_OUT2_GPIO10_MSK                    (0x02u)

#define BQ7982X_GPIO_OUT2_GPIO9_POS                     (0x00u)
#define BQ7982X_GPIO_OUT2_GPIO9_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_OUT3                (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_OUT3_OFFSET                        (0x02C2u)
#define BQ7982X_GPIO_OUT3_POR_VAL                       (0x00u)

#define BQ7982X_GPIO_OUT3_GPIO20_POS                    (0x03u)
#define BQ7982X_GPIO_OUT3_GPIO20_MSK                    (0x08u)

#define BQ7982X_GPIO_OUT3_GPIO19_POS                    (0x02u)
#define BQ7982X_GPIO_OUT3_GPIO19_MSK                    (0x04u)

#define BQ7982X_GPIO_OUT3_GPIO18_POS                    (0x01u)
#define BQ7982X_GPIO_OUT3_GPIO18_MSK                    (0x02u)

#define BQ7982X_GPIO_OUT3_GPIO17_POS                    (0x00u)
#define BQ7982X_GPIO_OUT3_GPIO17_MSK                    (0x01u)

/* --------------------------------------------------------------------------
 * EIS_DISABLE1            (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DISABLE1_OFFSET                    (0x0500u)
#define BQ7982X_EIS_DISABLE1_POR_VAL                   (0x00u)

#define BQ7982X_EIS_DISABLE1_CELL_8_POS                     (0x07u)
#define BQ7982X_EIS_DISABLE1_CELL_8_MSK                     (0x80u)

#define BQ7982X_EIS_DISABLE1_CELL_7_POS                     (0x06u)
#define BQ7982X_EIS_DISABLE1_CELL_7_MSK                     (0x40u)

#define BQ7982X_EIS_DISABLE1_CELL_6_POS                     (0x05u)
#define BQ7982X_EIS_DISABLE1_CELL_6_MSK                     (0x20u)

#define BQ7982X_EIS_DISABLE1_CELL_5_POS                     (0x04u)
#define BQ7982X_EIS_DISABLE1_CELL_5_MSK                     (0x10u)

#define BQ7982X_EIS_DISABLE1_CELL_4_POS                     (0x03u)
#define BQ7982X_EIS_DISABLE1_CELL_4_MSK                     (0x08u)

#define BQ7982X_EIS_DISABLE1_CELL_3_POS                     (0x02u)
#define BQ7982X_EIS_DISABLE1_CELL_3_MSK                     (0x04u)

#define BQ7982X_EIS_DISABLE1_CELL_2_POS                     (0x01u)
#define BQ7982X_EIS_DISABLE1_CELL_2_MSK                     (0x02u)

#define BQ7982X_EIS_DISABLE1_CELL_1_POS                     (0x00u)
#define BQ7982X_EIS_DISABLE1_CELL_1_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * EIS_DISABLE2            (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DISABLE2_OFFSET                    (0x0501u)
#define BQ7982X_EIS_DISABLE2_POR_VAL                   (0x00u)

#define BQ7982X_EIS_DISABLE2_CELL_16_POS                     (0x07u)
#define BQ7982X_EIS_DISABLE2_CELL_16_MSK                     (0x80u)

#define BQ7982X_EIS_DISABLE2_CELL_15_POS                     (0x06u)
#define BQ7982X_EIS_DISABLE2_CELL_15_MSK                     (0x40u)

#define BQ7982X_EIS_DISABLE2_CELL_14_POS                     (0x05u)
#define BQ7982X_EIS_DISABLE2_CELL_14_MSK                     (0x20u)

#define BQ7982X_EIS_DISABLE2_CELL_13_POS                     (0x04u)
#define BQ7982X_EIS_DISABLE2_CELL_13_MSK                     (0x10u)

#define BQ7982X_EIS_DISABLE2_CELL_12_POS                     (0x03u)
#define BQ7982X_EIS_DISABLE2_CELL_12_MSK                     (0x08u)

#define BQ7982X_EIS_DISABLE2_CELL_11_POS                     (0x02u)
#define BQ7982X_EIS_DISABLE2_CELL_11_MSK                     (0x04u)

#define BQ7982X_EIS_DISABLE2_CELL_10_POS                     (0x01u)
#define BQ7982X_EIS_DISABLE2_CELL_10_MSK                     (0x02u)

#define BQ7982X_EIS_DISABLE2_CELL_9_POS                     (0x00u)
#define BQ7982X_EIS_DISABLE2_CELL_9_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * EIS_DISABLE3            (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DISABLE3_OFFSET                    (0x0502u)
#define BQ7982X_EIS_DISABLE3_POR_VAL                   (0x00u)

#define BQ7982X_EIS_DISABLE3_CELL_24_POS                     (0x07u)
#define BQ7982X_EIS_DISABLE3_CELL_24_MSK                     (0x80u)

#define BQ7982X_EIS_DISABLE3_CELL_23_POS                     (0x06u)
#define BQ7982X_EIS_DISABLE3_CELL_23_MSK                     (0x40u)

#define BQ7982X_EIS_DISABLE3_CELL_22_POS                     (0x05u)
#define BQ7982X_EIS_DISABLE3_CELL_22_MSK                     (0x20u)

#define BQ7982X_EIS_DISABLE3_CELL_21_POS                     (0x04u)
#define BQ7982X_EIS_DISABLE3_CELL_21_MSK                     (0x10u)

#define BQ7982X_EIS_DISABLE3_CELL_20_POS                     (0x03u)
#define BQ7982X_EIS_DISABLE3_CELL_20_MSK                     (0x08u)

#define BQ7982X_EIS_DISABLE3_CELL_19_POS                     (0x02u)
#define BQ7982X_EIS_DISABLE3_CELL_19_MSK                     (0x04u)

#define BQ7982X_EIS_DISABLE3_CELL_18_POS                     (0x01u)
#define BQ7982X_EIS_DISABLE3_CELL_18_MSK                     (0x02u)

#define BQ7982X_EIS_DISABLE3_CELL_17_POS                     (0x00u)
#define BQ7982X_EIS_DISABLE3_CELL_17_MSK                     (0x01u)
/* --------------------------------------------------------------------------
 * EIS_DISABLE4            (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DISABLE4_OFFSET                    (0x0503u)
#define BQ7982X_EIS_DISABLE4_POR_VAL                   (0x00u)

#define BQ7982X_EIS_DISABLE3_CELL_26_POS                     (0x01u)
#define BQ7982X_EIS_DISABLE3_CELL_26_MSK                     (0x02u)

#define BQ7982X_EIS_DISABLE3_CELL_25_POS                     (0x00u)
#define BQ7982X_EIS_DISABLE3_CELL_25_MSK                     (0x01u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL1_OFFSET                   (0x0510u)
#define BQ7982X_EIS_COM_CTRL1_POR_VAL                  (0x00u)

#define BQ7982X_EIS_COM_CTRL1_CS_MODE_POS              (0x03u)
#define BQ7982X_EIS_COM_CTRL1_CS_MODE_MSK              (0x08u)

#define BQ7982X_POS_EIS_COM_CTRL1_NUM_TONES            (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL1_NUM_TONES            (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL2_OFFSET                   (0x0511u)
#define BQ7982X_EIS_COM_CTRL2_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL2_DFT_LENH             (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL2_DFT_LENH             (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL3           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL3_OFFSET                   (0x0512u)
#define BQ7982X_EIS_COM_CTRL3_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL3_DFT_LENM             (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL3_DFT_LENM             (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL4           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL4_OFFSET                   (0x0513u)
#define BQ7982X_EIS_COM_CTRL4_POR_VAL                  (0x00u)

