xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_EIS_COM_CTRL4_DFT_LENL             (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL4_DFT_LENL             (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL5           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL5_OFFSET                   (0x0514u)
#define BQ7982X_EIS_COM_CTRL5_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL5_FREQ_IDX1H           (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL5_FREQ_IDX1H           (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL6           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL6_OFFSET                   (0x0515u)
#define BQ7982X_EIS_COM_CTRL6_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL6_FREQ_IDX1M           (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL6_FREQ_IDX1M           (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL7           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL7_OFFSET                   (0x0516u)
#define BQ7982X_EIS_COM_CTRL7_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL7_FREQ_IDX1L           (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL7_FREQ_IDX1L           (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL8           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL8_OFFSET                   (0x0517u)
#define BQ7982X_EIS_COM_CTRL8_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL8_FREQ_IDX2H           (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL8_FREQ_IDX2H           (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL9           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL9_OFFSET                   (0x0518u)
#define BQ7982X_EIS_COM_CTRL9_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL9_FREQ_IDX2M           (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL9_FREQ_IDX2M           (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL10           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL10_OFFSET                  (0x0519u)
#define BQ7982X_EIS_COM_CTRL10_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL10_FREQ_IDX2L          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL10_FREQ_IDX2L          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL11           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL11_OFFSET                  (0x051Au)
#define BQ7982X_EIS_COM_CTRL11_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL11_FREQ_IDX3H          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL11_FREQ_IDX3H          (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL12           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL12_OFFSET                  (0x051Bu)
#define BQ7982X_EIS_COM_CTRL12_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL12_FREQ_IDX3M          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL12_FREQ_IDX3M          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL13           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL13_OFFSET                  (0x051Cu)
#define BQ7982X_EIS_COM_CTRL13_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL13_FREQ_IDX3L          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL13_FREQ_IDX3L          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL14           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL14_OFFSET                  (0x051Du)
#define BQ7982X_EIS_COM_CTRL14_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL14_FREQ_IDX4H          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL14_FREQ_IDX4H          (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL15           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL15_OFFSET                  (0x051Eu)
#define BQ7982X_EIS_COM_CTRL15_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL15_FREQ_IDX4M          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL15_FREQ_IDX4M          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL16           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL16_OFFSET                  (0x051Fu)
#define BQ7982X_EIS_COM_CTRL16_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL16_FREQ_IDX4L          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL16_FREQ_IDX4L          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL17           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL17_OFFSET                  (0x0520u)
#define BQ7982X_EIS_COM_CTRL17_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_COM_CTRL17_FREQ_IDX5H          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL17_FREQ_IDX5H          (0x07u)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL18           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL18_OFFSET                  (0x0521u)
#define BQ7982X_EIS_COM_CTRL18_POR_VAL                 (0x00u)

