xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_EIS_COM_CTRL18_FREQ_IDX5M          (0x00u)
#define BQ7982X_MSK_EIS_COM_CTRL18_FREQ_IDX5M          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_COM_CTRL19           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_COM_CTRL19_OFFSET                  (0x0522u)
#define BQ7982X_EIS_COM_CTRL19_POR_VAL                 (0x00u)

#define BQ7982X_EIS_COM_CTRL19_FREQ_IDX5L_POS          (0x00u)
#define BQ7982X_EIS_COM_CTRL19_FREQ_IDX5L_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL1_OFFSET                   (0x0540u)
#define BQ7982X_EIS_DFE_CTRL1_POR_VAL                  (0x00u)

#define BQ7982X_EIS_DFE_CTRL1_VC_AMPH_POS              (0x00u)
#define BQ7982X_EIS_DFE_CTRL1_VC_AMPH_MSK              (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL2_OFFSET                   (0x0541u)
#define BQ7982X_EIS_DFE_CTRL2_POR_VAL                  (0x00u)

#define BQ7982X_EIS_DFE_CTRL2_VC_AMPL_POS              (0x00u)
#define BQ7982X_EIS_DFE_CTRL2_VC_AMPL_MSK              (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL3           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL3_OFFSET                   (0x0542u)
#define BQ7982X_EIS_DFE_CTRL3_POR_VAL                  (0x00u)

#define BQ7982X_EIS_DFE_CTRL3_CS_AMPH_POS              (0x00u)
#define BQ7982X_EIS_DFE_CTRL3_CS_AMPH_MSK              (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL4           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL4_OFFSET                   (0x0543u)
#define BQ7982X_EIS_DFE_CTRL4_POR_VAL                  (0x00u)

#define BQ7982X_EIS_DFE_CTRL4_CS_AMPL_POS              (0x00u)
#define BQ7982X_EIS_DFE_CTRL4_CS_AMPL_MSK              (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL5           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL5_OFFSET                   (0x0544u)
#define BQ7982X_EIS_DFE_CTRL5_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL5_HPF_COEFH            (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL5_HPF_COEFH            (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL6           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL6_OFFSET                   (0x0545u)
#define BQ7982X_EIS_DFE_CTRL6_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL6_HPF_COEFM            (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL6_HPF_COEFM            (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL7           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL7_OFFSET                   (0x0546u)
#define BQ7982X_EIS_DFE_CTRL7_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL7_HPF_COEFL            (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL7_HPF_COEFL            (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL8           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL8_OFFSET                   (0x0547u)
#define BQ7982X_EIS_DFE_CTRL8_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL8_VC_DCC_SCALEH        (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL8_VC_DCC_SCALEH        (0x1Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL9           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL9_OFFSET                   (0x0548u)
#define BQ7982X_EIS_DFE_CTRL9_POR_VAL                  (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL9_VC_DCC_SCALEM        (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL9_VC_DCC_SCALEM        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL10           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL10_OFFSET                  (0x0549u)
#define BQ7982X_EIS_DFE_CTRL10_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL10_VC_DCC_SCALEL       (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL10_VC_DCC_SCALEL       (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL11           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL11_OFFSET                  (0x054Au)
#define BQ7982X_EIS_DFE_CTRL11_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL11_VC_DCC_LPFH         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL11_VC_DCC_LPFH         (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL12           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL12_OFFSET                  (0x054Bu)
#define BQ7982X_EIS_DFE_CTRL12_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL12_VC_DCC_LPFM         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL12_VC_DCC_LPFM         (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL13           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL13_OFFSET                  (0x054Cu)
#define BQ7982X_EIS_DFE_CTRL13_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL13_VC_DCC_LPFL         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL13_VC_DCC_LPFL         (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL14           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL14_OFFSET                  (0x054Du)
#define BQ7982X_EIS_DFE_CTRL14_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL14_VC_DCC_DCH          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL14_VC_DCC_DCH          (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL15           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL15_OFFSET                  (0x054Eu)
#define BQ7982X_EIS_DFE_CTRL15_POR_VAL                 (0x00u)

