xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_EIS_DFE_CTRL15_VC_DCC_DCM          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL15_VC_DCC_DCM          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL16           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL16_OFFSET                  (0x054Fu)
#define BQ7982X_EIS_DFE_CTRL16_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL16_VC_DCC_DCL          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL16_VC_DCC_DCL          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL17           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL17_OFFSET                  (0x0550u)
#define BQ7982X_EIS_DFE_CTRL17_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL17_CS_DCC_SCALEH       (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL17_CS_DCC_SCALEH       (0x1Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL18           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL18_OFFSET                  (0x0551u)
#define BQ7982X_EIS_DFE_CTRL18_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL18_CS_DCC_SCALEM       (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL18_CS_DCC_SCALEM       (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL19           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL19_OFFSET                  (0x0552u)
#define BQ7982X_EIS_DFE_CTRL19_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL19_CS_DCC_SCALEL       (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL19_CS_DCC_SCALEL       (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL20           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL20_OFFSET                  (0x0553u)
#define BQ7982X_EIS_DFE_CTRL20_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL20_CS_DCC_LPFH         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL20_CS_DCC_LPFH         (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL21           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL21_OFFSET                  (0x0554u)
#define BQ7982X_EIS_DFE_CTRL21_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL21_CS_DCC_LPFM         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL21_CS_DCC_LPFM         (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL22           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL22_OFFSET                  (0x0555u)
#define BQ7982X_EIS_DFE_CTRL22_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL22_CS_DCC_LPFL         (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL22_CS_DCC_LPFL         (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL23           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL23_OFFSET                  (0x0556u)
#define BQ7982X_EIS_DFE_CTRL23_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL23_CS_DCC_DCH          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL23_CS_DCC_DCH          (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL24           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL24_OFFSET                  (0x0557u)
#define BQ7982X_EIS_DFE_CTRL24_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL24_CS_DCC_DCM          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL24_CS_DCC_DCM          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL25           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL25_OFFSET                  (0x0558u)
#define BQ7982X_EIS_DFE_CTRL25_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL25_CS_DCC_DCL          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL25_CS_DCC_DCL          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFE_CTRL26           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFE_CTRL26_OFFSET                  (0x0559u)
#define BQ7982X_EIS_DFE_CTRL26_POR_VAL                 (0x00u)

#define BQ7982X_POS_EIS_DFE_CTRL26_HPF_MODE            (0x07u)
#define BQ7982X_MSK_EIS_DFE_CTRL26_HPF_MODE            (0x80u)

#define BQ7982X_POS_EIS_DFE_CTRL26_EIS_DSR             (0x03u)
#define BQ7982X_MSK_EIS_DFE_CTRL26_EIS_DSR             (0x78u)

#define BQ7982X_POS_EIS_DFE_CTRL26_EIS_DFE_MODE        (0x01u)
#define BQ7982X_MSK_EIS_DFE_CTRL26_EIS_DFE_MODE        (0x06u)

#define BQ7982X_POS_EIS_DFE_CTRL26_EIS_DFE_GO          (0x00u)
#define BQ7982X_MSK_EIS_DFE_CTRL26_EIS_DFE_GO          (0x01u)

/* --------------------------------------------------------------------------
 * EIS_DFT_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */

#define BQ7982X_EIS_DFT_CTRL1_OFFSET            (0x0570u)
#define BQ7982X_EIS_DFT_CTRL1_POR_VAL           (0x00u)

#define BQ7982X_EIS_DFT_CTRL1_PHASEH_POS        (0x00u)
#define BQ7982X_EIS_DFT_CTRL1_PHASEH_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFT_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFT_CTRL2_OFFSET            (0x0571u)
#define BQ7982X_EIS_DFT_CTRL2_POR_VAL           (0x00u)

#define BQ7982X_EIS_DFT_CTRL2_PHASEM_POS        (0x00u)
#define BQ7982X_EIS_DFT_CTRL2_PHASEM_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFT_CTRL3           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFT_CTRL3_OFFSET            (0x0572u)
#define BQ7982X_EIS_DFT_CTRL3_POR_VAL           (0x00u)

