xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_EIS_DFT_CTRL3_PHASEL_POS        (0x00u)
#define BQ7982X_EIS_DFT_CTRL3_PHASEL_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_DFT_CTRL4           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_DFT_CTRL4_OFFSET            (0x0573u)
#define BQ7982X_EIS_DFT_CTRL4_POR_VAL           (0x00u)

#define BQ7982X_POS_EIS_DFT_CTRL4_WINDOW_DIS    (0x04u)
#define BQ7982X_MSK_EIS_DFT_CTRL4_WINDOW_DIS    (0x10u)

#define BQ7982X_POS_EIS_DFT_CTRL4_PHASE_MODE    (0x03u)
#define BQ7982X_MSK_EIS_DFT_CTRL4_PHASE_MODE    (0x08u)

#define BQ7982X_POS_EIS_DFT_CTRL4_EIS_DFT_MODE  (0x01u)
#define BQ7982X_MSK_EIS_DFT_CTRL4_EIS_DFT_MODE  (0x06u)

#define BQ7982X_POS_EIS_DFT_CTRL4_EIS_DFT_GO    (0x00u)
#define BQ7982X_MSK_EIS_DFT_CTRL4_EIS_DFT_GO    (0x01u)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */

#define BQ7982X_EIS_PWM_CTRL1_OFFSET            (0x0580u)
#define BQ7982X_EIS_PWM_CTRL1_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL1_AMP1_POS          (0x00u)
#define BQ7982X_EIS_PWM_CTRL1_AMP1_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL2_OFFSET            (0x0581u)
#define BQ7982X_EIS_PWM_CTRL2_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL2_AMP2_POS          (0x00u)
#define BQ7982X_EIS_PWM_CTRL2_AMP2_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL3           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL3_OFFSET            (0x0582u)
#define BQ7982X_EIS_PWM_CTRL3_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL3_AMP3_POS          (0x00u)
#define BQ7982X_EIS_PWM_CTRL3_AMP3_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL4           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL4_OFFSET            (0x0583u)
#define BQ7982X_EIS_PWM_CTRL4_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL4_AMP4_POS          (0x00u)
#define BQ7982X_EIS_PWM_CTRL4_AMP4_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL5           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL5_OFFSET            (0x0584u)
#define BQ7982X_EIS_PWM_CTRL5_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL5_AMP5_POS          (0x00u)
#define BQ7982X_EIS_PWM_CTRL5_AMP5_MSK          (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL6           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL6_OFFSET            (0x0585u)
#define BQ7982X_EIS_PWM_CTRL6_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL6_PHASE1_POS        (0x00u)
#define BQ7982X_EIS_PWM_CTRL6_PHASE1_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL7           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL7_OFFSET            (0x0586u)
#define BQ7982X_EIS_PWM_CTRL7_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL7_PHASE2_POS        (0x00u)
#define BQ7982X_EIS_PWM_CTRL7_PHASE2_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL8           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL8_OFFSET            (0x0587u)
#define BQ7982X_EIS_PWM_CTRL8_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL8_PHASE3_POS        (0x00u)
#define BQ7982X_EIS_PWM_CTRL8_PHASE3_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL9           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL9_OFFSET            (0x0588u)
#define BQ7982X_EIS_PWM_CTRL9_POR_VAL           (0x00u)

#define BQ7982X_EIS_PWM_CTRL9_PHASE4_POS        (0x00u)
#define BQ7982X_EIS_PWM_CTRL9_PHASE4_MSK        (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL10           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL10_OFFSET           (0x0589u)
#define BQ7982X_EIS_PWM_CTRL10_POR_VAL          (0x00u)

#define BQ7982X_EIS_PWM_CTRL10_PHASE5_POS       (0x00u)
#define BQ7982X_EIS_PWM_CTRL10_PHASE5_MSK       (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL11           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL11_OFFSET           (0x058Au)
#define BQ7982X_EIS_PWM_CTRL11_POR_VAL          (0x00u)

#define BQ7982X_POS_EIS_PWM_CTRL11_DC_SHIFTH    (0x00u)
#define BQ7982X_MSK_EIS_PWM_CTRL11_DC_SHIFTH    (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL12           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL12_OFFSET           (0x058Bu)
#define BQ7982X_EIS_PWM_CTRL12_POR_VAL          (0x00u)

#define BQ7982X_POS_EIS_PWM_CTRL12_DC_SHIFTL    (0x00u)
#define BQ7982X_MSK_EIS_PWM_CTRL12_DC_SHIFTL    (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL13           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL13_OFFSET           (0x058Cu)
#define BQ7982X_EIS_PWM_CTRL13_POR_VAL          (0x00u)

#define BQ7982X_POS_EIS_PWM_CTRL13_PWM_DIVISORH (0x00u)
#define BQ7982X_MSK_EIS_PWM_CTRL13_PWM_DIVISORH (0x0Fu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL14           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL14_OFFSET           (0x058Du)
#define BQ7982X_EIS_PWM_CTRL14_POR_VAL          (0x00u)

#define BQ7982X_POS_EIS_PWM_CTRL14_PWM_DIVISORL (0x00u)
#define BQ7982X_MSK_EIS_PWM_CTRL14_PWM_DIVISORL (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_PWM_CTRL15           (R/W-AC):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_PWM_CTRL15_OFFSET           (0x058Eu)
#define BQ7982X_EIS_PWM_CTRL15_POR_VAL          (0x00u)

