xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_EIS_PWM_CTRL15_EIS_PWM_MODE (0x01u)
#define BQ7982X_MSK_EIS_PWM_CTRL15_EIS_PWM_MODE (0x06u)

#define BQ7982X_POS_EIS_PWM_CTRL15_EIS_PWM_GO   (0x00u)
#define BQ7982X_MSK_EIS_PWM_CTRL15_EIS_PWM_GO   (0x01u)

/* --------------------------------------------------------------------------
 * EIS_MISC_CTRL           (R/W):
 * -------------------------------------------------------------------------- */
 
#define BQ7982X_EIS_MISC_CTRL_OFFSET           (0x05A0u)
#define BQ7982X_EIS_MISC_CTRL_POR_VAL          (0x00u)

#define BQ7982X_POS_EIS_MISC_CTRL_EIS_RES_SEL  (0x03u)
#define BQ7982X_MSK_EIS_MISC_CTRL_EIS_RES_SEL  (0x08u)

#define BQ7982X_POS_EIS_MISC_CTRL_EIS_RES_TONE (0x00u)
#define BQ7982X_MSK_EIS_MISC_CTRL_EIS_RES_TONE (0x07u)

/* --------------------------------------------------------------------------
 * OTP_PROG_UNLOCK2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_PROG_UNLOCK2_OFFSET      (0x06FFu)
#define BQ7982X_OTP_PROG_UNLOCK2_POR_VAL     (0x00u)

#define BQ7982X_OTP_PROG_UNLOCK2_CODE_POS    (0x00u)
#define BQ7982X_OTP_PROG_UNLOCK2_CODE_MSK    (0xFFu)

/* --------------------------------------------------------------------------
 * PARTID           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PARTID_OFFSET            (0x0700u)
#define BQ7982X_PARTID_POR_VAL           (0x00u)

#define BQ7982X_PARTID_REV_POS           (0x00u)
#define BQ7982X_PARTID_REV_MSK           (0xFFu)

/* --------------------------------------------------------------------------
 * TAPEOUT_REV           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_TAPEOUT_REV_OFFSET       (0x0701u)
#define BQ7982X_TAPEOUT_REV_POR_VAL      (0x00u)

#define BQ7982X_POS_TAPEOUT_REV_ALL_LAYER_REV    (0x00u)
#define BQ7982X_MSK_TAPEOUT_REV_ALL_LAYER_REV    (0x0Fu)

#define BQ7982X_TAPEOUT_REV_METAL_REV_POS        (0x04u)
#define BQ7982X_TAPEOUT_REV_METAL_REV_MSK        (0x0Fu)

/* --------------------------------------------------------------------------
 * DIE_ID1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID1_OFFSET            (0x0702u)
#define BQ7982X_DIE_ID1_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID1_ID_POS            (0x00u)
#define BQ7982X_DIE_ID1_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID2_OFFSET            (0x0703u)
#define BQ7982X_DIE_ID2_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID2_ID_POS            (0x00u)
#define BQ7982X_DIE_ID2_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID3_OFFSET            (0x0704u)
#define BQ7982X_DIE_ID3_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID3_ID_POS            (0x00u)
#define BQ7982X_DIE_ID3_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID4_OFFSET            (0x0705u)
#define BQ7982X_DIE_ID4_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID4_ID_POS            (0x00u)
#define BQ7982X_DIE_ID4_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID5           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID5_OFFSET            (0x0706u)
#define BQ7982X_DIE_ID5_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID5_ID_POS            (0x00u)
#define BQ7982X_DIE_ID5_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID6           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID6_OFFSET            (0x0707u)
#define BQ7982X_DIE_ID6_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID6_ID_POS            (0x00u)
#define BQ7982X_DIE_ID6_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID7           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID7_OFFSET            (0x0708u)
#define BQ7982X_DIE_ID7_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID7_ID_POS            (0x00u)
#define BQ7982X_DIE_ID7_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * DIE_ID8           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIE_ID8_OFFSET            (0x0709u)
#define BQ7982X_DIE_ID8_POR_VAL           (0x00u)

#define BQ7982X_DIE_ID8_ID_POS            (0x00u)
#define BQ7982X_DIE_ID8_ID_MSK            (0xFFu)

/* --------------------------------------------------------------------------
 * CUST_CRC_RSLTHI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_CRC_RSLTHI_OFFSET    (0x070Cu)
#define BQ7982X_CUST_CRC_RSLTHI_POR_VAL   (0x00u)

#define BQ7982X_CUST_CRC_RSLTHI_CRC_POS   (0x00u)
#define BQ7982X_CUST_CRC_RSLTHI_CRC_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CUST_CRC_RSLTLO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CUST_CRC_RSLTLO_OFFSET    (0x070Du)
#define BQ7982X_CUST_CRC_RSLTLO_POR_VAL   (0x00u)

#define BQ7982X_CUST_CRC_RSLTLO_CRC_POS   (0x00u)
#define BQ7982X_CUST_CRC_RSLTLO_CRC_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * OTP_STAT                  (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_STAT_OFFSET    (0x0710u)
#define BQ7982X_OTP_STAT_POR_VAL   (0x00u)

#define BQ7982X_OTP_STAT_LOADED_POS    (0x07u)
#define BQ7982X_OTP_STAT_UV_OVOK_POS   (0x06u)
#define BQ7982X_OTP_STAT_TRY_POS       (0x05u)
#define BQ7982X_OTP_STAT_UNLOCK_POS    (0x04u)
#define BQ7982X_OTP_STAT_UV_OVERR_POS  (0x03u)
#define BQ7982X_OTP_STAT_SUV_SOVERR_POS (0x02u)
#define BQ7982X_OTP_STAT_PROGERR_POS   (0x01u)
#define BQ7982X_OTP_STAT_DONE_POS      (0x00u)

