xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_OTP_STAT_LOADED_MSK    (0x80u)
#define BQ7982X_OTP_STAT_UV_OVOK_MSK   (0x40u)
#define BQ7982X_OTP_STAT_TRY_MSK       (0x20u)
#define BQ7982X_OTP_STAT_UNLOCK_MSK    (0x10u)
#define BQ7982X_OTP_STAT_UV_OVERR_MSK  (0x08u)
#define BQ7982X_OTP_STAT_SUV_SOVERR_MSK (0x04u)
#define BQ7982X_OTP_STAT_PROGERR_MSK   (0x02u)
#define BQ7982X_OTP_STAT_DONE_MSK      (0x01u)

/* --------------------------------------------------------------------------
 * COMM_STAT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_COMM_STAT_OFFSET    (0x0718u)
#define BQ7982X_COMM_STAT_POR_VAL   (0x00u)

#define BQ7982X_COMM_STAT_HB_ACTIVE_POS   (0x01u)
#define BQ7982X_COMM_STAT_HB_ACTIVE_MSK   (0x02u)

#define BQ7982X_COMM_STAT_MD_DET_POS   (0x00u)
#define BQ7982X_COMM_STAT_MD_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_STAT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_STAT1_OFFSET    (0x0720u)
#define BQ7982X_GPIO_STAT1_POR_VAL   (0x00u)

#define BQ7982X_GPIO_STAT1_GPIO8_POS   (0x07u)
#define BQ7982X_GPIO_STAT1_GPIO8_MSK   (0x80u)

#define BQ7982X_GPIO_STAT1_GPIO7_POS   (0x06u)
#define BQ7982X_GPIO_STAT1_GPIO7_MSK   (0x40u)

#define BQ7982X_GPIO_STAT1_GPIO6_POS   (0x05u)
#define BQ7982X_GPIO_STAT1_GPIO6_MSK   (0x20u)

#define BQ7982X_GPIO_STAT1_GPIO5_POS   (0x04u)
#define BQ7982X_GPIO_STAT1_GPIO5_MSK   (0x10u)

#define BQ7982X_GPIO_STAT1_GPIO4_POS   (0x03u)
#define BQ7982X_GPIO_STAT1_GPIO4_MSK   (0x08u)

#define BQ7982X_GPIO_STAT1_GPIO3_POS   (0x02u)
#define BQ7982X_GPIO_STAT1_GPIO3_MSK   (0x04u)

#define BQ7982X_GPIO_STAT1_GPIO2_POS   (0x01u)
#define BQ7982X_GPIO_STAT1_GPIO2_MSK   (0x02u)

#define BQ7982X_GPIO_STAT1_GPIO1_POS   (0x00u)
#define BQ7982X_GPIO_STAT1_GPIO1_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_STAT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_STAT2_OFFSET    (0x0721u)
#define BQ7982X_GPIO_STAT2_POR_VAL   (0x00u)

#define BQ7982X_GPIO_STAT2_GPIO16_POS   (0x07u)
#define BQ7982X_GPIO_STAT2_GPIO16_MSK   (0x80u)

#define BQ7982X_GPIO_STAT2_GPIO15_POS   (0x06u)
#define BQ7982X_GPIO_STAT2_GPIO15_MSK   (0x40u)

#define BQ7982X_GPIO_STAT2_GPIO14_POS   (0x05u)
#define BQ7982X_GPIO_STAT2_GPIO14_MSK   (0x20u)

#define BQ7982X_GPIO_STAT2_GPIO13_POS   (0x04u)
#define BQ7982X_GPIO_STAT2_GPIO13_MSK   (0x10u)

#define BQ7982X_GPIO_STAT2_GPIO12_POS   (0x03u)
#define BQ7982X_GPIO_STAT2_GPIO12_MSK   (0x08u)

#define BQ7982X_GPIO_STAT2_GPIO11_POS   (0x02u)
#define BQ7982X_GPIO_STAT2_GPIO11_MSK   (0x04u)

#define BQ7982X_GPIO_STAT2_GPIO10_POS   (0x01u)
#define BQ7982X_GPIO_STAT2_GPIO10_MSK   (0x02u)

#define BQ7982X_GPIO_STAT2_GPIO9_POS   (0x00u)
#define BQ7982X_GPIO_STAT2_GPIO9_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * GPIO_STAT3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO_STAT3_OFFSET    (0x0722u)
#define BQ7982X_GPIO_STAT3_POR_VAL   (0x00u)

#define BQ7982X_GPIO_STAT3_GPIO20_POS   (0x03u)
#define BQ7982X_GPIO_STAT3_GPIO20_MSK   (0x08u)

#define BQ7982X_GPIO_STAT3_GPIO19_POS   (0x02u)
#define BQ7982X_GPIO_STAT3_GPIO19_MSK   (0x04u)

#define BQ7982X_GPIO_STAT3_GPIO18_POS   (0x01u)
#define BQ7982X_GPIO_STAT3_GPIO18_MSK   (0x02u)

#define BQ7982X_GPIO_STAT3_GPIO17_POS   (0x00u)
#define BQ7982X_GPIO_STAT3_GPIO17_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_STAT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_STAT_OFFSET    (0x0723u)
#define BQ7982X_BAL_STAT_POR_VAL   (0x00u)

#define BQ7982X_POS_BAL_STAT_INVALID_CBCONF   (0x06u)
#define BQ7982X_MSK_BAL_STAT_INVALID_CBCONF   (0x40u)

#define BQ7982X_BAL_STAT_OT_PAUSE_DET_POS   (0x05u)
#define BQ7982X_BAL_STAT_OT_PAUSE_DET_MSK   (0x20u)

#define BQ7982X_BAL_STAT_CB_INPAUSED_POS   (0x04u)
#define BQ7982X_BAL_STAT_CB_INPAUSED_MSK   (0x10u)

#define BQ7982X_BAL_STAT_CB_RUN_POS   (0x03u)
#define BQ7982X_BAL_STAT_CB_RUN_MSK   (0x08u)

#define BQ7982X_BAL_STAT_ABORTFLT_POS   (0x02u)
#define BQ7982X_BAL_STAT_ABORTFLT_MSK   (0x04u)

#define BQ7982X_BAL_STAT_GLOBAL_DONE_POS   (0x01u)
#define BQ7982X_BAL_STAT_GLOBAL_DONE_MSK   (0x02u)

#define BQ7982X_BAL_STAT_CB_DONE_POS   (0x00u)
#define BQ7982X_BAL_STAT_CB_DONE_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_SW_STAT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_SW_STAT1_OFFSET    (0x0728u)
#define BQ7982X_BAL_SW_STAT1_POR_VAL   (0x00u)

#define BQ7982X_BAL_SW_STAT1_CELL8_POS   (0x07u)
#define BQ7982X_BAL_SW_STAT1_CELL8_MSK   (0x80u)

#define BQ7982X_BAL_SW_STAT1_CELL7_POS   (0x06u)
#define BQ7982X_BAL_SW_STAT1_CELL7_MSK   (0x40u)

#define BQ7982X_BAL_SW_STAT1_CELL6_POS   (0x05u)
#define BQ7982X_BAL_SW_STAT1_CELL6_MSK   (0x20u)

#define BQ7982X_BAL_SW_STAT1_CELL5_POS   (0x04u)
#define BQ7982X_BAL_SW_STAT1_CELL5_MSK   (0x10u)

#define BQ7982X_BAL_SW_STAT1_CELL4_POS   (0x03u)
#define BQ7982X_BAL_SW_STAT1_CELL4_MSK   (0x08u)

#define BQ7982X_BAL_SW_STAT1_CELL3_POS   (0x02u)
#define BQ7982X_BAL_SW_STAT1_CELL3_MSK   (0x04u)

#define BQ7982X_BAL_SW_STAT1_CELL2_POS   (0x01u)
#define BQ7982X_BAL_SW_STAT1_CELL2_MSK   (0x02u)

#define BQ7982X_BAL_SW_STAT1_CELL1_POS   (0x00u)
#define BQ7982X_BAL_SW_STAT1_CELL1_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_SW_STAT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_SW_STAT2_OFFSET    (0x0729u)
#define BQ7982X_BAL_SW_STAT2_POR_VAL   (0x00u)

#define BQ7982X_BAL_SW_STAT2_CELL16_POS   (0x07u)
#define BQ7982X_BAL_SW_STAT2_CELL16_MSK   (0x80u)

#define BQ7982X_BAL_SW_STAT2_CELL15_POS   (0x06u)
#define BQ7982X_BAL_SW_STAT2_CELL15_MSK   (0x40u)

#define BQ7982X_BAL_SW_STAT2_CELL14_POS   (0x05u)
#define BQ7982X_BAL_SW_STAT2_CELL14_MSK   (0x20u)

#define BQ7982X_BAL_SW_STAT2_CELL13_POS   (0x04u)
#define BQ7982X_BAL_SW_STAT2_CELL13_MSK   (0x10u)

#define BQ7982X_BAL_SW_STAT2_CELL12_POS   (0x03u)
#define BQ7982X_BAL_SW_STAT2_CELL12_MSK   (0x08u)

#define BQ7982X_BAL_SW_STAT2_CELL11_POS   (0x02u)
#define BQ7982X_BAL_SW_STAT2_CELL11_MSK   (0x04u)

