xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_BAL_SW_STAT2_CELL10_POS   (0x01u)
#define BQ7982X_BAL_SW_STAT2_CELL10_MSK   (0x02u)

#define BQ7982X_BAL_SW_STAT2_CELL9_POS   (0x00u)
#define BQ7982X_BAL_SW_STAT2_CELL9_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_SW_STAT3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_SW_STAT3_OFFSET    (0x072Au)
#define BQ7982X_BAL_SW_STAT3_POR_VAL   (0x00u)

#define BQ7982X_BAL_SW_STAT3_CELL24_POS   (0x07u)
#define BQ7982X_BAL_SW_STAT3_CELL24_MSK   (0x80u)

#define BQ7982X_BAL_SW_STAT3_CELL23_POS   (0x06u)
#define BQ7982X_BAL_SW_STAT3_CELL23_MSK   (0x40u)

#define BQ7982X_BAL_SW_STAT3_CELL22_POS   (0x05u)
#define BQ7982X_BAL_SW_STAT3_CELL22_MSK   (0x20u)

#define BQ7982X_BAL_SW_STAT3_CELL21_POS   (0x04u)
#define BQ7982X_BAL_SW_STAT3_CELL21_MSK   (0x10u)

#define BQ7982X_BAL_SW_STAT3_CELL20_POS   (0x03u)
#define BQ7982X_BAL_SW_STAT3_CELL20_MSK   (0x08u)

#define BQ7982X_BAL_SW_STAT3_CELL19_POS   (0x02u)
#define BQ7982X_BAL_SW_STAT3_CELL19_MSK   (0x04u)

#define BQ7982X_BAL_SW_STAT3_CELL18_POS   (0x01u)
#define BQ7982X_BAL_SW_STAT3_CELL18_MSK   (0x02u)

#define BQ7982X_BAL_SW_STAT3_CELL17_POS   (0x00u)
#define BQ7982X_BAL_SW_STAT3_CELL17_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_SW_STAT4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_SW_STAT4_OFFSET    (0x072Bu)
#define BQ7982X_BAL_SW_STAT4_POR_VAL   (0x00u)

#define BQ7982X_BAL_SW_STAT4_CELL26_POS   (0x01u)
#define BQ7982X_BAL_SW_STAT4_CELL26_MSK   (0x02u)

#define BQ7982X_BAL_SW_STAT4_CELL25_POS   (0x00u)
#define BQ7982X_BAL_SW_STAT4_CELL25_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_DONE1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_DONE1_OFFSET    (0x072Cu)
#define BQ7982X_BAL_DONE1_POR_VAL   (0x00u)

#define BQ7982X_BAL_DONE1_CELL8_POS   (0x07u)
#define BQ7982X_BAL_DONE1_CELL8_MSK   (0x80u)

#define BQ7982X_BAL_DONE1_CELL7_POS   (0x06u)
#define BQ7982X_BAL_DONE1_CELL7_MSK   (0x40u)

#define BQ7982X_BAL_DONE1_CELL6_POS   (0x05u)
#define BQ7982X_BAL_DONE1_CELL6_MSK   (0x20u)

#define BQ7982X_BAL_DONE1_CELL5_POS   (0x04u)
#define BQ7982X_BAL_DONE1_CELL5_MSK   (0x10u)

#define BQ7982X_BAL_DONE1_CELL4_POS   (0x03u)
#define BQ7982X_BAL_DONE1_CELL4_MSK   (0x08u)

#define BQ7982X_BAL_DONE1_CELL3_POS   (0x02u)
#define BQ7982X_BAL_DONE1_CELL3_MSK   (0x04u)

#define BQ7982X_BAL_DONE1_CELL2_POS   (0x01u)
#define BQ7982X_BAL_DONE1_CELL2_MSK   (0x02u)

#define BQ7982X_BAL_DONE1_CELL1_POS   (0x00u)
#define BQ7982X_BAL_DONE1_CELL1_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_DONE2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_DONE2_OFFSET    (0x072Du)
#define BQ7982X_BAL_DONE2_POR_VAL   (0x00u)

#define BQ7982X_BAL_DONE2_CELL16_POS   (0x07u)
#define BQ7982X_BAL_DONE2_CELL16_MSK   (0x80u)

#define BQ7982X_BAL_DONE2_CELL15_POS   (0x06u)
#define BQ7982X_BAL_DONE2_CELL15_MSK   (0x40u)

#define BQ7982X_BAL_DONE2_CELL14_POS   (0x05u)
#define BQ7982X_BAL_DONE2_CELL14_MSK   (0x20u)

#define BQ7982X_BAL_DONE2_CELL13_POS   (0x04u)
#define BQ7982X_BAL_DONE2_CELL13_MSK   (0x10u)

#define BQ7982X_BAL_DONE2_CELL12_POS   (0x03u)
#define BQ7982X_BAL_DONE2_CELL12_MSK   (0x08u)

#define BQ7982X_BAL_DONE2_CELL11_POS   (0x02u)
#define BQ7982X_BAL_DONE2_CELL11_MSK   (0x04u)

#define BQ7982X_BAL_DONE2_CELL10_POS   (0x01u)
#define BQ7982X_BAL_DONE2_CELL10_MSK   (0x02u)

#define BQ7982X_BAL_DONE2_CELL9_POS   (0x00u)
#define BQ7982X_BAL_DONE2_CELL9_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_DONE3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_DONE3_OFFSET    (0x072Eu)
#define BQ7982X_BAL_DONE3_POR_VAL   (0x00u)

#define BQ7982X_BAL_DONE3_CELL24_POS   (0x07u)
#define BQ7982X_BAL_DONE3_CELL24_MSK   (0x80u)

#define BQ7982X_BAL_DONE3_CELL23_POS   (0x06u)
#define BQ7982X_BAL_DONE3_CELL23_MSK   (0x40u)

#define BQ7982X_BAL_DONE3_CELL22_POS   (0x05u)
#define BQ7982X_BAL_DONE3_CELL22_MSK   (0x20u)

#define BQ7982X_BAL_DONE3_CELL21_POS   (0x04u)
#define BQ7982X_BAL_DONE3_CELL21_MSK   (0x10u)

#define BQ7982X_BAL_DONE3_CELL20_POS   (0x03u)
#define BQ7982X_BAL_DONE3_CELL20_MSK   (0x08u)

#define BQ7982X_BAL_DONE3_CELL19_POS   (0x02u)
#define BQ7982X_BAL_DONE3_CELL19_MSK   (0x04u)

#define BQ7982X_BAL_DONE3_CELL18_POS   (0x01u)
#define BQ7982X_BAL_DONE3_CELL18_MSK   (0x02u)

#define BQ7982X_BAL_DONE3_CELL17_POS   (0x00u)
#define BQ7982X_BAL_DONE3_CELL17_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_DONE4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_DONE4_OFFSET    (0x072Fu)
#define BQ7982X_BAL_DONE4_POR_VAL   (0x00u)

#define BQ7982X_BAL_DONE4_CELL26_POS   (0x01u)
#define BQ7982X_BAL_DONE4_CELL26_MSK   (0x02u)

#define BQ7982X_BAL_DONE4_CELL25_POS   (0x00u)
#define BQ7982X_BAL_DONE4_CELL25_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * BAL_TIME           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAL_TIME_OFFSET    (0x0730u)
#define BQ7982X_BAL_TIME_POR_VAL   (0x00u)

#define BQ7982X_BAL_TIME_TIME_UNIT_POS   (0x07u)
#define BQ7982X_BAL_TIME_TIME_UNIT_MSK   (0x80u)

#define BQ7982X_BAL_TIME_TIME_POS   (0x00u)
#define BQ7982X_BAL_TIME_TIME_MSK   (0x7Fu)

/* --------------------------------------------------------------------------
 * DIAG_STAT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_STAT1_OFFSET    (0x0731u)
#define BQ7982X_DIAG_STAT1_POR_VAL   (0x00u)

#define BQ7982X_POS_DIAG_STAT1_SF_FREEZE_ACTIVE   (0x07u)
#define BQ7982X_MSK_DIAG_STAT1_SF_FREEZE_ACTIVE   (0x80u)

#define BQ7982X_POS_DIAG_STAT1_DIAG_BAL_FREEZE_ACTIVE   (0x06u)
#define BQ7982X_MSK_DIAG_STAT1_DIAG_BAL_FREEZE_ACTIVE   (0x40u)

#define BQ7982X_POS_DIAG_STAT1_FREEZE_ACTIVE   (0x05u)
#define BQ7982X_MSK_DIAG_STAT1_FREEZE_ACTIVE   (0x20u)

#define BQ7982X_POS_DIAG_STAT1_FREEZE_LPF_ACTIVE   (0x04u)
#define BQ7982X_MSK_DIAG_STAT1_FREEZE_LPF_ACTIVE   (0x10u)

#define BQ7982X_DIAG_STAT1_DRDY_SMON_POS   (0x03u)
#define BQ7982X_DIAG_STAT1_DRDY_SMON_MSK   (0x08u)

