xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_DIAG_STAT1_DRDY_TMON_POS   (0x02u)
#define BQ7982X_DIAG_STAT1_DRDY_TMON_MSK   (0x04u)

#define BQ7982X_DIAG_STAT1_DRDY_VMON_POS   (0x01u)
#define BQ7982X_DIAG_STAT1_DRDY_VMON_MSK   (0x02u)

#define BQ7982X_POS_DIAG_STAT1_DRDY_PWRBIST   (0x00u)
#define BQ7982X_MSK_DIAG_STAT1_DRDY_PWRBIST   (0x01u)

/* --------------------------------------------------------------------------
 * DIAG_STAT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_STAT2_OFFSET    (0x0732u)
#define BQ7982X_DIAG_STAT2_POR_VAL   (0x00u)

#define BQ7982X_POS_DIAG_STAT2_ECC_TEST_OK   (0x05u)
#define BQ7982X_MSK_DIAG_STAT2_ECC_TEST_OK   (0x20u)

#define BQ7982X_POS_DIAG_STAT2_DRDY_DIAG_BAL   (0x04u)
#define BQ7982X_MSK_DIAG_STAT2_DRDY_DIAG_BAL   (0x10u)

#define BQ7982X_POS_DIAG_STAT2_DRDY_CBFETOW   (0x03u)
#define BQ7982X_MSK_DIAG_STAT2_DRDY_CBFETOW   (0x08u)

#define BQ7982X_DIAG_STAT2_DRDY_DIG_POS   (0x02u)
#define BQ7982X_DIAG_STAT2_DRDY_DIG_MSK   (0x04u)

#define BQ7982X_POS_DIAG_STAT2_DRDY_ANA_GPIO   (0x01u)
#define BQ7982X_MSK_DIAG_STAT2_DRDY_ANA_GPIO   (0x02u)

#define BQ7982X_POS_DIAG_STAT2_DRDY_ANA_VCELL   (0x00u)
#define BQ7982X_MSK_DIAG_STAT2_DRDY_ANA_VCELL   (0x01u)

/* --------------------------------------------------------------------------
 * ADC_DATA_RDY           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_ADC_DATA_RDY_OFFSET    (0x0733u)
#define BQ7982X_ADC_DATA_RDY_POR_VAL   (0x00u)

#define BQ7982X_POS_ADC_DATA_RDY_DRDY_CSADC   (0x04u)
#define BQ7982X_MSK_ADC_DATA_RDY_DRDY_CSADC   (0x10u)

#define BQ7982X_POS_ADC_DATA_RDY_DRDY_DIAG_D1D2   (0x03u)
#define BQ7982X_MSK_ADC_DATA_RDY_DRDY_DIAG_D1D2   (0x08u)

#define BQ7982X_POS_ADC_DATA_RDY_DRDY_DIAG   (0x02u)
#define BQ7982X_MSK_ADC_DATA_RDY_DRDY_DIAG   (0x04u)

#define BQ7982X_POS_ADC_DATA_RDY_DRDY_GPADC   (0x01u)
#define BQ7982X_MSK_ADC_DATA_RDY_DRDY_GPADC   (0x02u)

#define BQ7982X_POS_ADC_DATA_RDY_DRDY_VCELLADC   (0x00u)
#define BQ7982X_MSK_ADC_DATA_RDY_DRDY_VCELLADC   (0x01u)

/* --------------------------------------------------------------------------
 * DEV_STAT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEV_STAT1_OFFSET    (0x0734u)
#define BQ7982X_DEV_STAT1_POR_VAL   (0x00u)

#define BQ7982X_POS_DEV_STAT1_DIAG_ANA_GP_RUN   (0x07u)
#define BQ7982X_MSK_DEV_STAT1_DIAG_ANA_GP_RUN   (0x80u)

#define BQ7982X_POS_DEV_STAT1_FACT_CRC_DONE   (0x06u)
#define BQ7982X_MSK_DEV_STAT1_FACT_CRC_DONE   (0x40u)

#define BQ7982X_POS_DEV_STAT1_CUST_CRC_DONE   (0x05u)
#define BQ7982X_MSK_DEV_STAT1_CUST_CRC_DONE   (0x20u)

#define BQ7982X_POS_DEV_STAT1_DIAG_DIG_RUN   (0x04u)
#define BQ7982X_MSK_DEV_STAT1_DIAG_DIG_RUN   (0x10u)

#define BQ7982X_POS_DEV_STAT1_DIAG_MEAS_RUN   (0x03u)
#define BQ7982X_MSK_DEV_STAT1_DIAG_MEAS_RUN   (0x08u)

#define BQ7982X_POS_DEV_STAT1_DIAG_ANA_VC_RUN   (0x02u)
#define BQ7982X_MSK_DEV_STAT1_DIAG_ANA_VC_RUN   (0x04u)

#define BQ7982X_DEV_STAT1_GPADC_RUN_POS   (0x01u)
#define BQ7982X_DEV_STAT1_GPADC_RUN_MSK   (0x02u)

#define BQ7982X_POS_DEV_STAT1_VCELLADC_RUN   (0x00u)
#define BQ7982X_MSK_DEV_STAT1_VCELLADC_RUN   (0x01u)

/* --------------------------------------------------------------------------
 * DEV_STAT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEV_STAT2_OFFSET    (0x0735u)
#define BQ7982X_DEV_STAT2_POR_VAL   (0x00u)

#define BQ7982X_POS_DEV_STAT2_CRYSTAL_ACTIVE   (0x07u)
#define BQ7982X_MSK_DEV_STAT2_CRYSTAL_ACTIVE   (0x80u)

#define BQ7982X_DEV_STAT2_AVDD_ON_POS   (0x06u)
#define BQ7982X_DEV_STAT2_AVDD_ON_MSK   (0x40u)

#define BQ7982X_DEV_STAT2_CSADC_RUN_POS   (0x05u)
#define BQ7982X_DEV_STAT2_CSADC_RUN_MSK   (0x20u)

#define BQ7982X_DEV_STAT2_OTCB_RUN_POS   (0x04u)
#define BQ7982X_DEV_STAT2_OTCB_RUN_MSK   (0x10u)

#define BQ7982X_DEV_STAT2_VCBDONE_RUN_POS   (0x03u)
#define BQ7982X_DEV_STAT2_VCBDONE_RUN_MSK   (0x08u)

#define BQ7982X_DEV_STAT2_SMON_RUN_POS   (0x02u)
#define BQ7982X_DEV_STAT2_SMON_RUN_MSK   (0x04u)

#define BQ7982X_DEV_STAT2_OTUT_RUN_POS   (0x01u)
#define BQ7982X_DEV_STAT2_OTUT_RUN_MSK   (0x02u)

#define BQ7982X_DEV_STAT2_OVUV_RUN_POS   (0x00u)
#define BQ7982X_DEV_STAT2_OVUV_RUN_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SUMMARY           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SUMMARY_OFFSET    (0x0737u)
#define BQ7982X_FAULT_SUMMARY_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_OC   (0x07u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_OC   (0x80u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_ADC_CB   (0x06u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_ADC_CB   (0x40u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_TMON   (0x05u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_TMON   (0x20u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_OVUV   (0x04u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_OVUV   (0x10u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_SYS   (0x03u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_SYS   (0x08u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_MEM   (0x02u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_MEM   (0x04u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_COMM   (0x01u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_COMM   (0x02u)

#define BQ7982X_POS_FAULT_SUMMARY_FAULT_PWR   (0x00u)
#define BQ7982X_MSK_FAULT_SUMMARY_FAULT_PWR   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_PWR1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_PWR1_OFFSET    (0x0739u)
#define BQ7982X_FAULT_PWR1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_PWR1_VSS_OPEN_POS   (0x07u)
#define BQ7982X_FAULT_PWR1_VSS_OPEN_MSK   (0x80u)

#define BQ7982X_FAULT_PWR1_TSREF_UV_POS   (0x06u)
#define BQ7982X_FAULT_PWR1_TSREF_UV_MSK   (0x40u)

#define BQ7982X_FAULT_PWR1_TSREF_OV_POS   (0x05u)
#define BQ7982X_FAULT_PWR1_TSREF_OV_MSK   (0x20u)

