xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_FAULT_PWR1_INTR_UV_POS   (0x04u)
#define BQ7982X_FAULT_PWR1_INTR_UV_MSK   (0x10u)

#define BQ7982X_FAULT_PWR1_VIO_UV_POS   (0x03u)
#define BQ7982X_FAULT_PWR1_VIO_UV_MSK   (0x08u)

#define BQ7982X_FAULT_PWR1_DVDD_OV_POS   (0x02u)
#define BQ7982X_FAULT_PWR1_DVDD_OV_MSK   (0x04u)

#define BQ7982X_FAULT_PWR1_AVDD_OV_POS   (0x01u)
#define BQ7982X_FAULT_PWR1_AVDD_OV_MSK   (0x02u)

#define BQ7982X_POS_FAULT_PWR1_PWRBIST_FAIL   (0x00u)
#define BQ7982X_MSK_FAULT_PWR1_PWRBIST_FAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_PWR2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_PWR2_OFFSET    (0x073Au)
#define BQ7982X_FAULT_PWR2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_PWR2_TSREF_OSC_POS   (0x02u)
#define BQ7982X_FAULT_PWR2_TSREF_OSC_MSK   (0x04u)

#define BQ7982X_FAULT_PWR2_AVDD_OSC_POS   (0x01u)
#define BQ7982X_FAULT_PWR2_AVDD_OSC_MSK   (0x02u)

#define BQ7982X_FAULT_PWR2_NEG_CP_UV_POS   (0x00u)
#define BQ7982X_FAULT_PWR2_NEG_CP_UV_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_COMM1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_COMM1_OFFSET    (0x073Cu)
#define BQ7982X_FAULT_COMM1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_COMM1_PSPI2_POS   (0x04u)
#define BQ7982X_FAULT_COMM1_PSPI2_MSK   (0x10u)

#define BQ7982X_FAULT_COMM1_COMM_BUSY_POS   (0x03u)
#define BQ7982X_FAULT_COMM1_COMM_BUSY_MSK   (0x08u)

#define BQ7982X_FAULT_COMM1_COML_POS   (0x02u)
#define BQ7982X_FAULT_COMM1_COML_MSK   (0x04u)

#define BQ7982X_FAULT_COMM1_COMH_POS   (0x01u)
#define BQ7982X_FAULT_COMM1_COMH_MSK   (0x02u)

#define BQ7982X_FAULT_COMM1_PSPI_POS   (0x00u)
#define BQ7982X_FAULT_COMM1_PSPI_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_COMM2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_COMM2_OFFSET    (0x073Du)
#define BQ7982X_FAULT_COMM2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_COMM2_FT_DET1_POS   (0x07u)
#define BQ7982X_FAULT_COMM2_FT_DET1_MSK   (0x80u)

#define BQ7982X_FAULT_COMM2_FT_DET2_POS   (0x06u)
#define BQ7982X_FAULT_COMM2_FT_DET2_MSK   (0x40u)

#define BQ7982X_FAULT_COMM2_FT_DET3_POS   (0x05u)
#define BQ7982X_FAULT_COMM2_FT_DET3_MSK   (0x20u)

#define BQ7982X_FAULT_COMM2_FT_DET4_POS   (0x04u)
#define BQ7982X_FAULT_COMM2_FT_DET4_MSK   (0x10u)

#define BQ7982X_POS_FAULT_COMM2_HB_TO_FAIL1   (0x03u)
#define BQ7982X_MSK_FAULT_COMM2_HB_TO_FAIL1   (0x08u)

#define BQ7982X_POS_FAULT_COMM2_HB_TO_FAIL2   (0x02u)
#define BQ7982X_MSK_FAULT_COMM2_HB_TO_FAIL2   (0x04u)

#define BQ7982X_POS_FAULT_COMM2_HB_TO_FAIL3   (0x01u)
#define BQ7982X_MSK_FAULT_COMM2_HB_TO_FAIL3   (0x02u)

#define BQ7982X_POS_FAULT_COMM2_HB_TO_FAIL4   (0x00u)
#define BQ7982X_MSK_FAULT_COMM2_HB_TO_FAIL4   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_COMM3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_COMM3_OFFSET    (0x073Eu)
#define BQ7982X_FAULT_COMM3_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_COMM3_MD_FT_UNEXP_DET   (0x05u)
#define BQ7982X_MSK_FAULT_COMM3_MD_FT_UNEXP_DET   (0x20u)

#define BQ7982X_POS_FAULT_COMM3_MD_HB_UNEXP_DET   (0x04u)
#define BQ7982X_MSK_FAULT_COMM3_MD_HB_UNEXP_DET   (0x10u)

#define BQ7982X_POS_FAULT_COMM3_FT_UNEXP_DET   (0x03u)
#define BQ7982X_MSK_FAULT_COMM3_FT_UNEXP_DET   (0x08u)

#define BQ7982X_POS_FAULT_COMM3_HB_UNEXP_DET   (0x02u)
#define BQ7982X_MSK_FAULT_COMM3_HB_UNEXP_DET   (0x04u)

#define BQ7982X_POS_FAULT_COMM3_FRAME_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_COMM3_FRAME_FAIL   (0x02u)

#define BQ7982X_POS_FAULT_COMM3_FRAME_RESET   (0x00u)
#define BQ7982X_MSK_FAULT_COMM3_FRAME_RESET   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_MEM             (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_MEM_OFFSET    (0x0743u)
#define BQ7982X_FAULT_MEM_POR_VAL   (0x00u)

#define BQ7982X_FAULT_MEM_EIS_DED_POS   (0x07u)
#define BQ7982X_FAULT_MEM_EIS_DED_MSK   (0x80u)

#define BQ7982X_FAULT_MEM_EIS_SEC_POS   (0x06u)
#define BQ7982X_FAULT_MEM_EIS_SEC_MSK   (0x40u)

#define BQ7982X_FAULT_MEM_OTP_DED_POS   (0x05u)
#define BQ7982X_FAULT_MEM_OTP_DED_MSK   (0x20u)

#define BQ7982X_FAULT_MEM_OTP_SEC_POS   (0x04u)
#define BQ7982X_FAULT_MEM_OTP_SEC_MSK   (0x10u)

#define BQ7982X_FAULT_MEM_CUST_CRC_POS   (0x03u)
#define BQ7982X_FAULT_MEM_CUST_CRC_MSK   (0x08u)

#define BQ7982X_FAULT_MEM_FACT_CRC_POS   (0x02u)
#define BQ7982X_FAULT_MEM_FACT_CRC_MSK   (0x04u)

#define BQ7982X_FAULT_MEM_LOADERR_POS   (0x01u)
#define BQ7982X_FAULT_MEM_LOADERR_MSK   (0x02u)

#define BQ7982X_FAULT_MEM_GBLOVERR_POS   (0x00u)
#define BQ7982X_FAULT_MEM_GBLOVERR_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS1_OFFSET    (0x0745u)
#define BQ7982X_FAULT_SYS1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_SYS1_CRYSTAL_POS   (0x06u)
#define BQ7982X_FAULT_SYS1_CRYSTAL_MSK   (0x40u)

#define BQ7982X_POS_FAULT_SYS1_NUM_CELL_OV   (0x05u)
#define BQ7982X_MSK_FAULT_SYS1_NUM_CELL_OV   (0x20u)

#define BQ7982X_FAULT_SYS1_AVDD_ON_POS   (0x04u)
#define BQ7982X_FAULT_SYS1_AVDD_ON_MSK   (0x10u)

#define BQ7982X_FAULT_SYS1_LFO_POS   (0x03u)
#define BQ7982X_FAULT_SYS1_LFO_MSK   (0x08u)

#define BQ7982X_FAULT_SYS1_DRST_POS   (0x02u)
#define BQ7982X_FAULT_SYS1_DRST_MSK   (0x04u)

#define BQ7982X_FAULT_SYS1_TSHUT_POS   (0x01u)
#define BQ7982X_FAULT_SYS1_TSHUT_MSK   (0x02u)

#define BQ7982X_FAULT_SYS1_TWARN_POS   (0x00u)
#define BQ7982X_FAULT_SYS1_TWARN_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS2_OFFSET    (0x0746u)
#define BQ7982X_FAULT_SYS2_POR_VAL   (0x00u)

