xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_FAULT_SYS2_I2C_BUSY_POS   (0x04u)
#define BQ7982X_FAULT_SYS2_I2C_BUSY_MSK   (0x10u)

#define BQ7982X_FAULT_SYS2_I2C_LOW_POS   (0x03u)
#define BQ7982X_FAULT_SYS2_I2C_LOW_MSK   (0x08u)

#define BQ7982X_FAULT_SYS2_I2C_NACK_POS   (0x02u)
#define BQ7982X_FAULT_SYS2_I2C_NACK_MSK   (0x04u)

#define BQ7982X_FAULT_SYS2_CSPI_CS_POS   (0x01u)
#define BQ7982X_FAULT_SYS2_CSPI_CS_MSK   (0x02u)

#define BQ7982X_FAULT_SYS2_CSPI_BUSY_POS   (0x00u)
#define BQ7982X_FAULT_SYS2_CSPI_BUSY_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS3_OFFSET    (0x0747u)
#define BQ7982X_FAULT_SYS3_POR_VAL   (0x00u)

#define BQ7982X_FAULT_SYS3_INT8_DET_POS   (0x07u)
#define BQ7982X_FAULT_SYS3_INT8_DET_MSK   (0x80u)

#define BQ7982X_FAULT_SYS3_INT7_DET_POS   (0x06u)
#define BQ7982X_FAULT_SYS3_INT7_DET_MSK   (0x40u)

#define BQ7982X_FAULT_SYS3_INT6_DET_POS   (0x05u)
#define BQ7982X_FAULT_SYS3_INT6_DET_MSK   (0x20u)

#define BQ7982X_FAULT_SYS3_INT5_DET_POS   (0x04u)
#define BQ7982X_FAULT_SYS3_INT5_DET_MSK   (0x10u)

#define BQ7982X_FAULT_SYS3_INT4_DET_POS   (0x03u)
#define BQ7982X_FAULT_SYS3_INT4_DET_MSK   (0x08u)

#define BQ7982X_FAULT_SYS3_INT3_DET_POS   (0x02u)
#define BQ7982X_FAULT_SYS3_INT3_DET_MSK   (0x04u)

#define BQ7982X_FAULT_SYS3_INT2_DET_POS   (0x01u)
#define BQ7982X_FAULT_SYS3_INT2_DET_MSK   (0x02u)

#define BQ7982X_FAULT_SYS3_INT1_DET_POS   (0x00u)
#define BQ7982X_FAULT_SYS3_INT1_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS4_OFFSET    (0x0748u)
#define BQ7982X_FAULT_SYS4_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_SYS4_AO_MON_PFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_SYS4_AO_MON_PFAIL   (0x80u)

#define BQ7982X_FAULT_SYS4_MON_PFAIL_POS   (0x06u)
#define BQ7982X_FAULT_SYS4_MON_PFAIL_MSK   (0x40u)

#define BQ7982X_FAULT_SYS4_SMONH_DET_POS   (0x05u)
#define BQ7982X_FAULT_SYS4_SMONH_DET_MSK   (0x20u)

#define BQ7982X_FAULT_SYS4_SMONL_DET_POS   (0x04u)
#define BQ7982X_FAULT_SYS4_SMONL_DET_MSK   (0x10u)

#define BQ7982X_FAULT_SYS4_SMON_ABORT_POS   (0x03u)
#define BQ7982X_FAULT_SYS4_SMON_ABORT_MSK   (0x08u)

#define BQ7982X_FAULT_SYS4_VMON_ABORT_POS   (0x02u)
#define BQ7982X_FAULT_SYS4_VMON_ABORT_MSK   (0x04u)

#define BQ7982X_FAULT_SYS4_TMON_ABORT_POS   (0x01u)
#define BQ7982X_FAULT_SYS4_TMON_ABORT_MSK   (0x02u)

#define BQ7982X_FAULT_SYS4_MON_ABORT_POS   (0x00u)
#define BQ7982X_FAULT_SYS4_MON_ABORT_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS5           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS5_OFFSET    (0x0749u)
#define BQ7982X_FAULT_SYS5_POR_VAL   (0x00u)

#define BQ7982X_FAULT_SYS5_PWM_WARN_POS   (0x03u)
#define BQ7982X_FAULT_SYS5_PWM_WARN_MSK   (0x04u)

#define BQ7982X_FAULT_SYS5_EIS_WARN_POS   (0x02u)
#define BQ7982X_FAULT_SYS5_EIS_WARN_MSK   (0x02u)

#define BQ7982X_FAULT_SYS5_EIS_ABORT_POS   (0x00u)
#define BQ7982X_FAULT_SYS5_EIS_ABORT_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_SYS6           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_SYS6_OFFSET    (0x074Au)
#define BQ7982X_FAULT_SYS6_POR_VAL   (0x00u)

#define BQ7982X_FAULT_SYS6_SF_PFAIL_POS   (0x06u)
#define BQ7982X_FAULT_SYS6_SF_PFAIL_MSK   (0x40u)

#define BQ7982X_POS_FAULT_SYS6_HFO_FREQ_FAIL   (0x05u)
#define BQ7982X_MSK_FAULT_SYS6_HFO_FREQ_FAIL   (0x20u)

#define BQ7982X_POS_FAULT_SYS6_PROP_DLY_FAIL   (0x04u)
#define BQ7982X_MSK_FAULT_SYS6_PROP_DLY_FAIL   (0x10u)

#define BQ7982X_POS_FAULT_SYS6_PLL_SYNC_FAIL   (0x03u)
#define BQ7982X_MSK_FAULT_SYS6_PLL_SYNC_FAIL   (0x08u)

#define BQ7982X_POS_FAULT_SYS6_DIG_SYNC_WARN   (0x02u)
#define BQ7982X_MSK_FAULT_SYS6_DIG_SYNC_WARN   (0x04u)

#define BQ7982X_POS_FAULT_SYS6_DIG_SYNC_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_SYS6_DIG_SYNC_FAIL   (0x02u)

#define BQ7982X_FAULT_SYS6_SF_WARN_POS   (0x00u)
#define BQ7982X_FAULT_SYS6_SF_WARN_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OV1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OV1_OFFSET    (0x074Eu)
#define BQ7982X_FAULT_OV1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OV1_OV8_DET_POS   (0x07u)
#define BQ7982X_FAULT_OV1_OV8_DET_MSK   (0x80u)

#define BQ7982X_FAULT_OV1_OV7_DET_POS   (0x06u)
#define BQ7982X_FAULT_OV1_OV7_DET_MSK   (0x40u)

#define BQ7982X_FAULT_OV1_OV6_DET_POS   (0x05u)
#define BQ7982X_FAULT_OV1_OV6_DET_MSK   (0x20u)

#define BQ7982X_FAULT_OV1_OV5_DET_POS   (0x04u)
#define BQ7982X_FAULT_OV1_OV5_DET_MSK   (0x10u)

#define BQ7982X_FAULT_OV1_OV4_DET_POS   (0x03u)
#define BQ7982X_FAULT_OV1_OV4_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OV1_OV3_DET_POS   (0x02u)
#define BQ7982X_FAULT_OV1_OV3_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OV1_OV2_DET_POS   (0x01u)
#define BQ7982X_FAULT_OV1_OV2_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OV1_OV1_DET_POS   (0x00u)
#define BQ7982X_FAULT_OV1_OV1_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OV2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OV2_OFFSET    (0x074Fu)
#define BQ7982X_FAULT_OV2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OV2_OV16_DET_POS   (0x07u)
#define BQ7982X_FAULT_OV2_OV16_DET_MSK   (0x80u)

#define BQ7982X_FAULT_OV2_OV15_DET_POS   (0x06u)
#define BQ7982X_FAULT_OV2_OV15_DET_MSK   (0x40u)

#define BQ7982X_FAULT_OV2_OV14_DET_POS   (0x05u)
#define BQ7982X_FAULT_OV2_OV14_DET_MSK   (0x20u)

#define BQ7982X_FAULT_OV2_OV13_DET_POS   (0x04u)
#define BQ7982X_FAULT_OV2_OV13_DET_MSK   (0x10u)

