xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_FAULT_OV2_OV12_DET_POS   (0x03u)
#define BQ7982X_FAULT_OV2_OV12_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OV2_OV11_DET_POS   (0x02u)
#define BQ7982X_FAULT_OV2_OV11_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OV2_OV10_DET_POS   (0x01u)
#define BQ7982X_FAULT_OV2_OV10_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OV2_OV9_DET_POS   (0x00u)
#define BQ7982X_FAULT_OV2_OV9_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OV3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OV3_OFFSET    (0x0750u)
#define BQ7982X_FAULT_OV3_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OV3_OV24_DET_POS   (0x07u)
#define BQ7982X_FAULT_OV3_OV24_DET_MSK   (0x80u)

#define BQ7982X_FAULT_OV3_OV23_DET_POS   (0x06u)
#define BQ7982X_FAULT_OV3_OV23_DET_MSK   (0x40u)

#define BQ7982X_FAULT_OV3_OV22_DET_POS   (0x05u)
#define BQ7982X_FAULT_OV3_OV22_DET_MSK   (0x20u)

#define BQ7982X_FAULT_OV3_OV21_DET_POS   (0x04u)
#define BQ7982X_FAULT_OV3_OV21_DET_MSK   (0x10u)

#define BQ7982X_FAULT_OV3_OV20_DET_POS   (0x03u)
#define BQ7982X_FAULT_OV3_OV20_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OV3_OV19_DET_POS   (0x02u)
#define BQ7982X_FAULT_OV3_OV19_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OV3_OV18_DET_POS   (0x01u)
#define BQ7982X_FAULT_OV3_OV18_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OV3_OV17_DET_POS   (0x00u)
#define BQ7982X_FAULT_OV3_OV17_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OV4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OV4_OFFSET    (0x0751u)
#define BQ7982X_FAULT_OV4_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OV4_OV26_DET_POS   (0x01u)
#define BQ7982X_FAULT_OV4_OV26_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OV4_OV25_DET_POS   (0x00u)
#define BQ7982X_FAULT_OV4_OV25_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UV1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UV1_OFFSET    (0x0752u)
#define BQ7982X_FAULT_UV1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UV1_UV8_DET_POS   (0x07u)
#define BQ7982X_FAULT_UV1_UV8_DET_MSK   (0x80u)

#define BQ7982X_FAULT_UV1_UV7_DET_POS   (0x06u)
#define BQ7982X_FAULT_UV1_UV7_DET_MSK   (0x40u)

#define BQ7982X_FAULT_UV1_UV6_DET_POS   (0x05u)
#define BQ7982X_FAULT_UV1_UV6_DET_MSK   (0x20u)

#define BQ7982X_FAULT_UV1_UV5_DET_POS   (0x04u)
#define BQ7982X_FAULT_UV1_UV5_DET_MSK   (0x10u)

#define BQ7982X_FAULT_UV1_UV4_DET_POS   (0x03u)
#define BQ7982X_FAULT_UV1_UV4_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UV1_UV3_DET_POS   (0x02u)
#define BQ7982X_FAULT_UV1_UV3_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UV1_UV2_DET_POS   (0x01u)
#define BQ7982X_FAULT_UV1_UV2_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UV1_UV1_DET_POS   (0x00u)
#define BQ7982X_FAULT_UV1_UV1_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UV2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UV2_OFFSET    (0x0753u)
#define BQ7982X_FAULT_UV2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UV2_UV16_DET_POS   (0x07u)
#define BQ7982X_FAULT_UV2_UV16_DET_MSK   (0x80u)

#define BQ7982X_FAULT_UV2_UV15_DET_POS   (0x06u)
#define BQ7982X_FAULT_UV2_UV15_DET_MSK   (0x40u)

#define BQ7982X_FAULT_UV2_UV14_DET_POS   (0x05u)
#define BQ7982X_FAULT_UV2_UV14_DET_MSK   (0x20u)

#define BQ7982X_FAULT_UV2_UV13_DET_POS   (0x04u)
#define BQ7982X_FAULT_UV2_UV13_DET_MSK   (0x10u)

#define BQ7982X_FAULT_UV2_UV12_DET_POS   (0x03u)
#define BQ7982X_FAULT_UV2_UV12_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UV2_UV11_DET_POS   (0x02u)
#define BQ7982X_FAULT_UV2_UV11_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UV2_UV10_DET_POS   (0x01u)
#define BQ7982X_FAULT_UV2_UV10_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UV2_UV9_DET_POS   (0x00u)
#define BQ7982X_FAULT_UV2_UV9_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UV3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UV3_OFFSET    (0x0754u)
#define BQ7982X_FAULT_UV3_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UV3_UV24_DET_POS   (0x07u)
#define BQ7982X_FAULT_UV3_UV24_DET_MSK   (0x80u)

#define BQ7982X_FAULT_UV3_UV23_DET_POS   (0x06u)
#define BQ7982X_FAULT_UV3_UV23_DET_MSK   (0x40u)

#define BQ7982X_FAULT_UV3_UV22_DET_POS   (0x05u)
#define BQ7982X_FAULT_UV3_UV22_DET_MSK   (0x20u)

#define BQ7982X_FAULT_UV3_UV21_DET_POS   (0x04u)
#define BQ7982X_FAULT_UV3_UV21_DET_MSK   (0x10u)

#define BQ7982X_FAULT_UV3_UV20_DET_POS   (0x03u)
#define BQ7982X_FAULT_UV3_UV20_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UV3_UV19_DET_POS   (0x02u)
#define BQ7982X_FAULT_UV3_UV19_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UV3_UV18_DET_POS   (0x01u)
#define BQ7982X_FAULT_UV3_UV18_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UV3_UV17_DET_POS   (0x00u)
#define BQ7982X_FAULT_UV3_UV17_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UV4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UV4_OFFSET    (0x0755u)
#define BQ7982X_FAULT_UV4_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UV4_UV26_DET_POS   (0x01u)
#define BQ7982X_FAULT_UV4_UV26_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UV4_UV25_DET_POS   (0x00u)
#define BQ7982X_FAULT_UV4_UV25_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OT1_OFFSET    (0x0757u)
#define BQ7982X_FAULT_OT1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OT1_OT8_DET_POS   (0x07u)
#define BQ7982X_FAULT_OT1_OT8_DET_MSK   (0x80u)

#define BQ7982X_FAULT_OT1_OT7_DET_POS   (0x06u)
#define BQ7982X_FAULT_OT1_OT7_DET_MSK   (0x40u)

