xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_FAULT_OT1_OT6_DET_POS   (0x05u)
#define BQ7982X_FAULT_OT1_OT6_DET_MSK   (0x20u)

#define BQ7982X_FAULT_OT1_OT5_DET_POS   (0x04u)
#define BQ7982X_FAULT_OT1_OT5_DET_MSK   (0x10u)

#define BQ7982X_FAULT_OT1_OT4_DET_POS   (0x03u)
#define BQ7982X_FAULT_OT1_OT4_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OT1_OT3_DET_POS   (0x02u)
#define BQ7982X_FAULT_OT1_OT3_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OT1_OT2_DET_POS   (0x01u)
#define BQ7982X_FAULT_OT1_OT2_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OT1_OT1_DET_POS   (0x00u)
#define BQ7982X_FAULT_OT1_OT1_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OT2_OFFSET    (0x0758u)
#define BQ7982X_FAULT_OT2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OT2_OT16_DET_POS   (0x07u)
#define BQ7982X_FAULT_OT2_OT16_DET_MSK   (0x80u)

#define BQ7982X_FAULT_OT2_OT15_DET_POS   (0x06u)
#define BQ7982X_FAULT_OT2_OT15_DET_MSK   (0x40u)

#define BQ7982X_FAULT_OT2_OT14_DET_POS   (0x05u)
#define BQ7982X_FAULT_OT2_OT14_DET_MSK   (0x20u)

#define BQ7982X_FAULT_OT2_OT13_DET_POS   (0x04u)
#define BQ7982X_FAULT_OT2_OT13_DET_MSK   (0x10u)

#define BQ7982X_FAULT_OT2_OT12_DET_POS   (0x03u)
#define BQ7982X_FAULT_OT2_OT12_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OT2_OT11_DET_POS   (0x02u)
#define BQ7982X_FAULT_OT2_OT11_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OT2_OT10_DET_POS   (0x01u)
#define BQ7982X_FAULT_OT2_OT10_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OT2_OT9_DET_POS   (0x00u)
#define BQ7982X_FAULT_OT2_OT9_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_OT3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_OT3_OFFSET    (0x0759u)
#define BQ7982X_FAULT_OT3_POR_VAL   (0x00u)

#define BQ7982X_FAULT_OT3_OT20_DET_POS   (0x03u)
#define BQ7982X_FAULT_OT3_OT20_DET_MSK   (0x08u)

#define BQ7982X_FAULT_OT3_OT19_DET_POS   (0x02u)
#define BQ7982X_FAULT_OT3_OT19_DET_MSK   (0x04u)

#define BQ7982X_FAULT_OT3_OT18_DET_POS   (0x01u)
#define BQ7982X_FAULT_OT3_OT18_DET_MSK   (0x02u)

#define BQ7982X_FAULT_OT3_OT17_DET_POS   (0x00u)
#define BQ7982X_FAULT_OT3_OT17_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UT1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UT1_OFFSET    (0x075Au)
#define BQ7982X_FAULT_UT1_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UT1_UT8_DET_POS   (0x07u)
#define BQ7982X_FAULT_UT1_UT8_DET_MSK   (0x80u)

#define BQ7982X_FAULT_UT1_UT7_DET_POS   (0x06u)
#define BQ7982X_FAULT_UT1_UT7_DET_MSK   (0x40u)

#define BQ7982X_FAULT_UT1_UT6_DET_POS   (0x05u)
#define BQ7982X_FAULT_UT1_UT6_DET_MSK   (0x20u)

#define BQ7982X_FAULT_UT1_UT5_DET_POS   (0x04u)
#define BQ7982X_FAULT_UT1_UT5_DET_MSK   (0x10u)

#define BQ7982X_FAULT_UT1_UT4_DET_POS   (0x03u)
#define BQ7982X_FAULT_UT1_UT4_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UT1_UT3_DET_POS   (0x02u)
#define BQ7982X_FAULT_UT1_UT3_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UT1_UT2_DET_POS   (0x01u)
#define BQ7982X_FAULT_UT1_UT2_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UT1_UT1_DET_POS   (0x00u)
#define BQ7982X_FAULT_UT1_UT1_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UT2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UT2_OFFSET    (0x075Bu)
#define BQ7982X_FAULT_UT2_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UT2_UT16_DET_POS   (0x07u)
#define BQ7982X_FAULT_UT2_UT16_DET_MSK   (0x80u)

#define BQ7982X_FAULT_UT2_UT15_DET_POS   (0x06u)
#define BQ7982X_FAULT_UT2_UT15_DET_MSK   (0x40u)

#define BQ7982X_FAULT_UT2_UT14_DET_POS   (0x05u)
#define BQ7982X_FAULT_UT2_UT14_DET_MSK   (0x20u)

#define BQ7982X_FAULT_UT2_UT13_DET_POS   (0x04u)
#define BQ7982X_FAULT_UT2_UT13_DET_MSK   (0x10u)

#define BQ7982X_FAULT_UT2_UT12_DET_POS   (0x03u)
#define BQ7982X_FAULT_UT2_UT12_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UT2_UT11_DET_POS   (0x02u)
#define BQ7982X_FAULT_UT2_UT11_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UT2_UT10_DET_POS   (0x01u)
#define BQ7982X_FAULT_UT2_UT10_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UT2_UT9_DET_POS   (0x00u)
#define BQ7982X_FAULT_UT2_UT9_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_UT3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_UT3_OFFSET    (0x075Cu)
#define BQ7982X_FAULT_UT3_POR_VAL   (0x00u)

#define BQ7982X_FAULT_UT3_UT20_DET_POS   (0x03u)
#define BQ7982X_FAULT_UT3_UT20_DET_MSK   (0x08u)

#define BQ7982X_FAULT_UT3_UT19_DET_POS   (0x02u)
#define BQ7982X_FAULT_UT3_UT19_DET_MSK   (0x04u)

#define BQ7982X_FAULT_UT3_UT18_DET_POS   (0x01u)
#define BQ7982X_FAULT_UT3_UT18_DET_MSK   (0x02u)

#define BQ7982X_FAULT_UT3_UT17_DET_POS   (0x00u)
#define BQ7982X_FAULT_UT3_UT17_DET_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_GPIO1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_GPIO1_OFFSET    (0x075Eu)
#define BQ7982X_FAULT_ADC_GPIO1_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO8_AFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO8_AFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO7_AFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO7_AFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO6_AFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO6_AFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO5_AFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO5_AFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO4_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO4_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO3_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO3_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO2_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO2_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_GPIO1_GPIO1_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_GPIO1_GPIO1_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_GPIO2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_GPIO2_OFFSET    (0x075Fu)
#define BQ7982X_FAULT_ADC_GPIO2_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO16_AFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO16_AFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO15_AFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO15_AFAIL   (0x40u)

