xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO14_AFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO14_AFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO13_AFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO13_AFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO12_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO12_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO11_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO11_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO10_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO10_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_GPIO2_GPIO9_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_GPIO2_GPIO9_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_GPIO3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_GPIO3_OFFSET    (0x0760u)
#define BQ7982X_FAULT_ADC_GPIO3_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_GPIO3_GPIO20_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_GPIO3_GPIO20_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_GPIO3_GPIO19_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_GPIO3_GPIO19_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_GPIO3_GPIO18_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_GPIO3_GPIO18_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_GPIO3_GPIO17_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_GPIO3_GPIO17_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_VCELL1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_VCELL1_OFFSET    (0x0761u)
#define BQ7982X_FAULT_ADC_VCELL1_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL8_AFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL8_AFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL7_AFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL7_AFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL6_AFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL6_AFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL5_AFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL5_AFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL4_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL4_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL3_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL3_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL2_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL2_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_VCELL1_CELL1_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_VCELL1_CELL1_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_VCELL2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_VCELL2_OFFSET    (0x0762u)
#define BQ7982X_FAULT_ADC_VCELL2_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL16_AFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL16_AFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL15_AFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL15_AFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL14_AFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL14_AFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL13_AFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL13_AFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL12_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL12_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL11_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL11_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL10_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL10_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_VCELL2_CELL9_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_VCELL2_CELL9_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_VCELL3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_VCELL3_OFFSET    (0x0763u)
#define BQ7982X_FAULT_ADC_VCELL3_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL24_AFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL24_AFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL23_AFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL23_AFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL22_AFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL22_AFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL21_AFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL21_AFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL20_AFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL20_AFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL19_AFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL19_AFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL18_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL18_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_VCELL3_CELL17_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_VCELL3_CELL17_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_VCELL4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_VCELL4_OFFSET    (0x0764u)
#define BQ7982X_FAULT_ADC_VCELL4_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_VCELL4_CELL26_AFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_VCELL4_CELL26_AFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_VCELL4_CELL25_AFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_VCELL4_CELL25_AFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_DIG1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_DIG1_OFFSET    (0x0765u)
#define BQ7982X_FAULT_ADC_DIG1_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL8_DFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL8_DFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL7_DFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL7_DFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL6_DFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL6_DFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL5_DFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL5_DFAIL   (0x10u)

