xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_FAULT_ADC_DIG1_CELL4_DFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL4_DFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL3_DFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL3_DFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL2_DFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL2_DFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_DIG1_CELL1_DFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_DIG1_CELL1_DFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_DIG2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_DIG2_OFFSET    (0x0766u)
#define BQ7982X_FAULT_ADC_DIG2_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL16_DFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL16_DFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL15_DFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL15_DFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL14_DFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL14_DFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL13_DFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL13_DFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL12_DFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL12_DFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL11_DFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL11_DFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL10_DFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL10_DFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_DIG2_CELL9_DFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_DIG2_CELL9_DFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_DIG3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_DIG3_OFFSET    (0x0767u)
#define BQ7982X_FAULT_ADC_DIG3_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL24_DFAIL   (0x07u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL24_DFAIL   (0x80u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL23_DFAIL   (0x06u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL23_DFAIL   (0x40u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL22_DFAIL   (0x05u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL22_DFAIL   (0x20u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL21_DFAIL   (0x04u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL21_DFAIL   (0x10u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL20_DFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL20_DFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL19_DFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL19_DFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL18_DFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL18_DFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_DIG3_CELL17_DFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_DIG3_CELL17_DFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_DIG4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_DIG4_OFFSET    (0x0768u)
#define BQ7982X_FAULT_ADC_DIG4_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_DIG4_CELL26_DFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_DIG4_CELL26_DFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_DIG4_CELL25_DFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_DIG4_CELL25_DFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_DIG5           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_DIG5_OFFSET    (0x0769u)
#define BQ7982X_FAULT_ADC_DIG5_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_DIG5_CS_DFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_DIG5_CS_DFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_DIG5_GP3_DFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_DIG5_GP3_DFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_DIG5_GP1_DFAIL   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_DIG5_GP1_DFAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_ADC_MISC           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_ADC_MISC_OFFSET    (0x076Au)
#define BQ7982X_FAULT_ADC_MISC_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_ADC_MISC_ADC_PFAIL   (0x03u)
#define BQ7982X_MSK_FAULT_ADC_MISC_ADC_PFAIL   (0x08u)

#define BQ7982X_POS_FAULT_ADC_MISC_DIAG_MEAS_PFAIL   (0x02u)
#define BQ7982X_MSK_FAULT_ADC_MISC_DIAG_MEAS_PFAIL   (0x04u)

#define BQ7982X_POS_FAULT_ADC_MISC_DIAG_ANA_PFAIL   (0x01u)
#define BQ7982X_MSK_FAULT_ADC_MISC_DIAG_ANA_PFAIL   (0x02u)

#define BQ7982X_POS_FAULT_ADC_MISC_DIAG_ABORT   (0x00u)
#define BQ7982X_MSK_FAULT_ADC_MISC_DIAG_ABORT   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_CB_FETOW1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_CB_FETOW1_OFFSET    (0x076Cu)
#define BQ7982X_FAULT_CB_FETOW1_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB8_FAIL   (0x07u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB8_FAIL   (0x80u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB7_FAIL   (0x06u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB7_FAIL   (0x40u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB6_FAIL   (0x05u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB6_FAIL   (0x20u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB5_FAIL   (0x04u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB5_FAIL   (0x10u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB4_FAIL   (0x03u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB4_FAIL   (0x08u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB3_FAIL   (0x02u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB3_FAIL   (0x04u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB2_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB2_FAIL   (0x02u)

#define BQ7982X_POS_FAULT_CB_FETOW1_CB1_FAIL   (0x00u)
#define BQ7982X_MSK_FAULT_CB_FETOW1_CB1_FAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_CB_FETOW2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_CB_FETOW2_OFFSET    (0x076Du)
#define BQ7982X_FAULT_CB_FETOW2_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB16_FAIL   (0x07u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB16_FAIL   (0x80u)

