xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_FAULT_CB_FETOW2_CB15_FAIL   (0x06u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB15_FAIL   (0x40u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB14_FAIL   (0x05u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB14_FAIL   (0x20u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB13_FAIL   (0x04u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB13_FAIL   (0x10u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB12_FAIL   (0x03u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB12_FAIL   (0x08u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB11_FAIL   (0x02u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB11_FAIL   (0x04u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB10_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB10_FAIL   (0x02u)

#define BQ7982X_POS_FAULT_CB_FETOW2_CB9_FAIL   (0x00u)
#define BQ7982X_MSK_FAULT_CB_FETOW2_CB9_FAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_CB_FETOW3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_CB_FETOW3_OFFSET    (0x076Eu)
#define BQ7982X_FAULT_CB_FETOW3_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB24_FAIL   (0x07u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB24_FAIL   (0x80u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB23_FAIL   (0x06u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB23_FAIL   (0x40u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB22_FAIL   (0x05u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB22_FAIL   (0x20u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB21_FAIL   (0x04u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB21_FAIL   (0x10u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB20_FAIL   (0x03u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB20_FAIL   (0x08u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB19_FAIL   (0x02u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB19_FAIL   (0x04u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB18_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB18_FAIL   (0x02u)

#define BQ7982X_POS_FAULT_CB_FETOW3_CB17_FAIL   (0x00u)
#define BQ7982X_MSK_FAULT_CB_FETOW3_CB17_FAIL   (0x01u)

/* --------------------------------------------------------------------------
 * FAULT_CB_FETOW4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_FAULT_CB_FETOW4_OFFSET    (0x076Fu)
#define BQ7982X_FAULT_CB_FETOW4_POR_VAL   (0x00u)

#define BQ7982X_POS_FAULT_CB_FETOW4_CB26_FAIL   (0x01u)
#define BQ7982X_MSK_FAULT_CB_FETOW4_CB26_FAIL   (0x02u)

#define BQ7982X_POS_FAULT_CB_FETOW4_CB25_FAIL   (0x00u)
#define BQ7982X_MSK_FAULT_CB_FETOW4_CB25_FAIL   (0x01u)

/* --------------------------------------------------------------------------
 * PROP_DLY_STAT1     (RP):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PROP_DLY_STAT1_OFFSET    (0x0780u)
#define BQ7982X_PROP_DLY_STAT1_POR_VAL   (0x00u)

#define BQ7982X_PROP_DLY_STAT1_COUNTH_POS   (0x00u)
#define BQ7982X_PROP_DLY_STAT1_COUNTH_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * PROP_DLY_STAT2     (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_PROP_DLY_STAT2_OFFSET    (0x0781u)
#define BQ7982X_PROP_DLY_STAT2_POR_VAL   (0x00u)

#define BQ7982X_PROP_DLY_STAT2_COUNTL_POS   (0x00u)
#define BQ7982X_PROP_DLY_STAT2_COUNTL_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * HFO_FREQ_STAT1     (RP):
 * -------------------------------------------------------------------------- */
#define BQ7982X_HFO_FREQ_STAT1_OFFSET    (0x0782u)
#define BQ7982X_HFO_FREQ_STAT1_POR_VAL   (0x00u)

#define BQ7982X_HFO_FREQ_STAT1_FREQH_POS   (0x00u)
#define BQ7982X_HFO_FREQ_STAT1_FREQH_MSK   (0x03u)

/* --------------------------------------------------------------------------
 * HFO_FREQ_STAT2     (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_HFO_FREQ_STAT2_OFFSET    (0x0783u)
#define BQ7982X_HFO_FREQ_STAT2_POR_VAL   (0x00u)

#define BQ7982X_HFO_FREQ_STAT2_FREQL_POS   (0x00u)
#define BQ7982X_HFO_FREQ_STAT2_FREQL_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_STAT1     (RP):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_STAT1_OFFSET    (0x0784u)
#define BQ7982X_DIG_SYNC_STAT1_POR_VAL   (0x00u)

#define BQ7982X_POS_DIG_SYNC_STAT1_SYNC_COUNTH   (0x00u)
#define BQ7982X_MSK_DIG_SYNC_STAT1_SYNC_COUNTH   (0xFFu)

/* --------------------------------------------------------------------------
 * DIG_SYNC_STAT2     (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIG_SYNC_STAT2_OFFSET    (0x0785u)
#define BQ7982X_DIG_SYNC_STAT2_POR_VAL   (0x00u)

#define BQ7982X_POS_DIG_SYNC_STAT2_SYNC_COUNTL   (0x00u)
#define BQ7982X_MSK_DIG_SYNC_STAT2_SYNC_COUNTL   (0xFFu)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_STAT1     (RP):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_STAT1_OFFSET    (0x0786u)
#define BQ7982X_SMART_FREEZE_STAT1_POR_VAL   (0x00u)

#define BQ7982X_POS_SMART_FREEZE_STAT1_SAMP_COUNTH   (0x00u)
#define BQ7982X_MSK_SMART_FREEZE_STAT1_SAMP_COUNTH   (0x1Fu)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_STAT2     (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_STAT2_OFFSET    (0x0787u)
#define BQ7982X_SMART_FREEZE_STAT2_POR_VAL   (0x00u)

#define BQ7982X_POS_SMART_FREEZE_STAT2_SAMP_COUNTL   (0x00u)
#define BQ7982X_MSK_SMART_FREEZE_STAT2_SAMP_COUNTL   (0xFFu)

/* --------------------------------------------------------------------------
 * SMART_FREEZE_STAT3     (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMART_FREEZE_STAT3_OFFSET    (0x0788u)
#define BQ7982X_SMART_FREEZE_STAT3_POR_VAL   (0x00u)

#define BQ7982X_POS_SMART_FREEZE_STAT3_SLOT_COUNT   (0x00u)
#define BQ7982X_MSK_SMART_FREEZE_STAT3_SLOT_COUNT   (0xFFu)

/* --------------------------------------------------------------------------
 * SYNC_STAT1     (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SYNC_STAT1_OFFSET    (0x0789u)
#define BQ7982X_SYNC_STAT1_POR_VAL   (0x00u)

#define BQ7982X_POS_SYNC_STAT1_HFO_FREQ_DONE   (0x05u)
#define BQ7982X_MSK_SYNC_STAT1_HFO_FREQ_DONE   (0x20u)

#define BQ7982X_POS_SYNC_STAT1_PROP_DLY_DONE   (0x04u)
#define BQ7982X_MSK_SYNC_STAT1_PROP_DLY_DONE   (0x10u)

