xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_SYNC_STAT1_PLL_LOCK_POS        (0x03u)
#define BQ7982X_SYNC_STAT1_PLL_LOCK_MSK        (0x08u)

#define BQ7982X_POS_SYNC_STAT1_PLL_SYNC_DONE   (0x02u)
#define BQ7982X_MSK_SYNC_STAT1_PLL_SYNC_DONE   (0x04u)

#define BQ7982X_POS_SYNC_STAT1_DIG_SYNC_DONE   (0x01u)
#define BQ7982X_MSK_SYNC_STAT1_DIG_SYNC_DONE   (0x02u)

#define BQ7982X_SYNC_STAT1_DRDY_SF_POS   (0x00u)
#define BQ7982X_SYNC_STAT1_DRDY_SF_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * VCELL26_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL26_HI_OFFSET    (0x079Cu)
#define BQ7982X_VCELL26_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL26_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL26_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL26_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL26_LO_OFFSET    (0x079Du)
#define BQ7982X_VCELL26_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL26_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL26_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL25_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL25_HI_OFFSET    (0x079Eu)
#define BQ7982X_VCELL25_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL25_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL25_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL25_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL25_LO_OFFSET    (0x079Fu)
#define BQ7982X_VCELL25_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL25_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL25_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL24_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL24_HI_OFFSET    (0x07A0u)
#define BQ7982X_VCELL24_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL24_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL24_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL24_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL24_LO_OFFSET    (0x07A1u)
#define BQ7982X_VCELL24_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL24_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL24_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL23_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL23_HI_OFFSET    (0x07A2u)
#define BQ7982X_VCELL23_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL23_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL23_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL23_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL23_LO_OFFSET    (0x07A3u)
#define BQ7982X_VCELL23_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL23_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL23_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL22_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL22_HI_OFFSET    (0x07A4u)
#define BQ7982X_VCELL22_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL22_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL22_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL22_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL22_LO_OFFSET    (0x07A5u)
#define BQ7982X_VCELL22_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL22_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL22_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL21_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL21_HI_OFFSET    (0x07A6u)
#define BQ7982X_VCELL21_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL21_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL21_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL21_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL21_LO_OFFSET    (0x07A7u)
#define BQ7982X_VCELL21_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL21_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL21_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL20_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL20_HI_OFFSET    (0x07A8u)
#define BQ7982X_VCELL20_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL20_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL20_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL20_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL20_LO_OFFSET    (0x07A9u)
#define BQ7982X_VCELL20_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL20_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL20_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL19_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL19_HI_OFFSET    (0x07AAu)
#define BQ7982X_VCELL19_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL19_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL19_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL19_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL19_LO_OFFSET    (0x07ABu)
#define BQ7982X_VCELL19_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL19_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL19_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL18_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL18_HI_OFFSET    (0x07ACu)
#define BQ7982X_VCELL18_HI_POR_VAL   (0xFFu)

