xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_VCELL18_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL18_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL18_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL18_LO_OFFSET    (0x07ADu)
#define BQ7982X_VCELL18_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL18_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL18_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL17_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL17_HI_OFFSET    (0x07AEu)
#define BQ7982X_VCELL17_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL17_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL17_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL17_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL17_LO_OFFSET    (0x07AFu)
#define BQ7982X_VCELL17_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL17_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL17_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL16_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL16_HI_OFFSET    (0x07B0u)
#define BQ7982X_VCELL16_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL16_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL16_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL16_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL16_LO_OFFSET    (0x07B1u)
#define BQ7982X_VCELL16_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL16_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL16_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL15_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL15_HI_OFFSET    (0x07B2u)
#define BQ7982X_VCELL15_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL15_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL15_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL15_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL15_LO_OFFSET    (0x07B3u)
#define BQ7982X_VCELL15_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL15_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL15_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL14_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL14_HI_OFFSET    (0x07B4u)
#define BQ7982X_VCELL14_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL14_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL14_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL14_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL14_LO_OFFSET    (0x07B5u)
#define BQ7982X_VCELL14_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL14_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL14_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL13_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL13_HI_OFFSET    (0x07B6u)
#define BQ7982X_VCELL13_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL13_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL13_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL13_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL13_LO_OFFSET    (0x07B7u)
#define BQ7982X_VCELL13_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL13_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL13_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL12_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL12_HI_OFFSET    (0x07B8u)
#define BQ7982X_VCELL12_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL12_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL12_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL12_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL12_LO_OFFSET    (0x07B9u)
#define BQ7982X_VCELL12_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL12_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL12_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL11_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL11_HI_OFFSET    (0x07BAu)
#define BQ7982X_VCELL11_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL11_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL11_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL11_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL11_LO_OFFSET    (0x07BBu)
#define BQ7982X_VCELL11_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL11_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL11_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL10_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL10_HI_OFFSET    (0x07BCu)
#define BQ7982X_VCELL10_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL10_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL10_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL10_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL10_LO_OFFSET    (0x07BDu)
#define BQ7982X_VCELL10_LO_POR_VAL   (0xFFu)

