xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_VCELL10_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL10_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL9_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL9_HI_OFFSET    (0x07BEu)
#define BQ7982X_VCELL9_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL9_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL9_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL9_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL9_LO_OFFSET    (0x07BFu)
#define BQ7982X_VCELL9_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL9_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL9_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL8_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL8_HI_OFFSET    (0x07C0u)
#define BQ7982X_VCELL8_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL8_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL8_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL8_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL8_LO_OFFSET    (0x07C1u)
#define BQ7982X_VCELL8_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL8_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL8_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL7_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL7_HI_OFFSET    (0x07C2u)
#define BQ7982X_VCELL7_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL7_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL7_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL7_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL7_LO_OFFSET    (0x07C3u)
#define BQ7982X_VCELL7_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL7_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL7_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL6_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL6_HI_OFFSET    (0x07C4u)
#define BQ7982X_VCELL6_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL6_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL6_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL6_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL6_LO_OFFSET    (0x07C5u)
#define BQ7982X_VCELL6_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL6_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL6_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL5_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL5_HI_OFFSET    (0x07C6u)
#define BQ7982X_VCELL5_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL5_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL5_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL5_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL5_LO_OFFSET    (0x07C7u)
#define BQ7982X_VCELL5_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL5_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL5_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL4_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL4_HI_OFFSET    (0x07C8u)
#define BQ7982X_VCELL4_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL4_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL4_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL4_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL4_LO_OFFSET    (0x07C9u)
#define BQ7982X_VCELL4_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL4_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL4_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL3_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL3_HI_OFFSET    (0x07CAu)
#define BQ7982X_VCELL3_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL3_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL3_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL3_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL3_LO_OFFSET    (0x07CBu)
#define BQ7982X_VCELL3_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL3_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL3_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL2_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL2_HI_OFFSET    (0x07CCu)
#define BQ7982X_VCELL2_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL2_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL2_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL2_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL2_LO_OFFSET    (0x07CDu)
#define BQ7982X_VCELL2_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL2_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL2_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL1_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL1_HI_OFFSET    (0x07CEu)
#define BQ7982X_VCELL1_HI_POR_VAL   (0xFFu)

#define BQ7982X_VCELL1_HI_RESULT_POS   (0x00u)
#define BQ7982X_VCELL1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL1_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL1_LO_OFFSET    (0x07CFu)
#define BQ7982X_VCELL1_LO_POR_VAL   (0xFFu)

#define BQ7982X_VCELL1_LO_RESULT_POS   (0x00u)
#define BQ7982X_VCELL1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL_ACT_SUM_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_ACT_SUM_HI_OFFSET    (0x07D0u)
#define BQ7982X_VCELL_ACT_SUM_HI_POR_VAL   (0xFFu)

