xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_VCELL_ACT_SUM_HI_RESULT   (0x00u)
#define BQ7982X_MSK_VCELL_ACT_SUM_HI_RESULT   (0xFFu)

/* --------------------------------------------------------------------------
 * VCELL_ACT_SUM_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_VCELL_ACT_SUM_LO_OFFSET    (0x07D1u)
#define BQ7982X_VCELL_ACT_SUM_LO_POR_VAL   (0xFFu)

#define BQ7982X_POS_VCELL_ACT_SUM_LO_RESULT   (0x00u)
#define BQ7982X_MSK_VCELL_ACT_SUM_LO_RESULT   (0xFFu)

/* --------------------------------------------------------------------------
 * BAT_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAT_HI_OFFSET    (0x07D2u)
#define BQ7982X_BAT_HI_POR_VAL   (0xFFu)

#define BQ7982X_BAT_HI_RESULT_POS   (0x00u)
#define BQ7982X_BAT_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * BAT_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_BAT_LO_OFFSET    (0x07D3u)
#define BQ7982X_BAT_LO_POR_VAL   (0xFFu)

#define BQ7982X_BAT_LO_RESULT_POS   (0x00u)
#define BQ7982X_BAT_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CURRENT1_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CURRENT1_HI_OFFSET    (0x07D4u)
#define BQ7982X_CURRENT1_HI_POR_VAL   (0x80u)

#define BQ7982X_CURRENT1_HI_RESULT_POS   (0x00u)
#define BQ7982X_CURRENT1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CURRENT1_MID           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CURRENT1_MID_OFFSET    (0x07D5u)
#define BQ7982X_CURRENT1_MID_POR_VAL   (0x00u)

#define BQ7982X_CURRENT1_MID_RESULT_POS   (0x00u)
#define BQ7982X_CURRENT1_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CURRENT1_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CURRENT1_LO_OFFSET    (0x07D6u)
#define BQ7982X_CURRENT1_LO_POR_VAL   (0x00u)

#define BQ7982X_CURRENT1_LO_RESULT_POS   (0x00u)
#define BQ7982X_CURRENT1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * SMON_PEAK_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMON_PEAK_HI_OFFSET    (0x0810u)
#define BQ7982X_SMON_PEAK_HI_POR_VAL   (0xFFu)

#define BQ7982X_SMON_PEAK_HI_RESULT_POS   (0x00u)
#define BQ7982X_SMON_PEAK_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * SMON_PEAK_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_SMON_PEAK_LO_OFFSET    (0x0811u)
#define BQ7982X_SMON_PEAK_LO_POR_VAL   (0xFFu)

#define BQ7982X_SMON_PEAK_LO_RESULT_POS   (0x00u)
#define BQ7982X_SMON_PEAK_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO1_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO1_HI_OFFSET    (0x0812u)
#define BQ7982X_GPIO1_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO1_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO1_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO1_LO_OFFSET    (0x0813u)
#define BQ7982X_GPIO1_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO1_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO2_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO2_HI_OFFSET    (0x0814u)
#define BQ7982X_GPIO2_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO2_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO2_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO2_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO2_LO_OFFSET    (0x0815u)
#define BQ7982X_GPIO2_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO2_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO2_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO3_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO3_HI_OFFSET    (0x0816u)
#define BQ7982X_GPIO3_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO3_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO3_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO3_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO3_LO_OFFSET    (0x0817u)
#define BQ7982X_GPIO3_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO3_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO3_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO4_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO4_HI_OFFSET    (0x0818u)
#define BQ7982X_GPIO4_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO4_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO4_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO4_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO4_LO_OFFSET    (0x0819u)
#define BQ7982X_GPIO4_LO_POR_VAL   (0xFFu)

