xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_GPIO4_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO4_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO5_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO5_HI_OFFSET    (0x081Au)
#define BQ7982X_GPIO5_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO5_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO5_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO5_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO5_LO_OFFSET    (0x081Bu)
#define BQ7982X_GPIO5_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO5_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO5_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO6_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO6_HI_OFFSET    (0x081Cu)
#define BQ7982X_GPIO6_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO6_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO6_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO6_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO6_LO_OFFSET    (0x081Du)
#define BQ7982X_GPIO6_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO6_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO6_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO7_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO7_HI_OFFSET    (0x081Eu)
#define BQ7982X_GPIO7_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO7_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO7_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO7_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO7_LO_OFFSET    (0x081Fu)
#define BQ7982X_GPIO7_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO7_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO7_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO8_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO8_HI_OFFSET    (0x0820u)
#define BQ7982X_GPIO8_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO8_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO8_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO8_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO8_LO_OFFSET    (0x0821u)
#define BQ7982X_GPIO8_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO8_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO8_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO9_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO9_HI_OFFSET    (0x0822u)
#define BQ7982X_GPIO9_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO9_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO9_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO9_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO9_LO_OFFSET    (0x0823u)
#define BQ7982X_GPIO9_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO9_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO9_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO10_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO10_HI_OFFSET    (0x0824u)
#define BQ7982X_GPIO10_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO10_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO10_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO10_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO10_LO_OFFSET    (0x0825u)
#define BQ7982X_GPIO10_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO10_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO10_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO11_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO11_HI_OFFSET    (0x0826u)
#define BQ7982X_GPIO11_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO11_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO11_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO11_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO11_LO_OFFSET    (0x0827u)
#define BQ7982X_GPIO11_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO11_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO11_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO12_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO12_HI_OFFSET    (0x0828u)
#define BQ7982X_GPIO12_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO12_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO12_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO12_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO12_LO_OFFSET    (0x0829u)
#define BQ7982X_GPIO12_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO12_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO12_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO13_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO13_HI_OFFSET    (0x082Au)
#define BQ7982X_GPIO13_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO13_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO13_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO13_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO13_LO_OFFSET    (0x082Bu)
#define BQ7982X_GPIO13_LO_POR_VAL   (0xFFu)

