xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_GPIO13_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO13_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO14_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO14_HI_OFFSET    (0x082Cu)
#define BQ7982X_GPIO14_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO14_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO14_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO14_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO14_LO_OFFSET    (0x082Du)
#define BQ7982X_GPIO14_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO14_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO14_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO15_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO15_HI_OFFSET    (0x082Eu)
#define BQ7982X_GPIO15_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO15_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO15_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO15_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO15_LO_OFFSET    (0x082Fu)
#define BQ7982X_GPIO15_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO15_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO15_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO16_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO16_HI_OFFSET    (0x0830u)
#define BQ7982X_GPIO16_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO16_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO16_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO16_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO16_LO_OFFSET    (0x0831u)
#define BQ7982X_GPIO16_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO16_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO16_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO17_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO17_HI_OFFSET    (0x0832u)
#define BQ7982X_GPIO17_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO17_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO17_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO17_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO17_LO_OFFSET    (0x0833u)
#define BQ7982X_GPIO17_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO17_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO17_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO18_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO18_HI_OFFSET    (0x0834u)
#define BQ7982X_GPIO18_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO18_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO18_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO18_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO18_LO_OFFSET    (0x0835u)
#define BQ7982X_GPIO18_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO18_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO18_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO19_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO19_HI_OFFSET    (0x0836u)
#define BQ7982X_GPIO19_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO19_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO19_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO19_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO19_LO_OFFSET    (0x0837u)
#define BQ7982X_GPIO19_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO19_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO19_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO20_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO20_HI_OFFSET    (0x0838u)
#define BQ7982X_GPIO20_HI_POR_VAL   (0xFFu)

#define BQ7982X_GPIO20_HI_RESULT_POS   (0x00u)
#define BQ7982X_GPIO20_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * GPIO20_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_GPIO20_LO_OFFSET    (0x0839u)
#define BQ7982X_GPIO20_LO_POR_VAL   (0xFFu)

#define BQ7982X_GPIO20_LO_RESULT_POS   (0x00u)
#define BQ7982X_GPIO20_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_MAIN_HI           (RP):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_MAIN_HI_OFFSET    (0x0860u)
#define BQ7982X_DIAG1_MAIN_HI_POR_VAL   (0xFFu)

#define BQ7982X_DIAG1_MAIN_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_MAIN_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_MAIN_MID           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_MAIN_MID_OFFSET    (0x0861u)
#define BQ7982X_DIAG1_MAIN_MID_POR_VAL   (0xFFu)

#define BQ7982X_DIAG1_MAIN_MID_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_MAIN_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_MAIN_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_MAIN_LO_OFFSET    (0x0862u)
#define BQ7982X_DIAG1_MAIN_LO_POR_VAL   (0xFFu)

#define BQ7982X_DIAG1_MAIN_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_MAIN_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_RDNT_HI           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_RDNT_HI_OFFSET    (0x0863u)
#define BQ7982X_DIAG1_RDNT_HI_POR_VAL   (0xFFu)

#define BQ7982X_DIAG1_RDNT_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_RDNT_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_RDNT_MID           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_RDNT_MID_OFFSET    (0x0864u)
#define BQ7982X_DIAG1_RDNT_MID_POR_VAL   (0xFFu)

#define BQ7982X_DIAG1_RDNT_MID_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_RDNT_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG1_RDNT_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG1_RDNT_LO_OFFSET    (0x0865u)
#define BQ7982X_DIAG1_RDNT_LO_POR_VAL   (0xFFu)

