xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_DIAG1_RDNT_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIAG1_RDNT_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIETEMP1_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIETEMP1_HI_OFFSET    (0x0866u)
#define BQ7982X_DIETEMP1_HI_POR_VAL   (0x80u)

#define BQ7982X_DIETEMP1_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIETEMP1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIETEMP1_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIETEMP1_LO_OFFSET    (0x0867u)
#define BQ7982X_DIETEMP1_LO_POR_VAL   (0x00u)

#define BQ7982X_DIETEMP1_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIETEMP1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIETEMP2_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIETEMP2_HI_OFFSET    (0x0868u)
#define BQ7982X_DIETEMP2_HI_POR_VAL   (0x80u)

#define BQ7982X_DIETEMP2_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIETEMP2_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIETEMP2_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIETEMP2_LO_OFFSET    (0x0869u)
#define BQ7982X_DIETEMP2_LO_POR_VAL   (0x00u)

#define BQ7982X_DIETEMP2_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIETEMP2_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * REF_CAP_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_REF_CAP_HI_OFFSET    (0x086Au)
#define BQ7982X_REF_CAP_HI_POR_VAL   (0xFFu)

#define BQ7982X_REF_CAP_HI_RESULT_POS   (0x00u)
#define BQ7982X_REF_CAP_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * REF_CAP_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_REF_CAP_LO_OFFSET    (0x086Bu)
#define BQ7982X_REF_CAP_LO_POR_VAL   (0xFFu)

#define BQ7982X_REF_CAP_LO_RESULT_POS   (0x00u)
#define BQ7982X_REF_CAP_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG_D1_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_D1_HI_OFFSET    (0x086Cu)
#define BQ7982X_DIAG_D1_HI_POR_VAL   (0xFFu)

#define BQ7982X_DIAG_D1_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIAG_D1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG_D1_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_D1_LO_OFFSET    (0x086Du)
#define BQ7982X_DIAG_D1_LO_POR_VAL   (0xFFu)

#define BQ7982X_DIAG_D1_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIAG_D1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG_D2_HI           (RM):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_D2_HI_OFFSET    (0x086Eu)
#define BQ7982X_DIAG_D2_HI_POR_VAL   (0xFFu)

#define BQ7982X_DIAG_D2_HI_RESULT_POS   (0x00u)
#define BQ7982X_DIAG_D2_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DIAG_D2_LO           (RS):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DIAG_D2_LO_OFFSET    (0x086Fu)
#define BQ7982X_DIAG_D2_LO_POR_VAL   (0xFFu)

#define BQ7982X_DIAG_D2_LO_RESULT_POS   (0x00u)
#define BQ7982X_DIAG_D2_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * REF_CAP_T0_HI           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_REF_CAP_T0_HI_OFFSET    (0x0870u)
#define BQ7982X_REF_CAP_T0_HI_POR_VAL   (0xFFu)

#define BQ7982X_REF_CAP_T0_HI_RESULT_POS   (0x00u)
#define BQ7982X_REF_CAP_T0_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * REF_CAP_T0_LO           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_REF_CAP_T0_LO_OFFSET    (0x0871u)
#define BQ7982X_REF_CAP_T0_LO_POR_VAL   (0xFFu)

#define BQ7982X_REF_CAP_T0_LO_RESULT_POS   (0x00u)
#define BQ7982X_REF_CAP_T0_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * I2C_RD_DATA           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_I2C_RD_DATA_OFFSET    (0x0880u)
#define BQ7982X_I2C_RD_DATA_POR_VAL   (0x00u)

#define BQ7982X_I2C_RD_DATA_DATA_POS   (0x00u)
#define BQ7982X_I2C_RD_DATA_DATA_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CSPI_RX4           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_RX4_OFFSET    (0x0890u)
#define BQ7982X_CSPI_RX4_POR_VAL   (0x00u)

#define BQ7982X_CSPI_RX4_DATA_POS   (0x00u)
#define BQ7982X_CSPI_RX4_DATA_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CSPI_RX3           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_RX3_OFFSET    (0x0891u)
#define BQ7982X_CSPI_RX3_POR_VAL   (0x00u)

#define BQ7982X_CSPI_RX3_DATA_POS   (0x00u)
#define BQ7982X_CSPI_RX3_DATA_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CSPI_RX2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_RX2_OFFSET    (0x0892u)
#define BQ7982X_CSPI_RX2_POR_VAL   (0x00u)

#define BQ7982X_CSPI_RX2_DATA_POS   (0x00u)
#define BQ7982X_CSPI_RX2_DATA_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * CSPI_RX1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_CSPI_RX1_OFFSET    (0x0893u)
#define BQ7982X_CSPI_RX1_POR_VAL   (0x00u)

