xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_CSPI_RX1_DATA_POS   (0x00u)
#define BQ7982X_CSPI_RX1_DATA_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_STAT            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_STAT_OFFSET    (0x0A00u)
#define BQ7982X_EIS_STAT_POR_VAL   (0x00u)

#define BQ7982X_EIS_STAT_EIS_DFT_DRDY_POS   (0x03u)
#define BQ7982X_EIS_STAT_EIS_DFT_DRDY_MSK   (0x08u)

#define BQ7982X_EIS_STAT_EIS_DFT_RUN_POS   (0x02u)
#define BQ7982X_EIS_STAT_EIS_DFT_RUN_MSK   (0x04u)

#define BQ7982X_EIS_STAT_EIS_DFE_RUN_POS   (0x01u)
#define BQ7982X_EIS_STAT_EIS_DFE_RUN_MSK   (0x02u)

#define BQ7982X_EIS_STAT_EIS_PWM_RUN_POS   (0x00u)
#define BQ7982X_EIS_STAT_EIS_PWM_RUN_MSK   (0x01u)

/* --------------------------------------------------------------------------
 * EIS_SYNC_PHASE1            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_SYNC_PHASE1_OFFSET    (0x0A01u)
#define BQ7982X_EIS_SYNC_PHASE1_POR_VAL   (0x80u)

#define BQ7982X_POS_EIS_SYNC_PHASE1_RESULT   (0x00u)
#define BQ7982X_MSK_EIS_SYNC_PHASE1_RESULT   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_SYNC_PHASE2            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_SYNC_PHASE2_OFFSET    (0x0A02u)
#define BQ7982X_EIS_SYNC_PHASE2_POR_VAL   (0x00u)

#define BQ7982X_POS_EIS_SYNC_PHASE2_RESULT   (0x00u)
#define BQ7982X_MSK_EIS_SYNC_PHASE2_RESULT   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_SYNC_PHASE3            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_SYNC_PHASE3_OFFSET    (0x0A03u)
#define BQ7982X_EIS_SYNC_PHASE3_POR_VAL   (0x00u)

#define BQ7982X_POS_EIS_SYNC_PHASE3_RESULT   (0x00u)
#define BQ7982X_MSK_EIS_SYNC_PHASE3_RESULT   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_CS_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_CS_HI_OFFSET    (0x0A10u)
#define BQ7982X_EIS_CS_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_CS_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_CS_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_CS_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_CS_MID_OFFSET    (0x0A11u)
#define BQ7982X_EIS_CS_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_CS_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_CS_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_CS_LOW            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_CS_LOW_OFFSET    (0x0A12u)
#define BQ7982X_EIS_CS_LOW_POR_VAL   (0x00u)

#define BQ7982X_EIS_CS_LOW_RESULT_POS   (0x00u)
#define BQ7982X_EIS_CS_LOW_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC1_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC1_HI_OFFSET    (0x0A13u)
#define BQ7982X_EIS_VC1_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC1_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC1_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC1_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC1_MID_OFFSET    (0x0A14u)
#define BQ7982X_EIS_VC1_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC1_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC1_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC1_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC1_LO_OFFSET    (0x0A15u)
#define BQ7982X_EIS_VC1_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC1_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC1_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC2_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC2_HI_OFFSET    (0x0A16u)
#define BQ7982X_EIS_VC2_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC2_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC2_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC2_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC2_MID_OFFSET    (0x0A17u)
#define BQ7982X_EIS_VC2_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC2_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC2_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC2_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC2_LO_OFFSET    (0x0A18u)
#define BQ7982X_EIS_VC2_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC2_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC2_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC3_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC3_HI_OFFSET    (0x0A19u)
#define BQ7982X_EIS_VC3_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC3_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC3_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC3_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC3_MID_OFFSET    (0x0A1Au)
#define BQ7982X_EIS_VC3_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC3_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC3_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC3_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC3_LO_OFFSET    (0x0A1Bu)
#define BQ7982X_EIS_VC3_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC3_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC3_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC4_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC4_HI_OFFSET    (0x0A1Cu)
#define BQ7982X_EIS_VC4_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC4_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC4_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC4_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC4_MID_OFFSET    (0x0A1Du)
#define BQ7982X_EIS_VC4_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC4_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC4_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC4_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC4_LO_OFFSET    (0x0A1Eu)
#define BQ7982X_EIS_VC4_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC4_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC4_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC5_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC5_HI_OFFSET    (0x0A1Fu)
#define BQ7982X_EIS_VC5_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC5_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC5_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC5_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC5_MID_OFFSET    (0x0A20u)
#define BQ7982X_EIS_VC5_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC5_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC5_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC5_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC5_LO_OFFSET    (0x0A21u)
#define BQ7982X_EIS_VC5_LO_POR_VAL   (0x00u)

