xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_EIS_VC5_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC5_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC6_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC6_HI_OFFSET    (0x0A22u)
#define BQ7982X_EIS_VC6_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC6_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC6_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC6_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC6_MID_OFFSET    (0x0A23u)
#define BQ7982X_EIS_VC6_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC6_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC6_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC6_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC6_LO_OFFSET    (0x0A24u)
#define BQ7982X_EIS_VC6_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC6_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC6_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC7_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC7_HI_OFFSET    (0x0A25u)
#define BQ7982X_EIS_VC7_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC7_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC7_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC7_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC7_MID_OFFSET    (0x0A26u)
#define BQ7982X_EIS_VC7_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC7_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC7_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC7_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC7_LO_OFFSET    (0x0A27u)
#define BQ7982X_EIS_VC7_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC7_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC7_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC8_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC8_HI_OFFSET    (0x0A28u)
#define BQ7982X_EIS_VC8_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC8_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC8_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC8_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC8_MID_OFFSET    (0x0A29u)
#define BQ7982X_EIS_VC8_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC8_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC8_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC8_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC8_LO_OFFSET    (0x0A2Au)
#define BQ7982X_EIS_VC8_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC8_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC8_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC9_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC9_HI_OFFSET    (0x0A2Bu)
#define BQ7982X_EIS_VC9_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC9_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC9_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC9_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC9_MID_OFFSET    (0x0A2Cu)
#define BQ7982X_EIS_VC9_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC9_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC9_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC9_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC9_LO_OFFSET    (0x0A2Du)
#define BQ7982X_EIS_VC9_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC9_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC9_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC10_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC10_HI_OFFSET    (0x0A2Eu)
#define BQ7982X_EIS_VC10_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC10_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC10_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC10_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC10_MID_OFFSET    (0x0A2Fu)
#define BQ7982X_EIS_VC10_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC10_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC10_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC10_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC10_LO_OFFSET    (0x0A30u)
#define BQ7982X_EIS_VC10_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC10_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC10_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC11_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC11_HI_OFFSET    (0x0A31u)
#define BQ7982X_EIS_VC11_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC11_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC11_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC11_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC11_MID_OFFSET    (0x0A32u)
#define BQ7982X_EIS_VC11_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC11_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC11_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC11_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC11_LO_OFFSET    (0x0A33u)
#define BQ7982X_EIS_VC11_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC11_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC11_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC12_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC12_HI_OFFSET    (0x0A34u)
#define BQ7982X_EIS_VC12_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC12_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC12_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC12_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC12_MID_OFFSET    (0x0A35u)
#define BQ7982X_EIS_VC12_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC12_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC12_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC12_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC12_LO_OFFSET    (0x0A36u)
#define BQ7982X_EIS_VC12_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC12_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC12_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC13_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC13_HI_OFFSET    (0x0A37u)
#define BQ7982X_EIS_VC13_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC13_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC13_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC13_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC13_MID_OFFSET    (0x0A38u)
#define BQ7982X_EIS_VC13_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC13_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC13_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC13_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC13_LO_OFFSET    (0x0A39u)
#define BQ7982X_EIS_VC13_LO_POR_VAL   (0x00u)

