xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_EIS_VC13_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC13_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC14_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC14_HI_OFFSET    (0x0A3Au)
#define BQ7982X_EIS_VC14_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC14_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC14_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC14_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC14_MID_OFFSET    (0x0A3Bu)
#define BQ7982X_EIS_VC14_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC14_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC14_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC14_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC14_LO_OFFSET    (0x0A3Cu)
#define BQ7982X_EIS_VC14_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC14_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC14_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC15_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC15_HI_OFFSET    (0x0A3Du)
#define BQ7982X_EIS_VC15_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC15_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC15_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC15_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC15_MID_OFFSET    (0x0A3Eu)
#define BQ7982X_EIS_VC15_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC15_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC15_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC15_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC15_LO_OFFSET    (0x0A3Fu)
#define BQ7982X_EIS_VC15_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC15_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC15_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC16_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC16_HI_OFFSET    (0x0A40u)
#define BQ7982X_EIS_VC16_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC16_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC16_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC16_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC16_MID_OFFSET    (0x0A41u)
#define BQ7982X_EIS_VC16_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC16_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC16_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC16_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC16_LO_OFFSET    (0x0A42u)
#define BQ7982X_EIS_VC16_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC16_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC16_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC17_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC17_HI_OFFSET    (0x0A43u)
#define BQ7982X_EIS_VC17_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC17_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC17_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC17_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC17_MID_OFFSET    (0x0A44u)
#define BQ7982X_EIS_VC17_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC17_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC17_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC17_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC17_LO_OFFSET    (0x0A45u)
#define BQ7982X_EIS_VC17_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC17_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC17_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC18_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC18_HI_OFFSET    (0x0A46u)
#define BQ7982X_EIS_VC18_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC18_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC18_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC18_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC18_MID_OFFSET    (0x0A47u)
#define BQ7982X_EIS_VC18_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC18_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC18_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC18_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC18_LO_OFFSET    (0x0A48u)
#define BQ7982X_EIS_VC18_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC18_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC18_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC19_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC19_HI_OFFSET    (0x0A49u)
#define BQ7982X_EIS_VC19_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC19_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC19_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC19_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC19_MID_OFFSET    (0x0A4Au)
#define BQ7982X_EIS_VC19_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC19_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC19_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC19_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC19_LO_OFFSET    (0x0A4Bu)
#define BQ7982X_EIS_VC19_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC19_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC19_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC20_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC20_HI_OFFSET    (0x0A4Cu)
#define BQ7982X_EIS_VC20_HI_POR_VAL   (0x80u)

