xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_EIS_VC20_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC20_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC20_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC20_MID_OFFSET    (0x0A4Du)
#define BQ7982X_EIS_VC20_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC20_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC20_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC20_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC20_LO_OFFSET    (0x0A4Eu)
#define BQ7982X_EIS_VC20_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC20_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC20_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC21_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC21_HI_OFFSET    (0x0A4Fu)
#define BQ7982X_EIS_VC21_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC21_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC21_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC21_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC21_MID_OFFSET    (0x0A50u)
#define BQ7982X_EIS_VC21_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC21_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC21_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC21_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC21_LO_OFFSET    (0x0A51u)
#define BQ7982X_EIS_VC21_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC21_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC21_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC22_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC22_HI_OFFSET    (0x0A52u)
#define BQ7982X_EIS_VC22_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC22_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC22_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC22_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC22_MID_OFFSET    (0x0A53u)
#define BQ7982X_EIS_VC22_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC22_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC22_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC22_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC22_LO_OFFSET    (0x0A54u)
#define BQ7982X_EIS_VC22_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC22_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC22_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC23_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC23_HI_OFFSET    (0x0A55u)
#define BQ7982X_EIS_VC23_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC23_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC23_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC23_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC23_MID_OFFSET    (0x0A56u)
#define BQ7982X_EIS_VC23_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC23_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC23_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC23_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC23_LO_OFFSET    (0x0A57u)
#define BQ7982X_EIS_VC23_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC23_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC23_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC24_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC24_HI_OFFSET    (0x0A58u)
#define BQ7982X_EIS_VC24_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC24_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC24_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC24_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC24_MID_OFFSET    (0x0A59u)
#define BQ7982X_EIS_VC24_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC24_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC24_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC24_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC24_LO_OFFSET    (0x0A5Au)
#define BQ7982X_EIS_VC24_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC24_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC24_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC25_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC25_HI_OFFSET    (0x0A5Bu)
#define BQ7982X_EIS_VC25_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC25_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC25_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC25_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC25_MID_OFFSET    (0x0A5Cu)
#define BQ7982X_EIS_VC25_MID_POR_VAL   (0x00u)

