xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_EIS_VC25_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC25_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC25_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC25_LO_OFFSET    (0x0A5Du)
#define BQ7982X_EIS_VC25_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC25_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC25_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC26_HI            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC26_HI_OFFSET    (0x0A5Eu)
#define BQ7982X_EIS_VC26_HI_POR_VAL   (0x80u)

#define BQ7982X_EIS_VC26_HI_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC26_HI_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC26_MID            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC26_MID_OFFSET    (0x0A5Fu)
#define BQ7982X_EIS_VC26_MID_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC26_MID_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC26_MID_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * EIS_VC26_LO            (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_EIS_VC26_LO_OFFSET    (0x0A60u)
#define BQ7982X_EIS_VC26_LO_POR_VAL   (0x00u)

#define BQ7982X_EIS_VC26_LO_RESULT_POS   (0x00u)
#define BQ7982X_EIS_VC26_LO_RESULT_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DEBUG_CTRL_UNLOCK           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_CTRL_UNLOCK_OFFSET    (0x0C00u)
#define BQ7982X_DEBUG_CTRL_UNLOCK_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_CTRL_UNLOCK_CODE   (0x00u)
#define BQ7982X_MSK_DEBUG_CTRL_UNLOCK_CODE   (0xFFu)

/* --------------------------------------------------------------------------
 * DEBUG_COMM_CTRL1           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COMM_CTRL1_OFFSET    (0x0C01u)
#define BQ7982X_DEBUG_COMM_CTRL1_POR_VAL   (0x02u)

#define BQ7982X_POS_DEBUG_COMM_CTRL1_CT_DIS   (0x02u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL1_CT_DIS   (0x04u)

#define BQ7982X_POS_DEBUG_COMM_CTRL1_PSPI_EN   (0x01u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL1_PSPI_EN   (0x02u)

#define BQ7982X_POS_DEBUG_COMM_CTRL1_USER_PSPI_EN   (0x00u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL1_USER_PSPI_EN   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_COMM_CTRL2           (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COMM_CTRL2_OFFSET    (0x0C02u)
#define BQ7982X_DEBUG_COMM_CTRL2_POR_VAL   (0x1Eu)

#define BQ7982X_POS_DEBUG_COMM_CTRL2_COML_TX_EN   (0x04u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL2_COML_TX_EN   (0x10u)

#define BQ7982X_POS_DEBUG_COMM_CTRL2_COML_RX_EN   (0x03u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL2_COML_RX_EN   (0x08u)

#define BQ7982X_POS_DEBUG_COMM_CTRL2_COMH_TX_EN   (0x02u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL2_COMH_TX_EN   (0x04u)

#define BQ7982X_POS_DEBUG_COMM_CTRL2_COMH_RX_EN   (0x01u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL2_COMH_RX_EN   (0x02u)

#define BQ7982X_POS_DEBUG_COMM_CTRL2_USER_DAISY_EN   (0x00u)
#define BQ7982X_MSK_DEBUG_COMM_CTRL2_USER_DAISY_EN   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_COMM_STAT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COMM_STAT_OFFSET    (0x0C80u)
#define BQ7982X_DEBUG_COMM_STAT_POR_VAL   (0x33u)

#define BQ7982X_POS_DEBUG_COMM_STAT_HW_SPI_DRV   (0x05u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_HW_SPI_DRV   (0x20u)

#define BQ7982X_POS_DEBUG_COMM_STAT_HW_DAISY_DRV   (0x04u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_HW_DAISY_DRV   (0x10u)

#define BQ7982X_POS_DEBUG_COMM_STAT_COML_TX_ON   (0x03u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_COML_TX_ON   (0x08u)

#define BQ7982X_POS_DEBUG_COMM_STAT_COML_RX_ON   (0x02u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_COML_RX_ON   (0x04u)

#define BQ7982X_POS_DEBUG_COMM_STAT_COMH_TX_ON   (0x01u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_COMH_TX_ON   (0x02u)

#define BQ7982X_POS_DEBUG_COMM_STAT_COMH_RX_ON   (0x00u)
#define BQ7982X_MSK_DEBUG_COMM_STAT_COMH_RX_ON   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_SEC_DED1           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_SEC_DED1_OFFSET    (0x0C81u)
#define BQ7982X_DEBUG_SEC_DED1_POR_VAL   (0x00u)

#define BQ7982X_DEBUG_SEC_DED1_BLOCKH_POS   (0x03u)
#define BQ7982X_DEBUG_SEC_DED1_BLOCKH_MSK   (0x08u)

#define BQ7982X_DEBUG_SEC_DED1_MEM_POS   (0x01u)
#define BQ7982X_DEBUG_SEC_DED1_MEM_MSK   (0x06u)

#define BQ7982X_POS_DEBUG_SEC_DED1_SEC_DED   (0x00u)
#define BQ7982X_MSK_DEBUG_SEC_DED1_SEC_DED   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_SEC_DED2           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_SEC_DED2_OFFSET    (0x0C82u)
#define BQ7982X_DEBUG_SEC_DED2_POR_VAL   (0x00u)

#define BQ7982X_DEBUG_SEC_DED2_BLOCK_POS   (0x00u)
#define BQ7982X_DEBUG_SEC_DED2_BLOCK_MSK   (0xFFu)

/* --------------------------------------------------------------------------
 * DEBUG_COMH_BIT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COMH_BIT_OFFSET    (0x0C83u)
#define BQ7982X_DEBUG_COMH_BIT_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_COMH_BIT_TRANSIT_BUF_UF   (0x03u)
#define BQ7982X_MSK_DEBUG_COMH_BIT_TRANSIT_BUF_UF   (0x08u)

#define BQ7982X_POS_DEBUG_COMH_BIT_NCS_ERR   (0x02u)
#define BQ7982X_MSK_DEBUG_COMH_BIT_NCS_ERR   (0x04u)

#define BQ7982X_POS_DEBUG_COMH_BIT_FMT_ERR   (0x01u)
#define BQ7982X_MSK_DEBUG_COMH_BIT_FMT_ERR   (0x02u)

