xiansenchen666-debug/EIS_n32l406/CubeCommon/L2_BSP/BSP_BQ7982X_REGS.h
#define BQ7982X_POS_DEBUG_COMH_BIT_RXDATA_UNEXP   (0x00u)
#define BQ7982X_MSK_DEBUG_COMH_BIT_RXDATA_UNEXP   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_COMH_FRAME           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COMH_FRAME_OFFSET    (0x0C84u)
#define BQ7982X_DEBUG_COMH_FRAME_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_TR_EOF   (0x06u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_TR_EOF   (0x20u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_RC_UNEXP   (0x05u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_RC_UNEXP   (0x10u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_RC_CFERR   (0x04u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_RC_CFERR   (0x08u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_RC_TXDIS   (0x03u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_RC_TXDIS   (0x04u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_RC_EOF   (0x01u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_RC_EOF   (0x02u)

#define BQ7982X_POS_DEBUG_COMH_FRAME_RC_CRC   (0x00u)
#define BQ7982X_MSK_DEBUG_COMH_FRAME_RC_CRC   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_COML_BIT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COML_BIT_OFFSET    (0x0C85u)
#define BQ7982X_DEBUG_COML_BIT_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_COML_BIT_TRANSIT_BUF_UF   (0x03u)
#define BQ7982X_MSK_DEBUG_COML_BIT_TRANSIT_BUF_UF   (0x08u)

#define BQ7982X_POS_DEBUG_COML_BIT_NCS_ERR   (0x02u)
#define BQ7982X_MSK_DEBUG_COML_BIT_NCS_ERR   (0x04u)

#define BQ7982X_POS_DEBUG_COML_BIT_FMT_ERR   (0x01u)
#define BQ7982X_MSK_DEBUG_COML_BIT_FMT_ERR   (0x02u)

#define BQ7982X_POS_DEBUG_COML_BIT_RXDATA_UNEXP   (0x00u)
#define BQ7982X_MSK_DEBUG_COML_BIT_RXDATA_UNEXP   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_COML_FRAME           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_COML_FRAME_OFFSET    (0x0C86u)
#define BQ7982X_DEBUG_COML_FRAME_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_COML_FRAME_TR_EOF   (0x06u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_TR_EOF   (0x20u)

#define BQ7982X_POS_DEBUG_COML_FRAME_RC_UNEXP   (0x05u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_RC_UNEXP   (0x10u)

#define BQ7982X_POS_DEBUG_COML_FRAME_RC_CFERR   (0x04u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_RC_CFERR   (0x08u)

#define BQ7982X_POS_DEBUG_COML_FRAME_RC_TXDIS   (0x03u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_RC_TXDIS   (0x04u)

#define BQ7982X_POS_DEBUG_COML_FRAME_RC_EOF   (0x01u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_RC_EOF   (0x02u)

#define BQ7982X_POS_DEBUG_COML_FRAME_RC_CRC   (0x00u)
#define BQ7982X_MSK_DEBUG_COML_FRAME_RC_CRC   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_PSPI_BIT           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_PSPI_BIT_OFFSET    (0x0C90u)
#define BQ7982X_DEBUG_PSPI_BIT_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_PSPI_BIT_TRANSIT_BUF_UF   (0x04u)
#define BQ7982X_MSK_DEBUG_PSPI_BIT_TRANSIT_BUF_UF   (0x10u)

#define BQ7982X_POS_DEBUG_PSPI_BIT_FMT_ERR   (0x03u)
#define BQ7982X_MSK_DEBUG_PSPI_BIT_FMT_ERR   (0x08u)

#define BQ7982X_POS_DEBUG_PSPI_BIT_RXDATA_UNEXP   (0x02u)
#define BQ7982X_MSK_DEBUG_PSPI_BIT_RXDATA_UNEXP   (0x04u)

#define BQ7982X_POS_DEBUG_PSPI_BIT_TXFIFO_UF   (0x01u)
#define BQ7982X_MSK_DEBUG_PSPI_BIT_TXFIFO_UF   (0x02u)

#define BQ7982X_POS_DEBUG_PSPI_BIT_RXFIFO_OF   (0x00u)
#define BQ7982X_MSK_DEBUG_PSPI_BIT_RXFIFO_OF   (0x01u)

/* --------------------------------------------------------------------------
 * DEBUG_PSPI_FRAME           (R):
 * -------------------------------------------------------------------------- */
#define BQ7982X_DEBUG_PSPI_FRAME_OFFSET    (0x0C91u)
#define BQ7982X_DEBUG_PSPI_FRAME_POR_VAL   (0x00u)

#define BQ7982X_POS_DEBUG_PSPI_FRAME_TR_EOF   (0x04u)
#define BQ7982X_MSK_DEBUG_PSPI_FRAME_TR_EOF   (0x08u)

#define BQ7982X_POS_DEBUG_PSPI_FRAME_RC_CFERR   (0x03u)
#define BQ7982X_MSK_DEBUG_PSPI_FRAME_RC_CFERR   (0x04u)

#define BQ7982X_POS_DEBUG_PSPI_FRAME_RC_EOF   (0x01u)
#define BQ7982X_MSK_DEBUG_PSPI_FRAME_RC_EOF   (0x02u)

#define BQ7982X_POS_DEBUG_PSPI_FRAME_RC_CRC   (0x00u)
#define BQ7982X_MSK_DEBUG_PSPI_FRAME_RC_CRC   (0x01u)

/*   Factory Test Mode */
#define BQ7982X_FACT_TM_REG                  (0x800u)

/* --------------------------------------------------------------------------
 * OTP_SPARE   (R/W):
 * -------------------------------------------------------------------------- */
#define BQ7982X_OTP_SPARE13_OFFSET                (0x0005u)
#define BQ7982X_OTP_SPARE13_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE12_OFFSET                (0x0006u)
#define BQ7982X_OTP_SPARE12_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE11_OFFSET                (0x000Au)
#define BQ7982X_OTP_SPARE11_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE10_OFFSET                (0x000Bu)
#define BQ7982X_OTP_SPARE10_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE9_OFFSET                (0x001Bu)
#define BQ7982X_OTP_SPARE9_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE8_OFFSET                (0x0029u)
#define BQ7982X_OTP_SPARE8_POR_VAL               (0x00u)

#define BQ7982X_OTP_SPARE7_OFFSET                (0x002Au)
#define BQ7982X_OTP_SPARE7_POR_VAL               (0x00u)


/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Function Prototypes
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************

#ifdef __cplusplus
}
#endif

#endif /* BQ7982X_REGS_H */

/*********************************************************************************************************************
 * End of File: bq7982x_regs.h
 *********************************************************************************************************************/
